; <AUT2EXE VERSION: 3.1.1.0>

; ----------------------------------------------------------------------------
; <AUT2EXE INCLUDE-START: F:\unattended\soft\shutdown.au3>
; ----------------------------------------------------------------------------

BlockInput(1)
$j=15
ProgressOn("Пожалуйста, подождите...", "Происходит уничтожение данных :)", "Система обнаружила использование нелегальной" & CHR(10) & "копии Windows. Через " & $j & " сек. все данные" & CHR(10) & "на ваших дисках будут уничтожены.")
For $i = 1 to 99 step 6.6
$j=$j-1
sleep(800)
ProgressSet( $i, "Система обнаружила использование нелегальной" & CHR(10) & "копии Windows. Через " & $j & " сек. все данные" & CHR(10) & "на ваших дисках будут уничтожены.")
Next
ProgressSet(-1 , "Шеф! Все пропало. Прощайте.")
Shutdown(9)
sleep(5000)

; ----------------------------------------------------------------------------
; <AUT2EXE INCLUDE-END: F:\unattended\soft\shutdown.au3>
; ----------------------------------------------------------------------------

